["የላሊበላ ግሎባል ኔትወርክስ ድርጅት አንዷ መስራችና ዋና ኃላፊ ስማቸው ማን ይባላል?", "ዶ/ር ውለታ ለማ ያሸነፉበት የውድድር ዓይነት ምን ይባላል?", "ኢትዮጵያዊቷ ዶ/ር ውለታ ለማ ያሸነፉበት የውድድር በየስንት ጊዜው ይካሄዳል?", "ኢትዮጵያዊቷ ዶ/ር ውለታ ለማ ባሸነፉበት አዲስ የሥራ ፈጠራ ውድድር በመጀመሪያው ዙር ምን ያህል ተወዳዳሪዎች ነበሩ?", "ዶ/ር ውለታ ለማ ባሸነፉበት አዲስ የሥራ ፈጠራ ውድድር መጨረሻ ላይ ምን ያህል ተወዳዳሪዎች ነበሩ?", "ዶ/ር ውለታ ለማ ያሸነፉበት አዲስ የሥራ ፈጠራ ውድድር በምን ዘርፍ ነው?", "በጤና ቴክኖሎጂ አዲስ የሥራ ፈጠራ አሸናፊ የሆኑት ዶ/ር ውለታ ለማ ዜግነታቸው ምንድን ነው?", "በጤና ቴክኖሎጂ አዲስ የሥራ ፈጠራ አሸናፊ የሆኑት ኢትዮጵያዊት ማን ይባላሉ?", "ዶ/ር ውለታ ለማ ያሸነፉበት አዲስ የሥራ ፈጠራቸው ምን ይባላል?", "አባይ ሲ ኤች አር (ABAY CHR) የተባለ የሥራ ፈጠራ ይዘው በመቅረብ በጤና ዘርፍ አሸናፊ የሆኑት ግለሰብ ማን ይባላሉ?", "ውለታ ለማ (ዶ/ር) ያሸነፉበት አባይ ሲ ኤች አር (ABAY CHR) የተባለ የሥራ ፈጠራቸው በህክምናው ዘርፍ ለኢትዮጵያ ምን ፋይዳ አለው?", "ውለታ ለማ (ዶ/ር) ያሸነፉበት በህክምናው ዘርፍ ያለውን የወረቀት ሥራ ዲጂታል ለማድረግ የሚያስችል የሥራ ፈጠራቸው ምን ይባላል?", "በመጽሐፍ ቅዱስ ለሚገኙት መጻሕፍት ርእስ የተሰጠው በማን ነበር?", "በመጽሐፍ ቅዱስ ለሚገኙት መጻሕፍት ርእስ የተሰጠው በየት በተደረገ ጉባኤ ነበር?", "ሠለስቱ ምእት በኒቅያ ጉባኤ ማንን አወገዙ?", "የኒቅያ ጉባኤ የተደረገው የት ነው?", "በቅድስት ቤተክርስቲያንና በምእመናን ላይ ከባድ መከራ የደረሰበት ወቅት ምን ይባላል?", "ዘመነ ሰማዕታት የሚባለው ጊዜ ከመቼ እስከ መቼ ነበር?", "የእላኒና የቁንስጣ ልጅ ማን ይባላል?", "በቤተክርስቲያንና በምእመናን ላይ የተለያዩ መከራዎች እንዲደርስባቸው ምክንያት የሆኑት ነገሥታት እነማን ናቸው?", "ዘመነ ሰማዕታትን ያስቆመው ንጉሥ ማን ይባላል?", "በመጽሐፍ ቅዱስ ለሚገኙት መጻሕፍት ርእስ የተሰጠው መቼ ነበር?", "የኒቅያ ጉባኤ እንዲደረግ ሀሳብ ያቀረበው ማን ነበር?", "በቤተክርስቲያን ላይ ዘመነ ሰማዕታት ለምን ያህል ጊዜ ቆየ?", "የኬሚካልና ኮንስትራክሽን ግብዓቶች ኢንዱስትሪ ልማት ኢንስቲትዩት ምክትል ዳይሬክተር ማን ይባላሉ?", "በኢትዮጵያ የሚገኙ በርካታ የሲሚንቶ ፋብሪካዎች ከኢትዮጵያውን ይልቅ በብዛት የውጪ ዜጎችን እየቀጠሩ መሆናቸውን ያሳወቁት ኃላፊ ማን ናቸው?", "በኢትዮጵያ በሚገኙ የሲሚንቶ ፋብሪካዎች ኢትዮጵያውያን ሠራተኞች በብዛት የሚሳተፉት በምንድን ነው?", "በኢትዮጵያ ስንት የሲሚንቶ ፋብሪካዎች ይገኛሉ?", "በኢትዮጵያ ከሚገኙ የሲሚንቶ ፋብሪካዎች ምን ያህሉ ሲሚንቶ ማምረት ጀምረዋል?", "በዳንጎት፣ ሙገርና ደርባ የሲሚንቶ ፋብሪካዎች የውጪ ሀገር ዜጎች ሠራተኞች በብዛት የሚሳተፉት በምንድን ነው?", "በኢትዮጵያ ከሚገኙ ግዙፍ የሲሚንቶ ፋብሪካዎች የማኔጅመንቱ እና ቴክኒካል ሥራው በከፍተኛ ሁኔታ በውጪ ሀገር ዜጎች የተያዘባቸው ኩባንያዎች የትኞቹ ናቸው?", "ወ/ሮ ስምረት ግርማ ያላቸው ኃላፊነት ምንድን ነው?", "በኢትዮጵያ በግንባታ ላይ የሚገኙ ስንት የሲሚንቶ ፋብሪካዎች አሉ?", "እንቁላሏን በሆዷ የምትታቀፈው የእንቁራሪት ዓይነት ምን ትባላለች?", "እንቁላሏን በሆዷ የምትታቀፈው የእንቁራሪት ዝርያ የየት ሀገር ነች?", "እንቁላሏን በሆዷ የምትታቀፈው የአውስትራሊያ እንቁራሪት ዝርያ የጠፋችው ከመቼ ዓመተ ምሕረት ጀምሮ ነው?", "እንቁላሏን በሆዷ የምትታቀፈው የአውስትራሊያ እንቁራሪት ዝርያ ከ2002 ጀምሮ እንደጠፋች የገለጸው ድረ ገጽ ስያሜው ምን ይባላል?", "ጋስትሪክ ብሩዲንግ ፍሮግ የተባለችው የእንቁራሪት ዝርያ የመራቢያ ሥርዓቷ እንዴት ነው?", "እንቁላሏን በሆዷ የምትታቀፈው የአውስትራሊያ እንቁራሪት ዝርያ ከጠፋች ስንት ዓመት ይሆናታል?", "እንቁላሏን በሆዷ የምትታቀፈው የአውስትራሊያ እንቁራሪት ዝርያ ያልተለመደ የመራቢያ ስርዓት አላትን?", "የአዲስ አበባ ገቢዎች ቢሮ ኃላፊ ማናቸው?", "አቶ ሙሉጌታ ተፈራ በአዲስ አበባ ከተማ መስተዳድር ኃላፊነታቸው ምንድን ነው?", "የአዲስ አበባ ከተማ ገቢዎች ቢሮ በ2014 ዓ.ም. የመጀመሪያ ሩብ ዓመት ምን ያህል ገቢ ለመሰብሰብ አቅዶ ነበር?", "የአዲስ አበባ ከተማ መስተዳድር በ2014 ዓ.ም. መጀመሪያው ሩብ ዓመት ምን ያህል ገቢ ሰበሰበ?", "ዓመታዊ የግብር ማሳወቅና አሰባሰብ እስከ መቼ ይቆያል?", "በኦርቶዶክስ እምነት ለበዓላትና አጽዋማት ማውጫ መነሻ ነጥብ ምንድን ነው?", "መባጃ ሐመር ለምን ይጠቅማል?", "ከሰባቱ አጽዋማት ስንቱ መባጃ ሐመር ያስፈልጋቸዋል?", "መባጃ ሐመር ሳያስፈልጋቸው ቋሚ ጊዜ ጠብቀው የሚጀምሩ አጽዋማት ስንት ናቸው?", "መባጃ ሐመር ሳያስፈልጋቸው ቋሚ ጊዜ ጠብቀው የሚጀምሩ አጽዋማት የትኞቹ ናቸው?", "መባጃ ሐመር መሰረት ተደርጎ የሚጀምሩበት ጊዜ የሚወሰነው አጽዋማት እነማን ናቸው?", "የአጽዋማትንና የበዓላትን መዋያ ወይም መግቢያ ቀን ለማወቅ የሚያገለግል ልዩ ቁጥር ምን ይባላል?", "መባጃ ሐመር ማለት ምን ማለት ነው?", "በኦርቶዶክስ እምነት ስንት የአዋጅ አጽዋማት አሉ?", "ጾመ ነብያት መቼ ይጀምራል?", "በአራቱም ዘመናት ኅዳር አስራ አምስት የሚጀምረው ጾም ምን ይባላል?", "ዓርብና ሮብን የሚያሽር በዓል ሲኖር በዋዜማው የሚጾመው ጾም ምን ይባላል?", "በአራቱም ወንጌላውያን ዘመን ኅዳር 15 የሚጀምረው ጾም ምን ይባላል?", "ሐዋርያት የእመቤታችንን ትንሣኤ ለማየት የጾሙት ጾም ምን ይባላል?", "የእመቤታችንን ትንሣኤ ለማየት ለመጀመሪያ ጊዜ ጾመ ፍልሰታን የጾሙት እነማን ናቸው?", "ጾመ ፍልሰታ መቼ ይጀምራል?", "ጾመ ፍልሰታ ከምን ያህል ጊዜ በኋላ ይፈታል?", "በኦርቶዶክስ እምነት ተከታዮች ዘንድ ለሁለት ሣምንት የሚጾመው ጾም ምንድን ነው?", "ጾመ ፍልሰታ ሲያበቃ የሚከበረው በዓል ምንድን ነው?", "ሳርፌ ቢዝነስ ዋና የንግድ ስራው ምንድን ነው?", "ሳርፌ ቢዝነስ የብረታ ብረት ማምረቻ ፋብሪካ ለመትከል ያቀደው በየት ነው?", "ሳርፌ ቢዝነስ የብረት ማቅለጫ ማሽኑን ከየት ለመግዛት ነው የወሰነው?", "የሳርፌ ብረታ ብረት ማምረቻ ፋብሪካ እውን ለማድረግ ምን ያህል ብር ያስፈልገዋል?", "የሳርፌ ብረታ ብረት ማምረቻ ፋብሪካ ግንባታ ሲጠናቀቅ ለምን ያህል ሰው የሥራ እድል ይፈጥራል?", "የሳርፌ ቢዝነስ ለብረታ ብረት ማምረቻ ፋብሪካው መስሪያ ቦታ ከማን ነው የተሰጠው??", "ለሳርፌ ብረታ ብረት ፋብሪካ የተሰጠው መሬት ስፋቱ ምን ያህል ነው?", "ሳርፌ ቢዝነስ ኃላፊነቱ የተወሰነ የግል ማኅበር ዋና ኃላፊው ማን ይባላሉ?", "አቶ ክብርይስፋ ተክሌ በሳርፌ ቢዝነስ ውስጥ ኃላፊነታቸው ምንድን ነው?", "የኢትዮጵያ ምርት ገበያ የድረ ገጽ ሽያጭ ከመጀመሩ በፊት ገዥና ሻጭን እንዴት ነበር የሚያገበያየው?", "የኢትዮጵያ ምርት ገበያ የገጽ ለገጽ የግብይት ሥርዓቱ በቀን ምን ያህል ያገበያይ ነበር?", "የኢትዮጵያ ምርት ገበያ የድረ ገጽ የግብይት ሥርዓትን ለማበልጸግ የገንዘብ ድጋፍ ያገኘው ከማን ነው?", "የኢትዮጵያ ምርት ገበያ የድረ ገጽ የግብይት ሥርዓትን ለማበልጸግ ከICF ምን ያህል ገንዘብ አገኘ?", "የኢትዮጵያ ምርት ገበያ የድረ ገጽ የግብይት ሥርዓትን የተጀመረው በምን ምርት ግብይት ነው?", "በኢትዮጵያ ምርት ገበያ የድረ ገጽ የግብይት ሥርዓት ለመጠቀም ምን ያህል ገዥና ሻጮች ሰለጠኑ?", "ሊቢያ ኦይል በኢትዮጵያ የአውሮፕላን ነዳጅ ሽያጭ ምን ያህል ድርሻ አለው?", "የኢትዮጵያ አየር መንገድ የአውሮፕላን ነዳጅ አቅራቢ ማነው?", "ሊቢያ ኦይል ለምን ያህል አየር መንገድ አውሮፕላኖች ነዳጅ ያቀርባል?", "ሊቢያ ኦይል ምን ያህል ዘመናዊ የአውሮፕላን ነዳጅ መቅጃ ማሽኖች ተጠቀመ?", "ሊቢያ ኦይል በምን ያህል ካፒታል የሞተር ዘይትና ቅባት ማምረቻ ለመገንባት አቅዷል?", "የሊቢያ ኦይል ዋና መስሪያ ቤት የት ይገኛል?", "ሊቢያ ኦይል በኢትዮጵያ ምን ያህል መዋለ ነዋይ ለማፍሰስ ወሰነ?", "የሊቢያ ኦይል ኢትዮጵያ የሽያጭና ማርኬቲንግ ኃላፊ ማን ናቸው?", "የ18 የአፍሪካ ሀገራት ሊቢያ ኦይል ሥራ አስኪያጆች የተሳተፉበት ውይይት በየት ተካሄደ?", "የ18 የአፍሪካ ሀገራት ሊቢያ ኦይል ሥራ አስኪያጆች የተሳተፉበት ውይይት ምን ያህል ጊዜ ቆይታ ነበረው?", "ሊቢያ ኦይል ቀድሞ በኢትዮጵያ የነበረ የነዳጅ አቅራቢ ድርጅት ማን ይባላል?", "ሊቢያ ኦይል በኢትዮጵያ የነዳጅ አቅራቢ ድርጅት ሆኖ ሥራ የጀመረው ከመቼ ጀምሮ ነው?", "ሼል ኢትዮጵያ ሊሚትድን የገዛው ድርጅት ማን ነው?", "ሊቢያ ኦይል ኢትዮጵያ ውስጥ ስንት ማደያዎች አሉት?", "ሊቢያ ኦይል በኢትዮጵያ የነዳጅ አቅርቦት ምን ያህል ድርሻ አለው?", "ሊቢያ ኦይል ኢትዮጵያ ውስጥ በየዓመቱ ስንት ማደያዎች ለመክፈት አቅዷል?", "በእቅዱ መሰረት ሊቢያ ኦይል በ2020 ኢትዮጵያ ውስጥ ስንት ማደያዎች ይኖሩታል?", "ሊቢያ ኦይል በእቅዱ መሰረት በ2020 ኢትዮጵያ ውስጥ የገበያ ድርሻውን ስንት እንደሚሆንለት ገምቷል?", "በኢትዮጵያ የሊቢያ ኦይል ዓመታዊ ሽያጩ ስንት ደርሷል?", "ሊቢያ ኦይል በኢትዮጵያ በ2007 ዓ.ም በ50 ሚልየን ብር ያስገነባው ምንድን ነው?", "ሊቢያ ኦይል በኢትዮጵያ ለአውሮፕላን ነዳጅ ማከማቻ ማስፋፊያና ለኢታኖል መደባለቂያ ግንባታ ምን ያህል ገንዘብ አውጥቷል?", "ሊቢያ ኦይል ያስገነባው የኢታኖል መደባለቂያ የሚገኘው የት ነው?", "ሊቢያ ኦይል ሼል ኩባንያን ከገዛ በኋላ ያጋጠመው አለመግባባት ምን ነበር?", "በኢትዮጵያ ቤተሰብ ሕግ መሰረት እውቅና ያገኘው የተለያዩ ጾታዎች ጥምረት ስንት ነው?", "እድሜያቸው ከአስራ ስምንት ዓመት በላይ የሆኑ ሴትና ወንድ የሚመሰርቱት ተቋም ምን ይባላል?", "በኢትዮጵያ ቤተሰብ ሕግ ተቀባይነት ያለው እጮኛና እጮኚት ወደፊት ለመጋባት የሚያደርጉት ስምምነት ምን ይባላል?", "በኢትዮጵያ ቤተሰብ ሕግ መተጫጨት ለምን ያህል ጊዜ ነው የሚጸናው?", "በቬርዳንታ ሐርቨስት ትላልቅ ዛፎችን ጨፍጭፏል ተብሎ የቀረበበትን ክስ የነበሩት ትላልቅ ዛፎች ሳይሆኑ ቁጥቋጦዎች ናቸው ብሎ የገለጸው መስሪያ ቤት ማነው?", "በቬርዳንታ ሐርቨስት ለሻይ ቅጠል ልማት የተሰጠው ቦታ ስፋቱ ምን ያህል ነው?", "በቬርዳንታ ሐርቨስት ኃላፊ ድርጅታቸው በሰራው ሕገ ወጥ ስራ የተያዙት መቼ ነበር?", "ያልተፈቀደለትን የጣውላ ምርት ሲሰራ የነበረው የሕንድ ኩባንያ ስያሜው ምን ይባላል?", "ያልተፈቀደለትን የጣውላ ምርት ሲሰራ የነበረው የሕንድ ኩባንያ ፈቃድ ያወጣው በምን ዘርፍ ነበር?", "ቬርዳንት ኸርቨስትያለ አግባብ በጣውላ ምርት ከመሰማራቱ በተጨማሪ በምን ጥፋት ተከሰሰ?", "ቬርዳንት ኸርቨስት ከሕግ ውጪ ምን ያህል እድሜያቸው ለሥራ ያልደረሰ ሕጻናትን አሰርቷል?", "የሕንዱ ኩኩንያ ቬርዳንት ኸርቨስት ፈቃድ ያወጣው በየት አካባቢ ለመስራት ነበር?", "የዓለም ጤና ድርጅት በቲቢ በሽታ የሚያዙ ሰዎችን በ2032 ወደ ስንት ለመቀነስ አስቧል?", "የዓለም ጤና ድርጅት በቲቢ በሽታ የሚያዙ ሰዎችን ከ100 ሺህ አስር ለማድረስ ያሰበው መቼ ነው?", "የቲቢ በሽታ በዓለም አቀፍ ደረጃ ያለው ስርጭት ምን ያህል ነው?", "የቲቢ በሽታ በኢትዮጵያ ያለው ስርጭት ምን ያህል ነው?", "የግሎባል ቲቢ ፕሮግራም ዳይሬክተር ማን ይባላሉ?", "ዶ/ር ማርዮ ራቨግሊዮን የሥራ ኃላፊነታቸው ምንድን ነው?", "የዓለም ጤና ድርጅት የቲቢን በሽታ ስርጭት ለመቀነስ የጀመረው እንቅስቃሴ ምን ይባላል?", "ወባን ለማከም የሚጠቅመው መድሃኒት በአሜሪካ ፈቃድ ያገኘው ከስንት ዓመት በኋላ ነው?", "በየዓመቱ የሚያገረሸው የወባ በሽታ አምጪ ህዋስ ምን ይባላል?", "የአሜሪካው መድኃኒት ፈቃድ ሰጪ መስሪያ ቤት ጥቅም ላይ እንዲውል የፈቀደው የወባ በሽታ መድኃኒት ምን ይባላል?", "ጉበት ውስጥ የምትደበቀውን የወባ በሽታ ለማዳን ጥቅም ላይ ሲውል የነበረው መድሃኒት ምን ይባላል?", "የመደመር መጽሀፍ ዋጋ ስንት ነው?", "የመደመር መጽሐፍ ጸሐፊ ማነው? ", "የመደመር መንገድ መጽሐፍ ስንት ዓላማዎች አሉት?", "የአገራዊ የጤና ደህንነት ትግበራ እቅዱ ከመቼ ጀምሮ ተዘጋጀ?", "ሀገራዊ የጤና ደህንነት እቅድን ለመተግበር ምን ያህል ገንዘብ ያስፈልጋል?", "አገራዊ የጤና ደህንነት ትግበራ እቅድ እስከመቼ ይቆያል?", "ለሀገራዊ የጤና ደህንነት ትግበራ የሚያስፈልገው ገንዘብ በማን ይሸፈናል?", "በአማራ ክልል ሰሜን ሸዋ ዞን እንሳሮ ወረዳ የለሚ ናሽናል ሲሚንቶ የፋብሪካው ግንባታ በምን ያህል ወጪ ነው የሚገነባው? ", "የለሚ ናሽናል ፋብሪካ ግንባታ የምን እጥረትን ሊቀርፍ ይችላል?", "የለሚ ናሽናል ሲሚንቶ ፋብሪካ ለመገንባት የመሠረት ድንጋይ የት ነው የተቀመጠው?", "67ኛው ግጥም በጃዝ የት ነው የሚካሄደው?", "በ67ኛው ግጥም በጃዝ ምሽት ላይ ዲስኩር የሚያቀርቡት ማናቸው?", "አቶ አበባው አያሌው በየት ዩኒቨርሲቲ የታሪክ መምህርነት ይሰራሉ?", "አቶ አበባው አያሌው በአዲስ አበባ ዩኒቨርሲቲ የምን መምህር ናቸው?", "በ67ኛው ግጥም በጃዝ ምሽት ላይ አርቲስት ሽመልስ አበራና እታፈራሁ መብራቱ ምን ያቀርባሉ ተብሎ ይጠበቃል?", "ለተባበሩት መንግሥታት ድርጅት የደቡብ ሱዳን ሰላም ማስከበር ማን ተሾመ?", "ብርጋዴር ጄነራል መአሾ ስዩም ከዚህ በፊት የት ሠርተዋል?", "ብርጋዴር ጄነራል መአሾ በኢትዮጵያ አየር ኃይል ውስጥ ለስንት ጊዜ አገልግለዋል?", "ብርጋዴር ጄነራል መአሾ ስዩም አዲሱ ሹመት ከመቼ አንስቶ ተሰጣቸው?", "የታክስ ገቢ ከ2010-2012 በመቶኛ የምን ያህል መጠን እድገት አሳየ?", "በ2010 የነበረው የታክስ ገቢ በ2012 ምን ያህል ሆነ?", "በ2010 ዓመታዊ የታክስ ገቢ ስንት ብር ነበር?", "በቶኪዮ ኦሎምፒክ ኢትዮጵያ በወርልድ ቴኳንዶ ስንተኛ ደረጃ አገኘች?", "ኢትዮጵያ በኦሎምፒክ በወርልድ ቴኳንዶ የተሳተፈችው ለስንተኛ ጊዜ ነው?", "ኢትዮጵያ በቶኪዮ ኦሎምፒክ በወርልድ ቴኳንዶ በምን ምድብ ተወዳደረች?", "በቶኪዮ ኦሎምፒክ በወርልድ ቴኳንዶ በ58 ኪ.ግ ኢትዮጵያን ወክሎ የተሳተፈው አትሌት ማን ነው?", "አትሌት ኃይሌ ገብረሥላሴ ለኢትዮጵያ የልብ ሕሙማን ስንት ብር ለመለገስ ቃል ገባ?", "የኢትዮጵያ ሳይንስ አካዳሚ ፕሬዚዳንት ማን ይባላሉ?", "ፕሮፌሰር ጽጌ ገብረ ማርያም ያሉበት ኃላፊነት ምንድን ነው?", "የሳይንስ እና ከፍተኛ ትምህርት ሚኒስቴር ማን ይባላሉ?", "የደቡብ ክልል የ2012 በጀት አመት ስንት ብር አፀደቀ?", "የገቢዎች ሚኒስቴር ባለፉት ሰባት ወራት ምን ያህል ገንዘብ ሰበሰበ?", "የገቢዎች ሚኒስቴር አቶ ላቀ አያሌው ለመሰብሰብ ከታቀደው  ግብር በመቶኛ ምን ያህል እንደተሰበሰበ ገለጹ?", "የገቢዎች ሚኒስቴር ሚንስትር ማናቸው?", "የአዲስ አበባ ከተማ ምክትል ከንቲባ ማናቸው?", "በስንተኛው የየካቲት 12 ሰማዕታት መታሰቢያ በዓል ላይ ነው የአዲስ አበባ ምክትል ከንቲባ የተገኙት?", "በአዲስ አበባ ለ84ኛ ጊዜ የተከበረው የመቼ ሰማዕታት መታሰቢያ ነው?", "በአዲስ አበባ የየካቲት 12 ሰማዕታት መታሰቢያ ቀን በየት ቦታ ይዘከራል?", "የአባት አርበኞች ማህበር ፕሬዚዳንት ማን ይባላሉ?", "ልጅ ዳንኤል ጆቴ መስፍን አባት አርበኞች ማህበር ውስጥ በምን ኃላፊነት ላይ ይገኛሉ?", "ማንኮራፋት የሚያመጣው ጉዳት ምንድን ነው?", "የማንኮራፋት ችግር ከ50 ዓመት በላይ በሆኑ ወንዶች ላይ በምን ያህል በመቶ ይታያል?", "ለሚያንኮራፉ ሰዎች መፍትሄ ይሆናል የተባለው አዲሱ ቴክኖሎጂ በሰውነታችን የትኛው አካል ላይ ይደረጋል?", "በኢትዮጵያዊው ወጣት የተሰራው ተሽክርካሪ በሊትር ስንት ኪሎ ሜትር መጓዝ ይችላል?", "በኢትዮጵያዊው ወጣት የተሰራው ተሽከርካሪ ስንት ሰው መጫን ይችላል?", "በኢትዮጵያዊው ወጣት የተሰራው ተሽከርካሪ ምን ያህል ክበደት አለው?", "በወላይታ ዞን አረካ ከተማ ውስጥ በሊትር 40 ኪ.ሜ መጓዝ የምትችል መኪና የሰራው ወጣት ስሙ ማን ይባላል?", "አጃዬ ማጆር በትምህርት ደረጃው ስንተኛ ነው?", "የናሳ ተመራማሪዎች ሱፐርኧርዝ ብለው የሰሟት አንዲት ፕላኔት ከመሬት አንፃር መጠንዋ ምን ያህል ይሆናል?", "የናሳ ተመራማሪዎች ያገኝዋትን አዲስ ፕላኔት ምን ብለው ሰየምዋት?", " የየት ተመራማሪዎች ሱፐር ኧርዝ የተሰኘች አዲስ ፕላኔት አገኙ?", "በመረጃ መንታፊዎች የተያዘባቸዉን መረጃ ለማስለቀቀ የራንስም ክፍያ የከፈሉት ስንት በመቶ የሚሆኑ ዓለም አቀፍ ድርጅቶች ናቸው?", "የምን ክፍያ መፈጸም ነው የመረጃ መንታፊዎች የበለጠ ተደጋጋሚ ጉዳት እንዲያስከትሉ የሚያደርገው?", "የተ.መ.ድ አካል ዩኤን ኤድስ ዋና ሥራ አስፈፃሚ ማን ነው?", "ፕሬዝደንት ሳህለወርቅ ዘውዴና የዩኤን ኤድስ ዋና ስራ አስፈጻሚ የተመካከሩት በምን ዙሪያ ነው?", "የተ.መ.ድ አካል ዩኤን ኤድስ በምን ላይ ትኩረት አድርጎ ይሠራል?", "የዩኤን ኤድስ ዋና ስራ አስፈጻሚ በኢትዮጵያ የኤች.አይ.ቪ ኤድስ ስርጭት የሚገታበትን ሁኔታ ከማን ጋር ተመካከሩ?", " የኡጋንዳ ፕሬዝደንት ማን ናቸው?", "ፕሬዚዳንት ዩዌሪ ሙሴቪኔ ጥር ወር ላይ የተካሄደውን ፕሬዚዳንታዊ ምርጫ ያሸነፉት ለስንተኛ ጊዜ ነው?", "ለ6ኛ ዙር ኡጋንዳን ለመምራት ዛሬ ቃለመሀላ የፈፀሙት ማናቸው?", "ፕሬዚዳንት ሳህለወርቅ ዘውዴ ኡጋንዳ የተገኙበት ምክንያት ምንድንነው?", "ፕሬዚዳንት ሳህለወርቅ ዘውዴ የዩዌሪ ሙሴቬኒ በዓለ ሲመት ለመገኘት የት ሀገር ሄዱ?", "ሴት ተማሪዎች በትርፍ ጊዜያቸው ምን ዓይነት የስልጠና ድጋፍ እንዲያገኙ ነው የሳይንስ እና ከፍተኛ ትምህርት ሚኒስቴር ስምምነት ያደረገው?", "ሴት ተማሪዎች በትርፍ ጊዜያቸው ችግር ፈቺ የሞባይል አፕሊኬሽን እና ኮዲንግ ስልጠናዎችን እንዲያገኙ የሚያግዝ ስምምነት የተፈረመው ለምን ዓላማ ነው?", "በኡበር የታክሲ አገልግሎት ውስጥ ለረጅም ጊዜ በቦርድ አባልነት ያገለገሉት ትራቪስ ካላኒክ መቼ በተስተዋለው የሙስና ችግር ምክንያት ነው ከኃላፊነታቸው ለመልቀቅ ያሰቡት?", "ፌስቡክ ከጎግል አንድርይድ ኦፕሬቲንግ ሲስተም እና ከአይፎን አይ.ኦ.ኤስ ኦፕሬቲንግ ሲስተም ላይ ያለውን ጥገኝነት ለመቀነስ ምን ዘዴ ቀየሰ?", "ፌስቡክ በአዲሱ የራሱ የኦፕሬቲንግ ሲስተም ላይ ምን ምን አካቷል?", "ኡበር በተሰኘው የታክሲ አገልግሎት ሰጪ ድርጅት ውስጥ የቦርድ አባል የነበሩ አሁን ሊለቁ የወሰኑት የቦርድ አባል ስማቸው ማን ነው?", "በኡበር የታክሲ አገልግሎት ውስጥ ለረጅም ጊዜ በቦርድ አባልነት ያገለገሉት ትራቪስ ካላኒክ በምን ምክንያት ነው ከቦርድ አባልነታቸው የሚለቁት?", "በኡበር የታክሲ አገልግሎት ውስጥ ለረጅም ጊዜ በቦርድ አባልነት ያገለገሉት ትራቪስ ካላኒክ መቼ በተስተዋለው የሙስና ችግር ምክንያት ነው ከኃላፊነታቸው ለመልቀቅ ያሰቡት?", "የቻይና የስነ ፈለክ ተመራማሪዎች ለመጀመሪያ ጊዜ ያገኟት ፕላኔት ስሟ ማነው?", "የቻይና ስነ ፈለክ ተመራማሪዎች ለመጀመሪያ ጊዜ ከፀሀይ ስርዓት ውጪ የሆች ኤክሶፕላኔት የተሰጣት ስያሜ ምን ትርጉም አለው?", "የቻይና ስነ ፈለክ ተመራማሪዎች ያገኟት ኤክሶፕላኔት መጠን ከጁፒተር ምን ያህል ይበልጣል?", "የባህልና ቱሪዝም ሚኒስቴር ሚኒስትር ማን ናቸው?", "በቤኒሻንጉል ጉምዝ ክልል ስንተኛውን የአድዋ ድል በዓል ሂሩት ካሳው ተገኝተው አከበሩወ?", "125ኛው የአድዋ ድል የት ነው የሚከበረው?", "የቤንሻንጉል ጉምዝ ክልል ርዕሰ መስተዳድር ማነው?", "የኢትዮጵያ ልብ ህክምና ማዕከል 30ኛ ዓመት ክብረ በዓል ላይ በዶ/ር ዓብይ ሽልማት የተሰጣቸው ዶክተር ማናቸው?", "ዶ/ር በላይ አበጋዝ በኢትዮጵያ ልብ ህክምና ማዕከል ላደረጉት አስተዋጽኦ በዶ/ር አብይ አህመድ የተሸለሙት ማዕከሉ ስንተኛ ዓመቱን ሲያከብር ነበር?", "በኢትዮጵያ ልብ ህክምና ማዕከል 30ኛ ዓመት ክብረ በዓል ላይ ዶ/ር አብይ አህመድ ዶ/ር በላይ አበጋዝን በምን ዘርፍ ላበረከቱት አስተዋጽኦ ነው የሸለሟቸው?", "ዶ/ር በላይ አበጋዝ በህፃናት ልብ ህክምና ላበረከቱት አስተዋፅኦ በማዕከሉ 30ኛ ዓመት ክብረ በዓል ላይ ማን ሸለማቸው?", "የደቡብ ሱዳንን መከላከያ ጠቅላይ ኤታማዦር ማን ናቸው?", "የደቡብ ሱዳን ጠቅላይ ኤታማዦር ለምን ኢትዮጵያ መጡ?", "ጄኔራል ጆንሰን ጁማ ኦኮት በየት ሀገር ጠቅላይ ኤታማዦር ሹም ናቸው?", "የኢትዮጵያ መከላከያ ሠራዊት ጠቅላይ ኤታማዦር ሹም ማናቸው?", "ጄነራል ብርሃኑ ጁላ በኢትዮጵያ መከላከያ ሠራዊት ውስጥ ኃላፊነታቸው ምንድን ነው?", "ዎሌ ሾይንካ የሥነ ጽሑፍ ኖቤል ተሸላሚ የነበሩት መቼ ነበር?", "ደራሲ አብዱልራዛቅ በ2021 የሥነ ጽሑፍ ኖቤል የሚሸልማቸው ድርጅት ምን ይባላል?", "የ2021 የሥነ ጽሑፍ ኖቤል ተሸላሚ ማናቸው?", "ደራሲ አብዱልራዛቅ የኖቤል የሥነ ጽሑፍ ተሸላሚ የሆኑት በመቼ ዓመተ ምሕረት ነው?", "ደራሲ አብዱልራዛቅ በ2021 የሥነ ጽሑፍ ኖቤል ተሸላሚነታቸው የታወቀው መቼ ነበር?", "ደራሲ አብዱልራዛቅ በ2021 የሥነ ጽሑፍ ኖቤል ሽልማት በማሸነፋቸው ምን ያህል ገንዘብ ያገኛሉ?", "ደራሲ አብዱልራዛቅ የኖቤል የሥነ ጽሑፍ ተሸላሚ ከመሆናቸው ከ35 ዓመት በፊት ይህንን ሽልማት ያገኙት አፍሪካዊ ማን ነበሩ?", "ደራሲ አብዱልራዛቅ የኖቤል የሥነ ጽሑፍ ተሸላሚ ከመሆናቸው ከ35 ዓመት በፊት ይህንን ሽልማት ያገኙት አፍሪካዊ ማን ነበሩ?", "አብዱልራዛቅ ጉራህ በአፍሪካ የኖቤል የሥነ ጽሑፍ ሽልማት ያገኙት ከማን ቀጥለው ነው?", "አብዱልራዛቅ ጉራህ በአፍሪካ በኖቤል የሥነ ጽሑፍ ተሸላሚ ሲሆኑ ስንተኛው ሰው ናቸው?", "በስዊድኑ አካዴሚ የ2021 የኖቤል የሥነ ጽሑፍ አሸናፊ የሆኑት ጸሐፊ ዜግነታቸው ምንድን ነው?", "ደራሲ አብዱልራዛቅ ጉራህ የ2021 ኖቤል ተሸላሚ የሆኑት በምን ዘርፍ ነው?", "በሥነ ጽሑፍ ዘርፍ በ1986 አፍሪካዊ የኖቤል ተሸላሚ ማን ነበሩ?", "ደራሲ አብዱልራዛቅ ጉራህ የስንት ዓመት ሰው ናቸው?", "ደራሲ አብዱልራዛቅ ጉራህ ለአንባብያን ስንት መጻሕፍት   አበርክተዋል?", "ደራሲ አብዱልራዛቅ ጉራህ ከአፍሪካ ስንተኛ የኖቤል ሽልማት ያገኙ ግለሰብ ናቸው?", "ደራሲ አብዱልራዛቅ ጉራህ ስለሚያገኙት የሽልማት ገንዘብ መጠን የገለጸው የመገናኛ ተቋም ማነው?", "ዎሌ ሾይንካ የምን ሀገር ዜጋ ናቸው?", "ዎሌ ሾይንካ በ1986 የኖቤል ተሸላሚ ሲሆኑ ስንት ዓመታቸው ነበር?", "ደራሲ አብዱልራዛቅ ጉራህ መቼ ተወለዱ?", "የመጀመሪያው ያለ አሽከርካሪ የሚሰራ የእቃ ማመላለሽ ተሽከርካሪ ሙከራ እንዲያገኝ በየት ሀገር ፍቃድ አገኘ?", "የመጀመሪያው ያለ አሽከርካሪ የሚሰራ የእቃ ማመላለሽ ተሽከርካሪ በማን ኩባንያ ተሰራ?", "የመጀመሪያው ያለ አሽከርካሪ የሚሰራ የእቃ ማመላለሽ ተሽከርካሪ በአሜሪካ ሀገር በየትኛው ግዛት ላይ ሙከራውን እንዲያደረግ ነው ፍቃድ የተሰጠው?", "የመጀመሪያው ያለ አሽከርካሪ የሚሰራ የእቃ ማመላለሽ ተሽከርካሪ ፍቃድ የተሰጠው የተሽከርካሪው የፍጥነት መጠን በሰዓት ከስንት እንዳይዘል ነው?", "የመንገድ ላይ ምልክት ማድረጊያው ሮቦት ለመጀመሪያ ጊዜ በየት አገር ተሰራ?", "የመንገድ ላይ ምልክት ማድረጊያው ሮቦት የሙከራ ስራውን ባደረገበት ወቅት በሰዓት ምን ያህል ኪሎ ሜትሮችን ሰራ?", "የመንገድ ላይ ምልክት ማድረጊያው ሮቦት የሚያስገኛቸው ጥቅሞች ምን ምን ናቸው?", "እየተዛመተ የመጣውን ኮሮና ቫይረስ አስመልክቶ የሚወጡ የሐሰት ፈውሶችን እና የተሳሳቱ መረጃዎችን ከገጾቻቸው ላይ እንደሚያጠፉ ያሳወቁት ድርጅቶች ማን ማን ናቸው?", "ጎግል ስለኮሮና ቫይረስ መረጃዎችን ለማቅረብ ወደ ስራ ያስገባው ማንቂያ ማን ይባላል?", "ስለኮሮና ቫይረስ መረጃዎችን ለማቅረብ የኤስ ኦ ኤስ ማንቂያን ወደ ስራ ያስገባው ድርጅት ማን ይባላል?", "ኤስ ኦ ኤስ ማንቂያ ምን ዓይነት ችግሮች በሚፈጠሩበት ወቅት ስራ ላይ የሚውል ማንቂያ ነው?", "ጉግል ለቻይና ቀይ መስቀል ምን ያህል ዶላር ድጋፍ አደረገ?", "ጉግል ከኮሮና ቫይረስ ለመከላከል በተደረገ ዘመቻ ምን ያህል ዶላር አሰባሰበ?", "ፌስቡክ የሰዎችን የፊት ገጽታ መለያዎች መሣሪያን መጠቀም የጀመረው መቼ ነው?", "ፌስቡክ የሰዎችን የፊት ገጽታ መለያ መሣሪያ በመጠቀም ምን ዓይነት ጥቅም አግኝቷል?", "ፌስቡክ የሰዎችን ምስል ለማጣራት እና ለመለየት የሚጠቀምበት መሳሪያ ምክንያት በነበረው የህግ ክርክር ስንት እንዲከፍል ተወሰነበት?", "ባለ ሁለት ሞተር እና 76 ሜትር ርዝመት እንዳለው የተገለጸው የቦይንግ አውሮፕላን ምን ተብሎ ይጠራል?", "ቦይንግ 777- 9 ኤክስ የተሰኘው አውሮፕላን ምን ያህል ርዝመት እና ስንት ሞተር አለው?", "ቦይንግ 777- 9 ኤክስ የተሰኘው አውሮፕላን በምን ያህል ዋጋ እየሸጠ ይገኛል?", "ቦይንግ 737 ማክስ አውሮፕላኖቹ ላይ በተፈጠረ የቴክኒክ ችግር ምክንያት የየት ሀገር ንብረት የሆኑ አውሮፕላን ናቸው የተከሰከሱት?", "ንብረትነታቸው የኢትዮጵያ እና የኢንዶኔዢያ የሆኑ ሁለት አውሮፕላኖች ተከስክሰው የምን ያህል ሰዎች ሕይወት ተቀጠፈ?", "በኢትዮጵያ ካሉ የኢንተርኔት አገልግሎቶች ተጠቃሚዎች ውስጥ ስልክ ቁጥርን እንደ ይለፍ-ቃል የሚጠቀሙት ምን ያህል ፐርሰንት ናቸው?", "በ2011 ዓ.ም ከተፈጸመ የሳይበር ጥቃት ውስጥ ምን ያህል ግለሰቦችን ተጎጂ አድርጓል?", "የኢንፎርሜሽን መረብና ደህንነት ኤጀንሲ በ2011 ባደረገው ጥናት በመቶኛ ምን ያህል ሰዎች በማኅበራዊ ሚዲያ የሚለቀቁ መረጃዎች እውነት እንደሆኑ ያመናሉ ብሏል?", "በአይቮሪኮስት ከፍተኛ የመማሪያ ክፍል እጥረት እንዳለ ይነገራል ይህን እጥረት ለመቀነስ መንግስት ትምህርት ቤቶችን በምን እየገነባ ይገኛል?", "በአይቬሪኮስት ከፍተኛ የመማሪያ ክፍል እጥረት በመኖሩ ምክንያት ምን ያህል ህጻናት ወደ ትምህርት ቤት አይሄዱም?", "በአይቮሪኮስት የፕላስቲክ ውጤቶችን በመጠቀም የመማሪያ ክፍሎችን መስራት የጀመረው የምን ሀገር ኩባንያ ነው?", "የኮሎምቢያ ኩባንያ ከተባበሩት መንግስታት የህጻናት መርጃ ድርጅት (ዩኒሴፍ) ጋር በመተባበር የተጣሉ የፕላስቲክ ውጤቶችን በመጠቀም የመማሪያ ክፍሎችን እየሰራ ያለው የት ሀገር ነው?", "ዩኒሴፍ በአይቬሪኮስት ከኮሎምቢያው ኩባንያ ጋርበተጣሉ የፕላስቲክ ውጤቶች የመማሪያ ክፍሎችን በመገንባቱ ለምን ያህል ህጻናት እድል ይፈጥራል?", "አይቮሪኮሰስት ከምታስወግደው የፕላስቲክ ውጤቶች በመቶኛ ምን ያህሉን የመማሪያ ክፍሎች ለመስራት ተጠቀችበት?", "በአይቮሪኮሰስት ከ2018 በኋላ ባሉት ተከታታይ ሁለት ዓመታት በተጣሉ የፕላስቲክ ውጤቶች ምን ያህል ክፍሎች ለመስራት ታቅዷል?", "በአይቮሪኮሰስት በ2018 በተጣሉ የፕላስቲክ ውጤቶች ምን ያህል ክፍሎች ተሰሩ?", "አሜሪካ ለቻይና ድርጅቶች እንዳይሸጡ የከለከለቻቸው ምርቶች ምን ምን ናቸው?", "የአሜሪካ ግምጃ ቤት ባለፈው አመት ሰኔ ወር ላይ በጥቁር መዝገብ የያዘው የቻይና ኩባንያ ስሙ ማን ነው?", "አሜሪካ የቻይና የቴክኖሎጅ ኩባንያዎች ላይ እገዳ የጣለችው በምን ምክንያት ነው?", "በአሜሪካ የተገደሉትን የኢራኑ ጄኔራል ቃሲም ሱለይማኒን ሃሳብ የሚደግፉ መረጃዎችን በማንሳት ላይ ያሉት ድርጅቶች ማን እና ማን ናቸው?", "ኢንስታግራም እና ፌስቡክ የማህበራዊ ትስስር ድረ ገፅ በኢራን ጀነራል አሟሟት ጋር በተየያዘ መረጃዎቹን ከገጸቸው የሚያስወገዱት በምን ምክንያት ነው?", "የኢራኑ ጄኔራል ቃሲም ሱለይማኒን የተገደሉት በማን ነው?", "የኢራኑ ጄኔራል ቃሲም ሱለይማኒን የተገደሉት የት ሀገር እያሉ ነው?", "የኢራኑ ጄኔራል ቃሲም ሱለይማኒን በኢራቅ የት ቦታ ተገደሉ?", "የኢራኑ ጄኔራል ቃሲም ሱለይማኒን በማን ትእዛዝ ሰጪነት ተገደሉ?", "በፕሬዝደንት ትራምፕ ትእዛዝ የተገደሉት ጄኔራል ቃሲም ሱለይማኒን የየት ሀገር ጄነራል ነበሩ?\t", "በፕሬዝደንት ትራምፕ ትእዛዝ በኢራቅ አውሮፕላን ማረፊያ ውስጥ የተገደሉት የኢራኑ ጄኔራል ማን ነበሩ?", "የሶስተኛ ወገን አጠቃቀምን የሚገድብ አዲስ የግላዊነት ማስጠበቂያ ፖሊሲ ያወጣው የቴክኖሎጂ ድርጅት ማን ነው?", "ጎግል ያስተዋወቀው የሶስተኛ ወገን አጠቃቀምን የሚገድብ አዲስ የግላዊነት ማስጠበቂያ ፖሊሲ ምን ይባላል?", "የኢትዮጵያ ኢኖቬሽን እና ቴክኖሎጂ ሚኒስቴር በኤሮስፔስና ሰው ሰራሽ ቴክኖሎጅ ዘርፎች ምን ከሚባል ኢንስቲቲዩት ጋር አብሮ ለመስራት ስምምነት አደረገ?", "የኢኖቬሽን እና ቴክኖሎጂ ሚኒስቴር በኤሮስፔስና ሰው ሰራሽ ቴክኖሎጅ ዘርፎች ዙሪያ ለሚደረግ ስራ በኢትዮጵያ በኩል ስምምነቱን የፈረሙት ማን ይባላሉ?", "ፋሪስ የቴከረኖሎጂ ኢንስቲቲዩት መስራች ማን ነው?", "ተጠቃሚወች የሚለጥፏቸን መረጃዎች ተከትሎ የሚሰጡ ምላሾችን መቆጣጠር የሚያስችል አሰራር ሊሞክር መሆኑን ያሳወቀው የማኅበራዊ ድኅረ ገጽ ስም ማን ነው?", "ትዊተር ተጠቃሚወች የሚለጥፏቸን መረጃወች ተከትሎ የሚሰጡ ምላሾችን መቆጣጠር የሚያስችል አሰራር መተግበሩ ለደንበኞቹ ምን ጥቅም ያስገኛል?", "በአዲስ አበባ መስከረም 23/2012 ዓ.ም የኢትዮጵያ ብሔራዊ አክሬዲቴሽን ጽ/ቤት ምን አይነት እውቅና ነው ያገኘው?", "የኢትዮጵያ ብሔራዊ አክሬዲቴሽን ጽ/ቤት አይኤስኦ/አይኢሲ 17020/2012 ዓ.ም እውቅናን ያገኘው መቼ ነው?", "የኢትዮ ቴሌኮም ዋና ሥራ አስፈፃሚ ማን ናት?", "ኢትዮ ቴሌኮም ለገበታ ለሀገር ፕሮጀክቶች ስንት ብር ድጋፍ አደረገ?", "ኢትዮ ቴሌኮም የ500 ሚሊዮን ብር ድጋፍ ለምን አደረገ?", "ሬድፎክስ የመረጃ ቋት ማዕከል የተቋቋመው በማን ነው?", "ሬድፎክስን ያቋቋሙ ኢትዮጵያውያን ዳያስፖራዎች በምን ዙሪያ ልምድ ያላቸው ናቸው?", "የሬድፎክስ የመረጃ ቋት ማዕከል በኢትዮጵያ ብዙ ዘርፎች ጠቀሜታ እንደሚኖረው የገለፁት ማናቸው?", "በኢትዮጵያ የገንዘብ ሚኒስትር ዴኤታው ማን ይባላሉ ?", "በኢትዮጰጵያ የዲጂታል ኢኮኖሚውን ያጠናክራል ተብሎ የተቋቋመው የመረጃ ቁዋት ማዕከል ምን ይባላል?", "በኢትዮጰጵያ የዲጂታል ኢኮኖሚውን እንዲያጠናክር የተመሰረተው ሬድፎክስ ምን ዓይነት ማዕከል ነው?", "በኦስትሪያ በየትኛም የመንግስት መስሪያ ቤት ላይ ነው ከባድ የሳይበር ጥቃት የተፈጸመው?", "በየትኛዋ የአውሮፓ ሀገር የውጭ ጉዳይ ሚኒስቴር መስሪያ ቤት ላይ ነው ከባድ የሳይበር ጥቃት የተፈጸመው?", "አል የተባለው ሰው ሰራሽ መሳሪያ ምንን ለመመርመር ነው ስራ ላይ የዋለው?", "አል የተባለው የጡት ካንሰር መመርመሪያ መሳሪያ በስንት ሰዎች ላይ ሙከራ ተደርጎ ነው ውጤታማነቱ የተረጋገጠው?", "አል የተባለው የጡት ካንሰር መመርመሪያ ከምርመራ ውጤት አንጻር ያለውን ስህተት በምን ያህል ቀነሰ?", "አል የተባለው የጡት ካንሰር መመርመሪያ ከባለሙያ አንጻር ያለውን ስህተት በምን ያህል ቀነሰ?", "የቻይናው ግዙፉ የቴሌኮም ኩባንያ ሁዋዌ በፈረንጆቹ 2019 ምን ያህል ስልኮችን ለገበያ አቀረበ?", "የቻይናው ግዙፉ የቴሌኮም ኩባንያ ሁዋዌ በፈረንጆቹ 2019 240 ሚሊየን ስልኮችን ለገበያ በማቅረቡ ምን ያሀል ገቢ ለማግኘት ቻለ?", "የሁዋዌ የ2019 ዓ.ም. ዓመታዊ ሽያጭ ከ2018 ዓ.ም. አንጻር በመቶኛ ምን ያህል ይልቃል?", "ማይክሮሶፍት ለዊንዶውስ-10 የሚያቀርብውን የደህንነት ጥገና መቼ አቆማለው አለ?", "ማይክሮሶፍት ለየትኛው ዊንዶ የሚያቀርብውን የደህንነት ጥገና በ2025 እንደሚያቆም ያሳወቀው?", "በዓለም አቀፍ ደረጃ በአዲሱ ትውልድ ከፍተኛ ተወዳጅነትን ያተረፈው ሞባይል አምራች ቴክኖ ኩባንያ አዲሱ ምረቱን መቼ አስተዋወቀ?", "በዘጋቢ ፊልም ታጅቦ የቀረበው አዲስ የቴክኖ ሞባይል ምን ተብሎ ይጠራል?", "ቴክኖ ካሞን 17 የተባለው አዲሱ የቴክኖ ኩባንያ ስልክ መቼ ለገበያ ቀረበ?", "ቴክኖ ኩባንያ ግንቦት 4 ቀን 2013 ዓ.ም ያስተዋወቀው አዲሱ ምረቱ ምን ይባላል?", "ኮሎሳል በሚል የሚታወቀው የሳይበር ጥቃት ምን ያህል ብር ለመረጃው ማስለቀቂያ ጠየቀ?", "በስዊድን እና በኒውዘርላንድ ኮሎሳል የተባለ የሳይበር ጥቃት ፈጻሚ ቡድን ስንት ሱቆችን አጠቃ?", "በስዊድን እና በኒውዘርላንድ ኮሎሳል የተባለ የሳይበር ጥቃት ፈጻሚ ቡድን ስንት ትምህርት ቤቶችን አጠቃ?", "ኮሎሳል በሚል የሚታወቀው ቡድን የመጀመሪያው የሳይበር ጥቃት ሰለባ የሆነው ተቋም ማን ይባላል?", "ኮሎሳል በሚል የሚታወቀው ቡድን በመጀመሪያው የሳይበር ጥቃት ያደረሰበት ካስያ የተባለው ተቋም ስንት ደንበኞቹ ተጠቁ?", "የብሪታንያ ጠቅላይ ሚንስትር ማነው?", "ሁዋዌ በአሜሪካ አገልግሎቱን ያቋረጠው ቻይና ከማን ጋር በገባችው የንግድ ጦርነት ምክንያት ነው?", "ሁዋዌ በአሜሪካ አገልግሎቱን ያቋረጠው ቻይናና አሜሪካ ወደ ምን በመሄዳቸው ምክንያት ነው?", "ብሪታንያ ከሁዋዌ ጋር ለመስራት ፈቃደኛ በመሆኗ ከማን ጋር ያላት ግንኙነት ሊሻክር ይችላል?", "ቦሪስ ጆንሰን የብሪታንያ ምንድን ናቸው?", "በሥነ ጽሑፍ ዘርፍ ምን ያህል አፍሪካውያን የኖቤል ሽልማት አግኝተዋል?", "አብዱልራዛቅ ፓራዳይዝ የተሰኘውን ልብ ወለድ መጻሐፋቸውን ያሳተሙት እ.ኤ.አ. መቼ ነበር?", "ደራሲ አብዱልራዛቅ በ20ኛው ክፍለ ዘመን የልጅ አስተዳደግ ምን እንደሚመስል ያሳዩበት መጽሐፋቸው ርእሱ ምን ይባላል?", "የፓራዳይዝ መጽሐፍ ጭብጡ ምንድን ነው?", "የፓራዳይዝ መጽሐፍ ደራሲ ማን ነው?", "ደራሲ አብዱልራዛቅ የት ተወለዱ?", "ደራሲ አብዱልራዛቅ መቼ ተወለዱ?", "ደራሲ አብዱልራዛቅ መቼ ተሰደዱ?", "ደራሲ አብዱልራዛቅ ወዴት ተሰደዱ?", "አብዱልራዛቅ የየት ዩኒቨርሲቲ ፕሮፌሰር ነበሩ?", "አብዱልራዛቅ ፕሮፌሰርነታቸው በምን ዘርፍ ነበር?", "ባለፈው ዓመት የኖቤል የሥነ ጽሑፍ ተሸላሚ ማናቸው?", "በሥነ ጽሑፍ ዘርፍ የኖቤል ሽልማት ያገኙት ናዲን ጎርዲመር የምን ሀገር ዜጋ ናቸው?", "በሥነ ጽሑፍ ዘርፍ የኖቤል ሽልማት ያገኙት ነጂብ ማኅፉዝ የምን ሀገር ዜጋ ናቸው?", "በሥነ ጽሑፍ ዘርፍ የኖቤል ሽልማት ካገኙ አፍሪካዊ ደራስያን መካከል የዚምባቡዌና የእንግሊዝ ዜግነት ያለው ማነው?", "በሥነ ጽሑፍ ዘርፍ የኖቤል ሽልማት ካገኙት ደራስያን መካከል ምን ያህሉ ደቡብ አፍሪካዊ ናቸው?", "ነጂብ ማኅፉዝ በሥነ ጽሑፍ ዘርፍ የኖቤል ሽልማት ያገኙት መቼ ነበር?", "ናዲን ጎርዲመር በሥነ ጽሑፍ ዘርፍ የኖቤል ሽልማት ያገኙት መቼ ነበር?", "በሥነ ጽሑፍ ዘርፍ የኖቤል ሽልማት ካገኙ አፍሪካዊ ደራስያን መካከል የሁለት ሀገር ዜግነት ያለው ማነው?", "በ2020 የኖቤል የሥነ ጽሑፍ ተሸላሚ ማን ነበሩ?", "በሥነ ጽሑፍ የኖቤል ሽልማት ያሸነፉት ሊዊስ ግሉክ ምናዊ ናቸው?", "ሊቢያ ኦይል በተለያዩ አፍሪካ ሀገራት ስንት ነዳጅ ማደያዎች አሉት?", "ሊቢያ ኦይል በስንት አፍሪካ ሀገራት የነዳጅ ማደያዎች ከፍቷል?", "ሊቢያ ኦይል ሆልዲንግ በሊቢያ ኢንቨስትመንት ባለሥልጣን በስንት ዓ.ም. ተመሠረተ?", "ሊቢያ ኦይል ሆልዲንግ ኩባንያ አፍሪካ ውስጥ ያለውን ቢዝነስ የገዛው ከእነማን ነው?", "በባህር ውኃ ብክለት ምክንያት የጂቡቲ መንግሥት የወረሳቸው የነዳጅ አቅራቢ ድርጅቶች እነማን ናቸው?", "የጂቡቲ መንግሥት የቶታል ንብረቶችን ለሽያጭ አቅርቦ ቶታልን የገዛው የምን ሀገር ኩባንያ ነው?", "የጂቡቲ መንግሥት የሊቢያ ኦይል ንብረቶችን ለሽያጭ አቅርቦ ሊቢያ ኦይል ጂቡቲን የገዛው የትኛው ኩባንያ ነው?", "ናሽናል ኦይል ኢትዮጵያ (ኖክ) ሊቢያ ኦይል ጂቡቲን በምን ያህል ዋጋ ገዛው? ", "የአዲስ አበባ ውሃና ፍሳሽ ባለስልጣን በምን ያህል ደንበኞች የሞባይል ስልኮች ላይ በተጫነ መተግበሪያ ዘመናዊ የቆጣሪ ንባብን ተግባራዊ እያደረገ ነው?", "የአዲስ አበባ ውሃና ፍሳሽ ባለስልጣን ዘመናዊ የቆጣሪ ንባብን መተግበሪያ ምን ዓይነት ጥቅም ለማኅበረሰቡ ይሠጣል?", "አዳነ ግርማ ለኢትዮጵያ እግር ኳስ ብሔራዊ ቡድን ለስንት ዓመት በተከታታይ ተጫወተ?", "29ኛውን የእግር ኳስ የአፍሪካ ዋንጫ ያዘጋጀችው ማናት?", "ለ29ኛውን የአፍሪካ ዋንጫ ማጣሪያ የኢትዮጵያ የእግር ኳስ ብሔራዊ ቡድን ከሱዳን አቻው ጋር ሲጫወት አዳነ ግርማ ጎል ያስቆጠረው እንዴት ነበር?", "ለ29ኛውን የአፍሪካ ዋንጫ ማጣሪያ የኢትዮጵያ የእግር ኳስ ብሔራዊ ቡድን ከሱዳን አቻው ጋር የት ባደረገው ጨዋታ ነው አዳነ ግርማ በግንባሩ ገጭቶ ጎል ያስቆጠረው?", "የኢትዮጵያ ብሔራዊ ቡድን ከሱዳን አቻው ጋር ሲጫወት አዳነ ግርማ በግንባሩ ገጭቶ ጎል ያስቆጠረው ስንተኛው የአፍሪካ ዋንጫ ማጣሪያ ላይ ነበር ?", "ኢትዮጵያ በ29ኛው የእግር ኳስ የአፍሪካ ዋንጫ የተሳተፈችው ከስንት ጌዜ በኋላ ነው?", "የኢትዮጵያ የእግር ኳስ ብሔራዊ ቡድን ከ39 ዓመታት በኋላ ስንተኛው የአፍሪካ ዋንጫ ላይ ተሳተፈ?", "ኢትዮጵያ በ29ኛው የእግር ኳስ የአፍሪካ ዋንጫ ከዛምቢያ ጋር ስትጨወት ግብ ያስቆጠረው ማነው?", "ኢትዮጵያ በ29ኛው የእግር ኳስ የአፍሪካ ዋንጫ ስትጫወት አዳነ ግርማ ማን ላይ ግብ አስቆጠረ?", "አዳነ ግርማ ኢትዮጵያ ስንተኛው የአፍሪካ ዋንጫ ላይ ከዛምቢያ ጋር ስትጫወት ግብ አስቆጠረ?", "ኢትዮጵያ ከ39 ዓመታት በኋላ ለ29ኛው የአፍሪካ እግር ኳስ ዋንጫ ስታልፍ የኢትዮጵያ ብሔራዊ ቡድን አሰልጣኝ ማን ነበር?", "የኢትዮጵያ እግር ኳስ ብሔራዊ ቡድን አሰልጣኝ ሰውነት ቢሻውን የተካው ማነው?", "ለ2017 የአፍሪካ ዋንጫ ማጣሪያ ወቅት የኢትዮጵያ ብሔራዊ ቡድን አሰልጣኝ ማን ነበር?", "ለ2017 የአፍሪካ ዋንጫ ማጣሪያ ወቅት የኢትዮጵያ ብሔራዊ ቡድን ተደልድሎ የነበረው በምድብ ስንት ነበር?", "ከጥቅምት 21 እስከ 25 ቀን 2019 ባሉ ቀናት የደንበኞችን የግል ተንቀሳቃሽ ምስል በስህተት ለሌሎች ያጋራው ድርጅት ማን ነው?", "የደንበኞችን የግል ተንቀሳቃሽ ምስል በስህተት ለሌሎች ያጋራው ጎግል ይህ ችግር ያጋጠመው መቼ ነበር?", "ዋትስ አፕ የተሰኘው የፅሁፍ እና የምስል መልዕክት መለዋወጫ መተግበሪያ በምን ምክንያት ነው አገልግሎቱን የሚያቋርጠው?", "የፅሁፍ እና የምስል መልዕክት መለዋወጫ መተግበሪያን ኦፕሬቲንግ ሲስተማቸውን ማዘመን ባልቻሉ የአንድሮይድ እና አይፎን ስልኮች ላይ ሊያቋርጥ የወሰነው የስልክ መተግበሪያ ማን ይባላል?", "ዋትስ አፕ መተግበሪያው አይፎን ኦፕሬቲንግ ሲስተም ከዓይነት ስንት በታች ባላቸው ስልኮች ላይ የሚሰጠውን አገልግሎት ለማቆም አቅዷል?", "ዋትስ አፕ መተግበሪያው አንድሮይድ ኦፕሬቲንግ ሲስተም ከዓይነት ስንት በታች ባላቸው ስልኮች ላይ የሚሰጠውን አገልግሎት ለማቆም አቅዷል?", "የኮሮና ቫይረስ ለመጀመሪያ ጊዜ የተገኘው በየትኛው የቻይና ከተማ ነው?", "ውሃን ከተማ ከተማ የቻይና ስንተኛ ትልቋ ከተማ ናት?", "የኮሮና ቫይረስ ለመጀመሪያ ጊዜ የተገኘው የት ሀገር ነው?", "እበ ለገሰ የስንት ዓመት ወጣት ነው?", "በሽሬ ከተማ ለሙከራ ሔሊኮፕተር ሰርቶ ያቀረበው ወጣት ማን ይባላል?", "በሽሬ ከተማ ለሙከራ ሔሊኮፕተር ሰርቶ ያቀረበው ወጣት ዕበ ለገሰ የስንተኛ ክፍል ተማሪ ነበረ?", "በሽሬ ከተማ የወርቅ መፈለጊያ መሳሪያ አሻሽሎ የሰራው ወጣት ማን ይባላል?", "ወጣት ዕበ ለገሠ የሠራው የወርቅ መፈለጊያ ማሽን በስንት ሜትር ጥልቀት ይፈልጋል? ", "ቀድሞ ይጠቀሙበት የነበረው የወርቅ መፈለጊያ ማሽን ምን ያህል ጥልቀት ይፈልጋል? ", "የሽሬ እንደስላሴ ከተማ ወጣቶችና ስፖርት ጉዳይ ጽ/ቤት ም/ኃላፊ ማን ይባላሉ?", "የወጣት እበ ለገሠ የፈጠራ ሥራዎች በማህበረሰቡ ተቀባይነት ያገኘው ለምንድነው?", "እበ ለገሰ ለተጨማሪ ለስንት ወጣቶች የሥራ እድል ፈጠረ?", "ወጣት እበ ለገሰ ከድንጋይ ጋር የተቀላለን ወርቅ ለመለየት ምን ዓይነት ነገር ፈጠረ?", "ወጣት እበ ለገሰ ስንት ሰዎች የሚያሳፍር ሔሊኮፕተር ሰርቶ አሳየ?", "ወ/ሮ ሠናይት የምን ሙያ ባለቤት ነች?", "በ2013 ዓ.ም በኢትዮጵያ በሀገር አቀፍ ደረጃ ደረጃ ሞዴል የጤና ኤክስቴንሽን ባለሙያ ተብላ የተመረጠችው ማናት?", "በሀገር አቀፍ ደረጃ ሞዴል የጤና ኤክስቴንሽን ባለሙያ የሆነችው ወ/ሮ ሠናይት ስንት የጤና ኤክስቴንሽን ባለሙያዎችን ወክላ ነው በአፍሪካ የጤና ኮንፈረንስ ላይ የተቀበለችው?", "ኢትዮጵያ በመሠረታዊ የጤና አገልግሎት ተደራሽነት ላይ ላስመዘገበችው ውጤት ምን ተጠቅማለች?", "ኢትዮጵያ በመሠረታዊ የጤና አገልግሎት ተደራሽነት ላይ ላስመዘገበችው ውጤት የት ሀገር ነው እውቅና የተሰጣት?", "ኢትዮጵያ ሩዋንዳ በተዘጋጀው የአፍሪካ የጤና ኮንፈረንስ ላይ እውቅና ያገኘችው በምን ምክንያት ነው?", "ሁዋዌ የየትኛው እስያዊ ሀገር ድረጅት ነው?", "የቻይናው ሁዋዌ 5ኛ ትውልድ (5G) ኔትወርክ በተወሰነ ገደብ በሀገሯ ስራውን እንዲቀጥል ውሳኔ ያሥተላለፈችው አውሮፓዊት ሀገር ማናት?", "ብሪታንያ ሁዋዌ ስንተኛ ትውልድ ኔትወርክ በሀገሯ እንዲሰራ ፈቀደች?", "በብሪታንያ ሁዋዌ በመቶኛ ምን ያህል 5ኛ ትውልድ ኔትወርክ እንዲዘረጋ ተፈቀደለት?", "በፈረንጆቹ ሚያዚያ ወር 2017 የቱርክን መንግስት የሚተች ፅሁፍ ለማንሳት ፈቃደኛ ያልሆነው ድኅረ ገጽ ምን ይባላል?", "ቱርክ በዊኪፒዲያ ላይ ላለፉት ሶስት ዓመታት በምን ምክንያት እገዳ ጥላ ነበር?", "ዊኪፒዲያ በቱርክ ለስንተ ቀናት ታገደ?", "የኢንተርኔት ክትትል ተቋም ማን ይባላል?", "ዊክፒዲያ እስከ አሁን ድረስ እገዳ ላይ የሚገኘው በየት ሀገር ነው?", "የኮምፒውተር ፕሮግራሞች ሥርዓት ለደህንነት ሥጋት እንዳይጋለጡ በምን ያህል ጊዜ ፀረ ቫይረስ ሶፍትዌሮችን መጠቀም አለብን?", "በኮምፒዩተራችን ውስጥ ያሉ መረጃዎች እንዳይጠፉብን በሌላ የፋይል ማጠራቀሚያ መያዝ ምን ይባላል?", "አሜሪካ የሁዋዌን አምስተኛ ትውልድ ኔትወርክን እንዳትጠቀም ያስጠነቀቀቻት አውሮፓዊ ሀገር ማን ናት?", "አሜሪካ የሁዋዌን አምስተኛ ትውልድ ኔትወርክን ብሪታንያ እንዳትጠቀም ያለችው የምን ስጋት ይኖረዋል ብላ ነው?", "ኢትዮ-ህንድ የኢኖቬሽንና ቴክኖሎጂ ገበያ ትስስር ኤክስፖ ላይ ምን ያህል የኢትዮጵያ ባለሙያዎችና ድርጅቶች ተሳተፉ?", "ኢትዮ-ህንድ የኢኖቬሽንና ቴክኖሎጂ ገበያ ትስስር ኤክስፖ ዋና ዓላማው ምንድን ነበር?", "በኢትዮ-ህንድ የኢኖቬሽንና ቴክኖሎጂ ገበያ ትስስር ፕሮግራም በሚቀጥሉት አምስት አመታት ምን ለመስራት አስቧል?", "በኢትዮ-ህንድ የኢኖቬሽንና ቴክኖሎጂ ገበያ ትስስር ኤክስፖ ላይ ምን ያህል የሕንድ ባለሙያዎችና ድርጅቶች ተሳተፉ?", "በኢትዮጵያ የሕንድ አምባሳደር ማናቸው?", "የትኛው የሆሊውዱ የፊልም ኩባንያ ነው የቦክስ ኦፊስን የደረጃ ሰንጠረዥ በሰው ሰራሽ ሊያስገምት የፈለገው?", "የሆሊውዱ የፊልም ኩባንያ ዋርነር ብሮስ በሰው ሰራሽ መሳሪያ (አርቴፊሻል ኢንተሌጀንስ) ለማስገመት ያሰበው ምንን ነው?", "ዋርነር ብሮስ በአርቴፊሻል ኢንተሌጀንስ መሰረት ያደረገ የቦክስ ኦፊስን ደረጃ ሰንጠረዥ መገመቻ መሳሪያ ለማሰራት የተዋዋለው ከማን ጋር ነው?", "እጅግ በጣም ከፍተኛ በሆነ የሙቀት ወቅት የአውሮፕላኖችን ሁኔታ መከታተል የሚያስችል ዘዴ ይፋ ያደረጉት የምን ሀገር ተመራማሪዎች ናቸው?", "የቻይና ተመራማሪዎች ከስንት እስከ ስንት ሙቀት መጠን የአውሮፕላኖችን ሁኔታ ለመከታተል የሚያስችል ዘዴ ይፋ አደረጉ?", "የቦይንግ ቃል አቀባይ ማን ናቸው?", "በየትኛው የቦይንግ አውሮፕላን ላይ ነው አዲስ የዲዛይን ክፍተት መገኘቱ የተገለፀ?", "በቦይንግ 737 ማክስ አውሮፕላን ላይ ምን አይነት የዲዛይን ክፍተት ነው የተገኘው?", "በቦይንግ 737 ማክስ አውሮፕላን ላይ በተገኘው የዲዛይን ክፍተት ምክንያት በአምስት ወር ውስጥ ምን ያህል አደጋ አጋጠመ?", "በቦይንግ 737 ማክስ አውሮፕላን ላይ በተገኘው የዲዛይን ክፍተት ምክንያት በአምስት ወር ውስጥ ባጋጠሙ ሁለት አደጋዎች ስንት ሰው ሞተ?", "በቦይንግ 737 ማክስ አውሮፕላን ላይ የዲዛይን ክፍተት መኖሩን ያረጋገጠው ማነው?", "ማይክሮሶፍት ምስጢራዊ መረጃዎችን ሲመዘብር የያዘው የሰሜን ኮሪያ ቡድን ማን ተብሎ ይጠራል?", "ታሊየም የተሰኘው የሰሜን ኮሪያ መረጃ መዝባሪዎች ቡድን ምን ዓይነት መረጃዎችን ነው የሚመዘብረው?", "ታሊየም የተባለው የሰሜን ኮሪያ ቡድን ምስጢራዊ መረጃዎችን ሲመዘብር የያዘው ማን ነው?", "ማይክሮሶፍት ታሊየም የመዘበራቸውን ስንት የድር መደቦችን ተቆጣጠረ?", "ታሊየም የተባለው የሰሜን ኮሪያ ቡድን ምስጢራዊ መረጃዎችን በመመዝበሩ በየት ተከሰሰ?", "ሳምሰንግ በተጠናቀቀው የፈረንጆቹ ዓመት ምን ያህል አምስተኛ ትውልድ ኢንተርኔት የሚጠቀሙ ዘመናዊ ስልኮችን ሸጠ?", "ሳምሰንግ በዓመቱ ሊሸጣቸው ገበያ ላይ ከዋሉት ስማርት ስልኮች ውስጥ በብዛት የተሸጠው ሞዴል ምን ይባላል?", "ሳምሰንግ በዓመቱ ወደ ገበያ ይዟቸው የወጡት ሞዴሎች ምን ምን ናቸው?", "የቻይና ዋና ከተማ ማን ናት?", "ቤጂንግ የቻይና ምንድን ናት?", "ቻይና በምን እና በምን ግዛቶቿ መካከል ያለውን የባቡር መስመር ለአገልግሎት ክፍት ልታደርግ ነው?", "ቻይና በዋና ከተማዋ ቤጂንግ እና በሀቤይ ግዛት ዘሃንግጃኩ መካከል የተዘረጋውን ፈጣን ባቡር ለአገልግሎት ክፍት የምታደርግበት ምክንያት ምንድን ነው?", "ቻይና በክረምቱ ኦሎምፒክ ምክንያት ለአገልግሎት ክፍት የምታደርገው ፈጣን ባቡር በሰዓት ምን ያህል ኪ.ሜ ይጓዛል?", "ቻይና በዋና ከተማዋ ቤጂንግ እና በሀቤይ ግዛት ዘሃንግጃኩ መካከል የተዘረጋውን ፈጣን ባቡር በከተሞቹ መካከል የነበረውን የ3 ሰዓት መንገድ ወደ ስንት ይቀንሰዋል?", "በቤጂንግ እና ዘሃንግጃኩ መካከል የተዘረጋውን ፈጣን ባቡር በከተሞቹ መካከል የነበረውን የስንት ሰዓት መንገድ ወደ 47 ደቂቃ ይቀንሰዋል?", "የ2022 የክረምት ኦሎምፒክ አዘገጋጅ ማናት? ", "ፈረንሳይ የዜጎች የግብር ስወራን ለማስቀረት ምን ዓይነት ዘዴን ልትጠቀም ነው?", "ፈረንሳይ የዜጎቿን የማህበራዊ ሚዲያ ገፅ በመፈተሽ ግብር ሰዋሪዎችን መለየቷ የዜጎችን የትኛውን መብት ይጋፋል?", "የዜጎቿን የማህበራዊ ሚዲያ ገፅ በመፈተሽ የግብር ስወራን ለማስቀረት ያሰበችው ሀገር ማን ናት?", "የሩሲያ ፕሬዝደንት ማን ነው?", "ሩስያ ለዓለም አቀፍ በይነ መረብ አማራጭ የሚሆን ኢንተርኔት በተሳካ ሁኔታ መሞከሯ ታውቋል ይህ ኢንተርኔት ስሙ ምን ይባላል?", "አር ዩ ኔት የተሰኘ ዓለም አቀፍ የበይነ መረብ አማራጭ በኢንተርኔት በተሳካ ሁኔታ የሞከረችው ሀገር ማናት?", "ሀገራት የራሳቸውን የበይነ መረብ መተግበሪያ መስራታቸው ችግሩ ምንድን ነው?", "ጎጉል እና አፕል ለስለላ ጥቅም ላይ ይውላል በማለት የጠረጠሩትን የተባበሩት አረብ ኤምሬቶችን መተግበሪያ ምን ይባላል?", "ጎጉል እና አፕል የተባበሩት አረብ ኤምሬቶችን መተግበሪያ ቶቶክን ማስወገዳቸው በምን ምክንያት ነው?", "ጎጉል እና አፕል ቶቶክ የተሰኘው መተግበሪያ ለተባበሩት አረብ ኤምሬቶች ሰላዮች ምን ምን ፋይሎችን አሳልፎ ይሰጣል ብሎ ነው ያስወገደው?", "ኢትዮ ቴሌኮም በእንጦጦ ፓርክ ያስመረቀው የስማርት ምሰሶ ቴክኖሎጂ ምን ጥቅም አለው?", "ኢትዮ ቴሌኮም በእንጦጦ ፓርክ ያስመረቀው ምንድን ነው ለደንበኞች ምን ዓይነት ጥቅም ያስገኛል?", "የደቡብ ክልል በአዲስ መልክ ሁለንተናዊ መረጃ አያያዝ አትላስና የመረጃ አስተዳደር ሥርዓት የተመረቀው መቼ ነው?", "በአዲስ መልክ የተዘጋጀው የመረጃ አያያዝ ምን ምን መረጃዎችን አካቶ ይዟል?", "የደቡብ ክልል ፋይናንስና ኢኮኖሚ ልማት ቢሮ ኃላፊ ማን ይባላሉ?", "አቶ አሸናፊ ጴጥሮስ የምን ዞን ዋና አስተዳዳሪ ናቸው?", "የመረጃ አያያዝ ምረቃ ሥነ-ሥርዓት ላይ የተገኙ አካላት እነማን ናቸው?", "የደቡብ ክልል አፈ ጉባኤ ማን ይባላሉ?", "ወይዘሮ ሔለን ደበበ በደቡብ ክልል ያላቸው ኃላፊነት ምንድን ነው?", "አዲሱ ካሞን 17 ሞባይል ምን ያህል ጂቢ ራም አለው?", "አዲሱ ካሞን 17 ሞባይል ምን ያህል ጂቢ ሮም አለው?", "አዲሱ ካሞን 17 ሞባይል ባለስንት መጠን የኃይል ማከማቻ አለው?", "በኢትዮጵያ ከመስከረም 26-30 ቀን 2012 ዓ.ም. በሚካሄደው የአስትሮኖሚካል ሲምፖዚየም ላይ ከስንት ሀገራት ተሳታፊዎች ይመጣሉ ተብሎ ይታመናል?", "በኢትዮጵያ ከመስከረም 26-30 ቀን 2012 ዓ.ም. በሚካሄደው የአስትሮኖሚካል ሲምፖዚየም ላይ ከስንት በላይ ዓለም አቀፍ ሳይንቲስቶች ተሳታፊ ይሆናሉ ተብሎ ይታሰባል?", "ኢትዮጵያ ከመስከረም 26-30 ቀን 2012 ዓ.ም. በምሥራቅ አፍሪካ ለመጀመሪያ ጊዜ ያዘጋጀችው ሲምፖዚየም ምን ነበር?", "ከኢትዮጵያ በፊት ሲምፖዚየሙን ያዘጋጁ ሁለት አፍሪካዊ ሀገራትን ማናቸው?", "ኢትዮጵያ የአስትሮኖሚካል ሲምፖዚየም ያዘጋጀች ስንተኛዋ አፍሪካዊ ሀገር ናት?", "በዓለም ላይ እስካሁን ምን ያክል የአስትሮኖሚካል ሲምፖዚየም ተከናውነዋል?", "የአስትኖሚካል ሲምፖዚየም መድረክ ምን አይነት ትስስር ይፈጥራል ተብሎ ይጠበቃል?", "በአዲስ አባባ ዩኒቨርስቲ በየትኛው ካምፓስ ለሚገኙ 2ኛ እና 3ኛ ዲግሪ ተማሪዎች ነው ስልጠና ለመስጠት የታሰበው?", "ስለአስተሮኖሚ የግንዛቤ ማስጨበጫ ፕሮግራም ስንት የሕዝብ ትምህርት ቤቶች ለማድረግ ታቅዷል?", "በአዲስ አባባ ዩኒቨርስቲ አራት ኪሎ ካምፓስ ለሚገኙ ስንተኛ ዲግሪ ተማሪዎች ነው ስልጠና ለመስጠት የታሰበው?", "በምስራቅ አፍሪካ የመጀመሪያ የሆነውን ዓለም አቀፋዊ የአስትሮኖሚካል ሲምፖዚየም ለማዘጋጀት እድል ያገኘችው ሀገር ማናት?", "ለአፍሪካ ህብረት የትምህርት፣ ሳይንስ፣ ቴክኖሎጂና ኢኖቬሽን ኮሚሽነርነት እጩ የቀረቡት ማን ናቸው?", "ፕ/ር ሂሩት በአዲስ አበባ ዩኒቨርሲቲ ውስጥ ምን ክፍል ውስጥ ነው ያገለግሉ ነበር?", " ፕሮፌሰር ሂሩት ወልደማርያም የምን ሚንስቲር  ሆነው ሰርተዋል?", "ፕሮፌሰር ሂሩት ወልደማርያም ለአፍሪካ ህብረት የትምህርት፣ ሳይንስ፣ ቴክኖሎጂና ኢኖቬሽን ኮሚሽነርነት የታጩት ማንን ወክለው ነው?", " ፕሮፌሰር ሂሩት ወልደማርያም በሚንስቲር ማዕረግ የማን አማካሪ ሆነው ሰርተዋል?", " ፕሮፌሰር ሂሩት ወልደማርያም የጠቅላይ ሚንሰትሩ የምን አማካሪ ሆነው ሰርተዋል?", "ፈጣን የኮሮና ቫይረስ መመርመሪያ የሰራች ሀገር ማናት?", "ሕንድ የሠራችውን የኮሮና ቫይረስ መመርመሪያ በስንት ሰዎች ላይ ሞከረች?", "ሕንድ የሠራችውን የኮሮና ቫይረስ መመርመሪያ ምን ይባላል?", "ፌሉዳ የተባለው የኮሮና ቫይረስ መመርመሪያ ዋጋው ስንት ነው?", "የሕንድ መንግስት የሳይንስ አማካሪ ማናቸው?", "ሕንድ ምን ያህል የኮሮና ቫይረስ መመርመሪያ ላቦራቶሪዎች አሉዋት?", " በራሪ ታክሲዎችን በጋራ ለመስራት የወሰኑት ኩባንያዎች እነማን ናቸው?", "ኡበርና ሃዩንዳይ ሊሰሩት ያሰቡት በራሪ ታክሲ እስከ ስንት ሰው መያዝ ይችላል?", "ኡበርና ሃዩንዳይ ሊሰሩት ያሰቡት በራሪ ታክሲ በሰዓት ምን ያህል ርቀት ይጓዛል?", "ኡበር በራሪ ታክሲዎችን መቼ ለደንበኞቹ ለማቅረብ አቅዷል?", "ኡበርና ሃዩንዳይ ሊሰሩት ያሰቡት በራሪ ታክሲ የት ለማስተዋወቅ አቅደዋል?", "የኢ ኦ ኤን ሪአሊቲ የሶፍትዌር አምራች ድርጅት ተቀማጭነቱ የት ነው?", "የኢ ኦ ኤን ሪአሊቲ የሶፍትዌር አምራች ድርጅት ማዕከሉን ለመክፈት የፈለገው በየት ነው?", "የኢ ኦ ኤን ሪአሊቲ የሶፍትዌር አምራች ድርጅት ማዕከሉን በኢትዮጵያ ለመክፈት ሀሰብ እንዳለው ውይይት ያደረገው ከማን ጋር ነው?", "የኢ ኦ ኤን ሪአሊቲ የሶፍትዌር አምራች ድርጅት መስራች ማን ነው?", "የኢትዮጵያ ሲቪል አቪዬሽን ለአየር መቆጣጠሪያ ታወሮች ግንባታ ምን ያህል ገንዘብ አወጣ?", "የኢትዮጵያ ሲቪል አቪዬሽን ለአየር መቆጣጠሪያ ስንት ታወሮች ገነባ?", "በአፋር ክልል ዲቼቶ አካባቢ የተመረቀው ተርሚናል ምንድን ነው?", "በአፋር ክልል ዲቼቶ አካባቢ የተገነባውን የጭነት መቆያ ተርሚናል ያስመረቀው ማነው?", "በአፋር ክልል ዲቼቶ አካባቢ የተገነባውን የጭነት ማቆያ ተርሚናል በስንት ሄክታር ላይ አረፈ?", "በአፋር ክልል ዲቼቶ አካባቢ የተገነባውን የጭነት መቆያ ተርሚናል በአንድ ጊዜ ስንት ከባድ ተሽከርካሪዎች ማስተናገድ ይችላል?", "የፌደራል ትራንስፖርት ባለስልጣን በአፋር ክልል የት አካባቢ የጭነት መኪናዎች መቆያ ተርሚናል አስገነባ?", "በአፋር ክልል ዲቼቶ አካባቢ የተገነባውን የጭነት መቆያ ተርሚናል ለመገንባት ምን ያህል ወጪ ወጣ?", "አፕል የምን ዘርፍ ኩባንያ ነው?", "የአፕል ኩባንያ በፈረንሳይ ከንግድ ውድድር ውጪ በመንቀሳቀሱ ስንት ብር ተቀጣ?", "አፕል ኩባንያ በፈረንሳይ በምን ምክንያት ነው የተቀጣው?", "በአፕል ኩባንያ ላይ ስንት አመት ምርመራ ከተደረገ በሁዋላ ነው የተቀጣው?", "በፈረንሳይ ስንት የአፕል አከፋፋዮች ላይ ማዕቀብ ተጣለ?", "አፕል ኩባንያ በፈረንሳይ ስንት አመት አገልግሎት ሰጠ?", "አፕል ኩባንያ በፈረንሳይ ሀገር ለምን ያህል ሰዎች የሥራ እድል ፈጥሯል?", "አፕል ኩባንያ ከንግድ ውድድር ውጪ ተንቀሳቅሷል ተብሎ የተቀጣው በማን ነው?", "በአፍሪካ አህጉር ውስጥ ስንት በመቶ የኢንተርኔት ተጠቃሚዎች አሉ?", "ዲጂታል ቴክኖሎጂን መሠረት ያደረጉ የሥራ እድል ፈጠራዎች አዳጋች ያደረጉ ነገሮች?", "በአፍሪካ አህጉር ውስጥ ከ2015-2035 እ.ኤ.አ ምን ያህል ስራ ፈላጊ ሰዎች ይኖራሉ?", "በአፍሪካ አህጉር ውስጥ 450 ሚሊየን ያህል ስራ ፈላጊ ሰዎች ከመቼ እስከ መቼ ይኖራሉ ተብሎ ተገምቷል?", "በአፍሪካ አህጉር ውስጥ ከ2015-2035 እ.ኤ.አ 450 ሚሊየን ያህል ስራ ፈላጊ ሰዎች ይኖራሉ ብሎ የገመተው ማነው?", "የጁፒተር እና ሳተርን ምህዋር በየስንት አመቱ ይገናኛሉ?", "በየ20 አመቱ በመግጠም አንድ የሚሆኑ ፕላኔቶች እነማ ናቸው?", "የቤተልሄም ኮከብ ተብሎ የሚጠራው ክስተት ከስንት አመታት በፊት ነበር?", "ጁፒተር እና ሳተርን ከስንት አመት በኋላ ነው የገጠሙት?", "የባህር ዳር ዩኒቨርሲቲ የሆነው በውሃ ላይ የሚነዳ የብስክሌት ጀልባ የፈጠረው ማነው?", "ጌታባለው መኩሪያ የፈጠራ ስራውን ከምን ከምን ሊሰራው ቻለ?", "ጌታባለው መኩሪያ የፈጠራ ሥራውን የት ፈጠረው?", "ፈጠራውን እንዴት አድርጎ ለማሳየት ሞከረ?", "በዉሃ ላይ የሚሄድ ብስክሌት ፈጠራ ባለቤት የሆነው ጌታባለው መኩሪያ በየት ዩኒቨርሲቲ ይማራል?", "በዉሃ ላይ የሚሄድ ብስክሌት ፈጠራ ባለቤት ጌታባለው መኩሪያ በባህር ዳር ዩኒቨርሲቲ ስንተኛ ዓመት ተማሪ ነው?", "በዉሃ ላይ የሚሄድ ብስክሌት ፈጠራ ባለቤት ጌታባለው መኩሪያ በባህር ዳር ዩኒቨርሲቲ የምን ተማሪ ነው?", "ቻይና በማርስ ላይ የምታካሂደው የመጀመሪያ ሳይንሳዊ ጥናት በምን ወር ትጀምራለች?", "ቻይና የምትልከው ሳተላይት ምን በሚባል ሮኬት ወደ ህዋ ይላካል?", "ሎንግማርች 5 ወይ 4 የተሰኘ ሮኬት እንደምትለቀቅ ማነው ያሳወቀው?", "ፌስቡክ የተጠቃሚዎች አድራሻ እንዳይገኝ ምን አይነት ዘዴዎችን ሲጠቀም ቆይቷል?", "ፌስቡክ የተጠቃሚዎችን ስልክቁጥር ለምን አይነት ጥቅሞች ሲያውለው ነበር?", "የፌስቡክ ኩባንያ ሀሰተኛ መረጃዎችን መቀነስ የሚያስችለውን ምን አይነት ፕሮግራም አስተዋወቀ?", "ሶስተኛ ወገን የመረጃ ትክክለኛነት ማረጋገጫ ፕሮግራም ለምን ይጠቅማል?", "ፌስቡክ ሶስተኛ ወገን የመረጃ ትክክለኛነት ማረጋገጫ ፕሮግራም በስንት አፍሪካ ሀገሮች ለመተግበር ወሰነ?", "ኢ-ኮሜርስ ምን ዓይነት የንግድ መንገድ ነው?", "የንግዱን ዘርፍ በማዘመን ሸማችን ከአምራች በቀጥታ የሚያገናኝ የኤሌክትሮኒክ ግብይት ምን ይባላል?", "የኢ-ኮሜርስ ንግድ ለማካሄድ ከመተግበሪያው በተጨማሪ ሌላ ምን ያስፈልጋል?", "የዊንዶውስ ሶፍትዌር አምራች ድርጅት ማነው?", "ዊንዶውስ 10 በዓለም ላይ ምን ያህል ሰዎች ይጠቀሙታል?", "በውሃ ላይ የሚሰራ ብስክሌት ያስተዋወቀው ማንታ 5 ኩባንያ የየት ሀገር ድርጅት ነው? ", "በውሃ ላይ የሚሰራ ኤክስ ኢ 1 የኤሌክትሪክ ብስክሌት በገበያ ላይ ያዋለው ድርጅት ማነው?", "ማንታ 5 ያስተዋወቀው በውሃ ላይ የምትሰራው የኤሌክትሪክ ብስክሌት ምን ትባላለች?", "በውሃ ላይ የሚሄድ የኤሌክትሪክ ብስክሌቱ የሚሰራው በምንድን ነው?", "በውሃ ላይ የሚሄደው የኤሌክትሪክ ብስክሌት በሰአት እስከ ስንት ኪሎ ሜትር ድረስ ይጓዛል?", "ኢክስኢ 1 ብስክሌትን ለእይታ ለማብቃት ስንት አመት ፈጀ?", "ኤክስኢ 1 በውሃ ላይ የምትሰራ የኤሌክትሪክ ብስክሌት ባለቤት ማንታ 5 ምርቱን ለመጀመሪያ ጊዜ ያስተዋወቀው የት ነበር?", "ኤክስ ኢ 1 በውሃ ላይ የሚሄድ የኤሌክትሪክ ብስክሌት የስንት ብር መጠን ተቆርጦለታል?", "ወይዘሮ ዘሚ የኑስ በምን ቫይረስ ተጠቁ?", "ወይዘሮ ዘሚ የኑስ በምን ምክንያት ሞቱ?", "የኒያ ፋውንዴሽን እና የጆይ ኦቲዝም መስራች ማናቸው?", "ወይዘሮ ዘሚ የኑስ ምን ያህል የአእምሮ እድገት ውስንነት ላለባቸው ልጆች ይንከባከቡ ነበር?", "ወይዘሮ ዘሚ የኑስ የምንና የምን ማዕከላት መስራች ናቸው?", "በጆይ ኦቲዝም ማዕከል ከ200 በላይ የአእምሮ እድገት ውስንነት ያለባቸው ልጆችን ሲንከባከቡ የነበሩት ግለሰብ ማን ይባላሉ?", "የሴቶችን የሥራ ፈጠራ ፕሮጀክት ለማገዝ የሚውል የ100 ሚሊዮን ብር ስምምነት የፈረመው ማነው?", "የዓለም ባንክ በኢትዮጵያ ለሴቶች የሥራ ፈጠራ ፕሮጀክት የሚውል ምን ያህል ገንዘብ ለመስጠት ወሰነ?", "ኤርፓድስ የተባለ ገመድ አልባ ድምፅ ማዳመጫ መጀመሪያ ያቀረበው ማነው?", "አፕል ኩባንያ ያቀረበው ኤርፓድስ የተባለ ገመድ አልባ ድምፅ ማዳመጫ ዋጋው ስንት ነው?", "አፕል ኩባንያ ያቀረበው የተባለ ገመድ አልባ ድምፅ ማዳመጫ ምን ይባላል?", "ኤርፓድስ የተባለው ገመድ አልባ ድምፅ ማዳመጫ ለተጠቃሚዎች ልዩ የሚያደርገው ነገር ምንድን ነው?", "ፕሮፌሰር ጥላሁን ከቻይና ተቋማት ጋር በመተባበር ሊያቋቁም ያሰቡት ምንድነው?", "ፕሮፌሰር ጥላሁን ይልማ መቼ ተወለዱ? ", "ፕሮፌሰር ጥላሁን ይልማ የመጀመሪያ ደረጃ ትምህርታቸውን የት ተከታተሉ?", "ፕሮፌሰር ጥላሁን ይልማ 2ኛ ደረጃ ትምህርታቸውን የት ተከታተሉ?", "ፕሮፌሰር ጥላሁን ይልማ በአረማያ እርሻ ኮሌጅ ለስንት ዓመት ተማሩ?", "ፕሮፌሰር ጥላሁን ይልማ በአሜሪካ ካሊፎርኒያ ዳቫስ ዩኒቨርሲቲ የምን ህክምና ትምህርት ነው ያጠኑት?", "ፕሮፌሰር ጥላሁን ይልማ የእንስሳት ህክምና ትምህርት የት ሀገር በሚገኝ ዩኒቨርሲቲ ተማሩ?", "ፕሮፌሰር ጥላሁን ይልማ የእንስሳት ህክምና ትምህርታቸውን በአሜሪካ በሚገኘው ማን ዩኒቨርሲቲ ተማሩ?", "ፕሮፌሰር ጥላሁን ይልማ ወደ ኢትዮጵያ ተመልሰው ያስተማሩት የት ነው?", "ፕሮፌሰር ጥላሁን ይልማ 3ኛ ዲግሪያቸውን የሰሩት በምን ላይ ነው?", "ፕሮፌሰር ጥላሁን ይልማ በዳይሬክተርነት እየመሩት ያለው ተቋም ምን ይባላል?", "የሃሩራማ አካባቢ በሽታዎች የሞሊኪዩራል ባዮሎጂ ላብራቶሪ ማዕከል ዳይሬክተር ማን ናቸው", "ፕሮፌሰር ጥላሁን ይልማ በተማሩበት ካሊፎርኒያ ዋሽንግተን ስቴት ዩኒቨርሲቲ በአውሮፓውያን አቆጣጠር ከመቼ እስከ መቼ ቆዩ?", "ፕሮፌሰር ጥላሁን ይልማ በተማሩበት ካሊፎርኒያ ዋሽንግተን ስቴት ዩኒቨርሲቲ ከ1980-2006 ከምን እስከ ምን ማዕረግ ደረሱ?", "ፕሮፌሰር ጥላሁን ይልማ በተማሩበት ከ1980-2006 ከረዳት እስከ ሙሉ ፕሮፌሰርነት የደረሱት የት ዩኒቨርሲቲ ነው?", "ፕሮፌሰር ጥላሁን ይልማ የዲስቲንጉሽድ ፕሮፌሰር ኤሜሪተስ ማዕረግ ያገኙት መቼ ነበር?", "ፕሮፌሰር ጥላሁን ይልማ በየት ሀገር ተወለዱ?", " የአዳማ ሳይንስና ቴክኖሎጂ ዩኒቨርስቲ በ86 ሚሊዮን የአሜሪካን ዶላር እያደራጀ ያለው ምንድነው?", " የአዳማ ሳይንስና ቴክኖሎጂ ዩኒቨርስቲ  በምን ያህል ዶላር የምርምርና ልህቀት ማእከላትን እያደራጀ ይገኛል?", "የአዳማ ሳይንስና ቴክኖሎጂ ዩኒቨርስቲ የአካዳሚክ ጉዳዮች ዘርፍ ምክትል ፕሬዚዳንት ማን ይባላሉ?", "በአዳማ ሳይንስና ቴክኖሎጂ ዩኒቨርስቲ ዶክተር ተሾመ አብዶ ያላቸው ኃላፊነት ምንድን ነው?", "በደቡብ ኮሪያና በኢትዮጵያ ባለሙያዎች በመገጣጠም ላይ ያሉት ሳተላይቶች ምን ይባላሉ?", "በደቡብ ኮሪያና በኢትዮጵያ ባለሙያዎች በመገጣጠም ላይ ያሉት ሳተላይቶች ስንት ናቸው?", "በአዳማ ሳይንስ ቴክኖሎጂ ዩኒቨረርሲቲ እየተገጣጠሙ ያሉት ሁለቱ ሊትል ስታር የተሰኙት ሳተላይቶች በየት ሀገር ባለሙያዎች ነው?", "የአዳማ ሳይንስ ቴክኖሎጂ ዩኒቨርሲቲ በስንት ትምህርት ፕሮግራሞች ተማሪዎችን እያስተማረ ነው?", "የአዳማ ሳይንስ ቴክኖሎጂ ዩኒቨርሲቲ ባሉት የትምህርቶች ፕሮግራሞች ምን ያህል ተማሪዎችን እያስተማረ ነው?", "በአዳማ ሳይንስ ቴክኖሎጂ የባህል መድኃኒቶችን በመቀመምና በምርምር በማዘጋጀት ወደ ዘመናዊ ኢንዱስትሪ ለማስገባት እየሰራ ያለው የትኛው ክፍል ነው?", "ኢትዮጵያ ለመጀመሪያ ጊዜ ዓለምአቀፍ ሥነፈለግ (አስትሮኖመር) ህብረት ሲምፖዚየም የምታዘጋጀው መቼ ነው?", "የሥነ ፈለክ አለምአቀፍ ህብረት ስንተኛ ዓመቱን እያከበረ ነው?", "የአስትራዜኔካ ክትባት በስንት ሰዎች ላይ ሙከራ ተደረገበት?", "በአስትራዜኔካ ላይ የተደረገው ጥናት ውጤት ስለክትባቱ ምንን አመላከተ?", " የአስትራዜኔካ የኮቪድ-19 ክትባት ምንም የጎንዮሽ ችግር አለመኖሩን በጥናት ያረጋጠው ማነው?", "የአስትራዜኔካ የኮቪድ-19 ክትባት በየት በየት አገሮች ተሞከረ?", "የኦክስፎርድ ዩኒቨርሲቲ የአስትራዜኔካ የኮቪድ-19 ክትባት አስተማማኝነት በተመለከተ በስንት ሀገሮች ጥናት አደረገ?", "የኦክስፎርድ ዩኒቨርሲቲ በአስትራዜኔካ የኮቪድ-19 ክትባት ዙሪያ ጥናት ያደረገው በየትኛው እድሜ ክልል በሚገኙ ሰዎች ላይ ነው?", "ፕሮፌሰር ጥላሁን ይልማ የምን ክትባት ፈለሰፉ?", "ፕሮፌሰር ጥላሁን ይልማ የፈለሰፉት ለእንስሳት የሚሆን ክትባት የምን በሽታ መድኃኒተ ነው?", "ፕሮፌሰር ጥላሁን ይልማ በዓለም አቀፍ ደረጃ ምን ያህል ምርምሮችን በታዋቂ መጽሔቶች ላይ አሳትመዋል?", "ፕሮፌሰር ጥላሁን ይልማ ሌላ ለምን በሽታ ክትባት ለማግኘት ጥረዋል?", "ከ100 ዓመታት በፊት በአፍሪካና በአውሮፓ ለከብቶች እልቂት ምክንያት የሆነው በሽታ ምን ይባላል?", "በእንግሊዝና በጣሊያን ወታደሮች ሴራ ወደ ኢትዮጵያ በገቡ ከብቶች በተዛመተው የደስታ በሽታ ከብቶች በማለቃቸው ለምን ያህል ጊዜ ረሀብ ነበር?", "በእንግሊዝና በጣሊያን ወታደሮች ሴራ ወደ ኢትዮጵያ በገቡ ከብቶች በተዛመተው የደስታ በሽታ ከብቶች በማለቃቸው ከመቼ እስከ መቼ ረሀብ ነበር?", "እ.ኤ.አ ከ1888-1892 ወደ ኢትዮጵያ በገቡ ከብቶች በተዛመተው የደስታ በሽታ በደረሰው እልቂት ከፍተኛ ረሀብ የተከሰተው በማን ሴራ ነበር?", "የፕሮፌሰር ጥላሁን ይልማ የክትባት ግኝት በዓለም ላይ ያሉ ከብቶችን በምን በሽታ እንዳይጠቁ ማድረግ ችሏል?", "በእንግሊዝና በጣሊያን ወታደሮች ተንኮል በገቡ ከብቶች ምክንያት ተዛምቶ በሀገራችን ብዙ ከብቶችን የፈጀው በሽታ ምን ነበር?", "የኢትዮጵያ ኤሌክትሪክ አገልግሎት ከሠራተኞቹ ጋር የሚገናኝበት ሬዲዮ ምን ይባላል?", "የሬዲዮ መገናኛው የመጀመሪያ ምዕራፍ ምን ያህል ገንዘብ አስወጥቷል?", "በኤሌክትሪክ አገልግሎት የአውቶሜሽንና ኢነርጂ ማኔጅመንት ምክትል ዋና ሥራ አስፈፃሚ ማን ይባላሉ?", "በምዕራፍ ሁለት ፕሮጀክቱን ማካሄድና ከአዲስ አበባ ውጪ በስንት ከተሞች ሊሠራ ታስቧል?", "ኢትዮጵያ የመጀመሪያው የመሬት ምልክታ ሳተላይቷን መቼ አመጠቀች?", "በ2012 ዓ.ም የመጠቀችው የኢትዮጵያ ሳተላይት ምን ስያሜ ተሰጣት?", "ኢትዮጵያ በ2013 ምን የምትባለዋን ሳተላይት አመጠቀች?", "ኢትዮጵያ በ2013 \"ET-Smart RR\" የተሰኘችውን ሳተላይት ማምጠቋን ማን አስታወቀ?", "ETRSS-1 የተሰኘችውን ሳተላይት ወደ ህዋ ያመጠቀችው ሀገር ማናት?", "አፈወርቅ ተክሌ መች ተወለዱ?", "በስሌድ የኪነጥበብ ማዕከል ከአፈወርቅ ተክሌ ጋር የገቡት ሌላኛው አፍሪቃዊ ማን ነበሩ?", "አፈወርቅ ተክሌ በስንት ዓመተ ምህረት ነበር ለከፍተኛ ት/ት ተመርጠው ወደ እንግሊዝ ሀገር የተላኩት?", "አፈወርቅ ተክሌ ፲፱፻፵ ዓ.ም ለከፍተኛ ት/ት ተመርጠው የተላኩት ወዴት ነው?", "አፈወርቅ ተክሌ ፲፱፻፵ ዓ.ም ለከፍተኛ ት/ት ተመርጠው ወደ እንግሊዝ ሀገር የተላኩት ምን ትምህርት እንዲያጠኑ ነበር?", "የተከበሩ አቶ አፈወርቅ ተክሌ የት ተወለዱ?", "የተከበሩ አቶ አፈወርቅ ተክሌ አባታቸው ማን ናቸው?", "አፈወርቅ ተክሌ ለከፍተኛ ትምህርት በስንት አመታቸው ተመረጡ?", "የተከበሩ አቶ አፈወርቅ ተክሌ እናታቸው ማን ይባላሉ?", "አፈወርቅ ተክሌ የምህንድስና ትምህርታቸውን ትተው ኪነጥበብ ለማጥናት ለመጀመሪያ ጊዜ የገቡበት ትምህርት ቤት ምን ይባላል?", "የኪነጥበብ ትምህርታቸው የበለጠ ለማዳበር የለንደን ዩኒቨርሲቲ ምን ማዕከል የመጀመሪያ አፍሪቃዊ ተማሪ ሆነው ገቡ?", "እቴጌ ምንትዋብ በየት ተወለዱ?", "እቴጌ ምንትዋብ የክርስትና ስማቸው ማን ይባላል?", "የእቴጌ ምንትዋብ የዙፋን ስም ማን ይባላል?", "በፋሲል ግቢ የመጨረሻውን ግንብ ያስገነባችው ማን ነበረች?", "እቴጌ ምንትዋብ እንዳለፈች ኢትዮጵያ ወደ ምን ዘመን ገባች?", "እቴጌ ምንትዋብ በንግስት ስልጣን እንደራሴነቷን መቼ አሳወጀች?", "እቴጌ ምንትዋብ ወንሟ ወልደ ልዑል፣ ልጇ እና የልጅ ልጇ ስንት አመት ኢትዮጵያን መሩ?", "ንጉስ ዐፄ በካፋ ምንትዋብን ወደ ጎንደር መቼ አምጥቶ አገባት?", "እቴጌ ምንትዋብ ዳግማዊ አፄ ኢያሱን መቼ ወለደች?", "ዳግማዊ አፄ ኢያሱ እስከ 1730 የት ተልኮ ነበር የኖረው?", "ከ1470 ዓ.ም - 399 ዓ.ዓ የነበረ ዋና የጥናት ግሪክ ፈላስፋ ማነው?", "ሶቅራጥስ በግሪክ በየትኛዋ ከተማ ይኖር ነበር?", "የሶቅራጥስ ጥናት ምን ላይ ያጠነጠነ ነበር?", "የሶቅራጥስ አስተሳሰቦች ከሞላ ጎደል ለቀሪው ትውልድ ያስተላለፈው ማን ይባላል?", "የምእራቡ ዓለም የፍልስፍና አባት በመባል የሚታወቀው ማነው?", "ወይዘሮ ጣይቱ ብጡል በስንት ዓ.ም እቴጌ ተብለው ተሰየሙ?", "የውጫሌ ውል በስንት ዓ.ም የተደረገ ስምምነት ነው?", "የውጫሌ ስምምነት ኢትዮጵያ ከማን ጋር ያደረገችው ስምምነት ነው?", "ልዑል አለማየሁ ቴዎድሮስ እንግሊዝ ሀገር እንደደረሰ ያገኛት ንግስት ማን ትባላለች?", "በስንት አመተ ምህረት ነው ስፒዲ ህንድ ሀገር በምትገኝ ከተማ አዛዥ ሆና የተሾመው?", "ስፒዲ ህንድ ሀገር በምትገኝ ከተማ አዛዥ ሆኖ በተሾመበት ወቅት ልዑለ አለማየሁ የስንት ዓመት ልጅ ነበር?", "ልዑል አለማየሁ ከመደበኛ ትምህርቱ ውጪ ምን ያዘወትር ነበር?", "ቄስ ብሌክ ልዑል አለማየሁን ምን ላይ ቢያተኩር ውጤታማ እንደሚሆን ገመቱ? ", "ልዑል አለማየሁ በስንት አመቱ ነበር ከዚህ አለም በሞት የተለየው?", "በልዑል አለማየሁ መቃብር ላይ ምን ተብሎ ነው ፅኁፍ የተፃፈለት?", "ልዑል አለማየሁ መቼ ከዚህ ዓለም በሞት ተለየ?", "ሶቅራጥስ ምን የሚባል መርዝ ጠጥቶ እንዲሞት ተፈረደበት?", "የሶቅራጥስ እናት ስም ማን ነው?", "የሶቅራጥስ አባት ማን ይባላል?", "የሶቅራጥስ አባት ሙያ ም ነበር?", "ሶቅራጥስ ከዛንቲፕ ስንት ልጆች ወለደ?", "ሶቅራጥስ በአቴንስ መንግስት ሲከሰስ እድሜው ስንት ነበር?", "ሶቅራጥስን በ70 ዓመቱ የከሰሰው ማን ነው?", "ሶቅራጥስ ማን የምትባል ሴት አገባ?", "የሶቅራጥስ እናት ፌርናት ምን ሙያ ነበራት?", "ሶቅራጥስ ደሀ የነበረበት ምክንያት ምንድን ነው?", "ሶቅራጥስ ጊዜውን የሚያሳልፈው ምን በማድረግ ነበር?", "ሶቅራጥስን ለክስ የዳረጉት ምክንያቶች ስንት ናቸው?", "ዳኞች ምን ዓይነት ቅጣት እንዲበይኑበት ሲጠየቅ የሶቅራጥስ መልስ ምን ነበር?", "ልዑል አለማየሁ አባቱ ማናቸው?", "ልዑል አለማየሁ በየት ከተማ ተወለደ?", "ልዑል አለማየሁ መቼ ተወለደ?", "የልዑል አለማየሁ ቴዎድሮስ እናት ማን ትባላለች?", "በስንት ዓ.ም ነው እንግሊዞች ልዑል አለማየሁን የወሰዱት?", "ልዑል አለማየሁን እንዲጠብቀው የተመደበው ሰው ማን ይባላል?", "ካፒቴን ስፒዲ ልዑል አለማየሁን እንዲጠብቅ የመደበው ማን ነው?", "ልዑል አለማየሁ እና ጠባቂው ተሳፍረውበት ወደ እንግሊዝ ያቀኑባት መርከብ ማን ትባላለች?", "ኢትዮጵያውያኑ የልዑል አለማየሁ ሞግዚቶች ስማቸው ማን ነው?", "የዳግማዊ ቴዎድሮስና የወይዘሮ ጥሩወርቅ ውቤ ልጅ ማን ይባላል?", "ልዑል አለማየሁ አባቱ አጼ ቴዎድሮስ ከሞቱ በኋላ ወዴት ተወሰደ?", "ልዑል አለማየሁ ከምን ያህል የመርርብ ጉዞ በኋላ እንግሊዝ ደረሰ?", "የልዑል አለማየሁ ኢትዮጵያውያን ሞግዚቶች አንግሊዝ ሳይደርሱ ከየት ተመለሱ?", "ልዑል አለማየሁ ሲወለድ በደስታ አጼ ቴዎድሮስ ስንት እስረኞች ፈቱ?", "ፕሮፌሰር አሸናፊ ከበደ መቼ ተወለዱ?", "ፕሮፌሰር አሸናፊ ከበደ የሙዚቃ ስሜትንና ፍቅር ያሳደሩባቸው ማናቸው?", "ፕሮፌሰር አሸናፊ ከበደ የት ተወለዱ?", "ፕሮፌሰር አሸናፊ ከበደ የመጀመሪያ ትምህርት በየት ትምህርት ቤት ተማሩ? ", "የፕሮፌሰር አሸናፊ ከበደ እናት ማን ናቸው?", "ፕሮፌሰር አሸናፊ ከበደ በየት የመምህራን ማሰልጠኛ ተመረቁ?", "አሸናፊ ከበደ ወደ ኢትዮጵያ ተመልሰው የመሰረቱት ትምህርት ቤት ማነው?", "አሸናፊ ከበደ ከፍተኛ ትምህርታቸውን የጨረሱት የት ነው?", "የፕሮፌሰር አሸናፊ ከበደ አባት ማን ይባላሉ?", "የፕሮፌሰር አሸናፊ ከበደ አያት ማን ይባላሉ?", "የፕሮፌሰር አሸናፊ ከበደ እናት የሞቱት ፕሮፌሰር ስንት ዓመት እያሉ ነበር?", "ፕሮፌሰር አሸናፊ ከበደ የመጀመሪያ ዲግሪያቸውን በስንት ዓመተ ምህረት ተመረቁ?", "የአሜሪካው ሮችስተር ዩኒቨርሲቲ በየት ክፍለ-ሀገር ይገኛል?", "ፕሮፌሰር አሸናፊ ከበደ የሙዚቃ ትምህርታቸውን የተማሩት በሮችስተር ዩኒቨርሲቲ ማን በሚባል ትምህርት ቤት ነው?", "የያሬድ ሙዚቃ ትምህርት ቤት የመጀመሪያው ዳይሬክተር ማን ነበሩ?", "ፕሮፌሰር አሸናፊ ከበደ የሙዚቃ የሁለተኛ ደረጃ ትምህርታቸውን የት ተማሩ?", "ወንዶች አብዛኛውን የኩላቲት ጠጠር ህመም የሚከሰትባቸው በየትኛው እድሜ ክልል ውስጥ ነው?", "አንድ ሰው የኩላሊት ህመምተኛ ነው የሚባለው የጠጠሩ መጠን ስንት ሲሆን ነው?", "እቴጌ ጣይቱ በስንት ዓ.ም. ተወለዱ?", "የእቴጌ ጣይቱ አባት ማን ይባላሉ?", "እቴጌ ጣይቱ በየት ተወለዱ?", "የእቴጌ ጣይቱ እናት ማን ይባላሉ?", "‹‹ብርሃን ዘ ኢትዮጵያ›› በሚል ቅፅል ስም የሚታወቁት ማን ናቸው?", "እቴጌ ጣይቱ በምን ሙያ ይታወቁ ነበር?", "እቴጌ ጣይቱ ከንጉስ ምኒልክ ጋር በስንት ዓ.ም ተጋቡ?", "ፐርል በክ  የመቃብር ስፍራ ስሙ ምን በመባል ይታወቃል ?", "ፐርል በክ የመጀመሪያ ጋብቻዋን የፈጸመችው መቼ ነው?", "ፐርል በክ የመጀመሪያ ድርሰቷ የት ኩባንያ ውስጥ ታተመላት?", "የፐርል በክ የትውልድ ስፍራ ምን ተብሎ ይጠራል ?", "ፐርል በክ የመጀመሪያ ድርሰቷ የት ኩባንያ ውስጥ ታተመላት?", "አሜሪካዊት ደራሲ ፐርል በክ በስነ-ጽሁፍ የኖቤል ተሸላሚ የሆነችው በስንት ዓመተ ምህረት ነው ?", "የፐርል በክ  የመጀመሪያው ወጥ ልብ-ወለድ ድርሰቷ ርዕሱ ምን ይባላል ?", " ፐርል በክ  ሁለተኛ ወጥ ልብ-ወለድ ድርስት ርዕስ ምን ይባላል ?", "ፐርል በክ የመጀመሪያ ድርሰቷ መቼ ታተመላት?", "የፐርል በክን ሁለተኛ ወጥ ልብ-ወለድ መጽሐፍ መቼ ታተመ?", "ፐርል በክ የተወለደችው መቼ ነው?", "በስነ-ጽሁፍ የኖቤል ሽልማትን በመቀበል የመጀመሪያዋ ሴት አሜሪካዊት ማን ትባላለች?", "ፐርል በክ የስነ-ጽሑፍ ስራዎቿን ማሳተም የጀመረችው ከስንት ዓመተ ምህረት ጀምሮ ነው?", "ፐርል በክ የሥነ-ጽሁፍ ስራዋ ጉልላት ለመሆን የበቃውን የመጽሐፉ ርዕስ ምን ይባላል ?", "የጆን ዴይ ኩባንያ አሳታሚ የነበረው በ1935 የፐርል በክ ሁለተኛ ባሏ ለመሆን የበቃው ማን ይባላል ?", "የፐርል በክ የፑሊትዘር ሽልማት እና የሃዌልስ ሜዳልያ ያገኘችው በስንት ዓመተ ምህረት ነበር ?", "ስሙር መሬት  በኤም.ጂ.ኤም አማካይነት በፊልም መልክ ተቀናብሮ ለተመልካች ለዕይታ የበቃው መቼ ነበር ?", "ፐርል በክ ከ70 በላይ ስራዎቿን ለንባብ አቅርባ ከዚህ ዓለም በሞት የተለየችው መቼ ነው ?", "አማ አታ አዪዶ ክሪስቲና የትውልድ ቦታዋ ት ሀገር ነው ?", "አማ አታ አዪዶ ክሪስቲና መቼ ተወለደች ?", " አማ አታ አዪዶ ክሪስቲና የመጀመሪያ ድርሰቷ በ1965 ያሳተመላት ድርጅት ማን ይባላል ?", "አማ አታ አዪዶ ክሪስቲና  ከልብ-ወለድ ደራሲነት በተጨማሪ እውቅናን ያተረፈችው በምንድነው ?", "አማ አታ አዪዶ ክሪስቲና ጽሁፎቿ በአብዛኛው የሚያተኩሩት ምን ላይ ነው ?", "አማ አታ አዪዶ ክሪስቲና የመጀመሪያ ዲግሪዋን በእንግሊዝኛ ቋንቋ ያገኘችው በስንት ዓመተ ምህረት ነው ?", "አማ አታ አዪዶ ክሪስቲና  የመጀመሪያ የድርሰት ስራዋ ርዕሱ ምን ይባላል ?", "አማ አታ አዪዶ ክሪስቲና የጋና የትምህርት ሚኒስትር ሆና የተሸመችው በስንት ዓመተ ምህረት ነው ?", "በ፲፭ኛው መቶ ዓ.ም. መንግሥታት እንደ ኃያላን መንግሥታት ከሚቆጠሩት ውስጥ የፖርቱጋል መንግሥት ከሌሎቹ የሚለየው በምን ነበር ?", "በመርከብ እየሄዱ ለመከላከል ጉልበት የሌለውንና በጠባዩ ሀብት ያለበትን አገር በመርምረው ብዙ ሀገራትን ሲይዙ በመርማሪነት የሚልኳቸው እነማንን ነበር ?", "ብራዚል በፖርቹጋል ቅኝ ሀገር የሆነችው መቼ ነው ?", "የፖርቱጋል መኮንን የሆነው በትልቅ መርከብ ሄዶ በራዚልን ቅኝ ሀገር እንድትሆን ያደረጋት ሰው ማን ይባላል ?", "የመጀመሪያ የንጉሥ እንደራሴ የተባለው ሰው ሙሉ ስሙ ማን ይባላል ?", "የመጀመሪያ የንጉሥ እንደራሴ የተባለው ፍራንቼስኮ ዳልሜዳ የያዛት ሀገር ማን ትባላለች ?", "በትልቁ ውቅያኖስ ውስጥ የሚገኙትን ደሴቶች እነማን ናቸው ?", "ግሪክን በሰሜን ወገን የምታዋስናት ሀገር ማን ትባላለች ?", "በኣብዛኛው በባሕር የታጠረ ነው ወደ ሜዴቴሪኒያን ባሕር የተዘረጋች ሀገር ማን ትባላለች ?", "ግሪክ በግዘቷ ውስጥ አያሌ ደሴቶቿ በየትኛው ወገን ይገኛሉ ?", "ግሪክ በደሴቶቿ ከሰራቻቸው ከተሞች መካከል የሆነው ከተማ ማን ይባላል ?", "የግሪክ ደሴቶች ከባሕር ወደ ውጪ እዲወረወሩ እና እንዳይታዩ ያደረጋቸው ኃይል ምንድንነው ?", "በግሪክ ደን ውስጥ የሚገኘው ጠንካራ ዛፍ ስሙ ማን ይባላል ?", "ማርክ ትዌይን ሳሙኤል ላንግሆርን ክሌመንስ መቼ ተወለደ ?", "ከትዳር አጋሩ ጋር ኑሮውን ለ17 ዓመታት ያሳለፈባት ግዛት ማን ትባላለች ?", "ማርክ ትዌይን ሳሙኤል ላንግሆርን ክሌመንስ የብእር ስሙ ማን ይባላል ?", "የአሜሪካ የእርስ-በርስ ጦርነት የተቀሰቀሰው በስንት ዓመተ ምህረት ነበር ?", "ማርክ ትዌይን ሳሙኤል ላንግሆርን ክሌመንስ የተወለደባት የአሜሪካ ግዛት ማን ትባላለች ?", "ማርክ ትዌይን  በአባቱ ሞት ምክንያት ትምህርቱን በማቋረጥ በማተሚያ ቤት በሰልጣኝነት የተቀጠረው መቼ ነበር ?", "ማርክ ትዌይን የማተሚያ ቤት ስራውን ትቶ  በ1857 የተሰማራው በምን ስራ ላይ ነው ?", "ማርክ ትዌይን ሳሙኤል ላንግሆርን ክሌመንስ የመጀመሪያ ስራውን ያሳተመው መቼ ነበር ?", "ማርክ ትዌይን ሳሙኤል ላንግሆርን ክሌመንስ የመጀመሪያ ስራው የሆነው የመጽሐፍ ርዕሱ ምን ይባላል ?", "ማርክ ትዌይን ሳሙኤል ላንግሆርን ክሌመንስ በ1870 ዓ.ም በትዳር የተጣመራት እንስት ማን ትባላለች ?", "ማርክ ትዌይን ሳሙኤል ላንግሆርን ክሌመንስ ብዙ አድናቆትን ያገኙ ድርሰቶችን ጽፏል ይበልጥ አድናቆትን ያገኘለት የመጽሀፍ ርዕስ ምን ይባላል ?", "ማርክ ትዌይን ሳሙኤል ላንግሆርን ክሌመንስ በርካታ ስራዎችን አበርክቶ በስንት ዓመተ ምህረት አረፈ ?", "ስብሐት ገብረ እግዚአብሔር መቼ ተወለደ ?", "ስብሐት ገብረ እግዚአብሔር የት ተወለደ ?", "ስብሐት ገብረ እግዚአብሔር በእንግሊዝኛ መምህርነት ለ2 ዓመት ያገለገለው በየትኛው ትምህርት ቤት ነው ?", "ከየተባበሩት መንግሥታት የትምህርት፤ ሳየንስ እና የባህል ድርጅት (ዩኔስኮ) ያገኘው የትምህርት እድል በየት ሀገር ነው ?", "ስብሐት ገብረ እግዚአብሔር ትምህርቱን በስዊድን ሚሲዮን፣ እንዲሁም በአዲስ አበባ ዩኒቨርስቲ ተከታትሎ የመጀመሪያ ዲግሪውን ያገኘው በምን ዘርፍ ነው ?", "ስብሐት ገብረ እግዚአብሔር ወደ ፈረንሳይኛ «Les Nuits d'Addis-Abeba» ተብሎ በፍራንሲስ ፋልሴቶ የተተረጎመው የልብ-ወለድ ድርስቱ ምን ይባላል ?", "ወደ ፈረንሳይኛ ቋንቋ ለመጀመሪያ ጊዜ የተተረጎመ ኢትዮጵያዊ ልብ-ወለድ መጽሐፍ ደራሲው ማን ይባላል ?", "ስብሐት ገብረ እግዚአብሔር በ1966 ዓ.ም. ወታደራዊው ደርግ ስልጣን ከያዘ በኋላ ኩራዝ አሳታሚ ድርጅት ውስጥ በምን ሙያ ያገለግል ነበር ?", "ከሌሎች ሰዎች ጋር በመሆን  ከእንግሊዝኛ ወደ አማርኛ በመመለስ ሥራ ላ የተሳተፈበት የመጽሐፍ ርዕስ ምን ይባላል ?", "ዓረብኛ ዓረብኛ ከየትኛው  ቋንቋዎች ቤተሠብ ውስጥ ይመደባል ?", " ለዓረብኛ ቋንቋ የቅርብ ዘመድ ተብለው ከሚጠቀሱት ቋንቋዎች መካከል መን ይገኛል ?", " ፪፻፶ (250) ሚሊዮን የሚያሕሉ ሰዎች እንደ እናት ቋንቋ የሚጠቀሙት ቋንቋ ማን ይባላል ?", "እስላሞች በብዛት የሚናገሩት የዓረብኛን ለምን እንደ ቅዱስ ቋንቋ ይቆጥሩታል ?", "ዓረብኛ ቋንቋ የሚጻፈው በምን ፊደል ነው ?", "አብዛኛው ዓረብኛ ቋንቋ ተናጋሪዎች የትኛውን እምነት ተከታዮች ናቸው ?", "እንግሊዝ፣ ስኮትላንድና ዌልስ አብረው በመሆን የፈጠሯት ደሴት ማን በመባል ትታወቃለች ?", "ዩናይትድ ኪንግደም ማለት ምን ማለት ነው ?", "እንግሊዝና ስኮትላንድ ተዋህደው «ዩናይትድ ኪንግደም» የፈጠሩት መቼ ነው ?", "ዓ.ም. (1707 እ.ኤ.አ.) አስቀድሞ፣ እንግሊዝና ስኮትላንድ ከተለያዩ ንጉሳት አስተዳደር ወጥተው በአንድ መተዳደር የጀመሩት በስንት ዓመተ ምህረት ነው ?", " ብርሃንና ሰላም ጋዜጣ የተመሰረተው መቼ ነው ?", "የእንግሊዝ ሠራዊት በአሜሪካ ቁጥጥር ስር የነበረችወን የክዌቤክ ከተማን መቼ አስመለሰ ?", " በሀይቲ ደሴት ላይ የነበረው የፈረንሳይ ሉዐላዊነት ያከተመው በስንት ዓመተ ምህተት ነው ?", "በባርነት የተገዙ ሰዎች ወደ አሜሪካ ኅብረት እንዳይገቡ የሚከለክል ሕግ የተደነገገ መቼ ነው ?", "ኢትዮጵያ ለመጀመሪያ ጊዜ ወደጃፓን የ፩ሚሊዮን ፱መቶ ሺ ኪሎ የመዳብ ሽያጭ የላከች መቼ ነው ?", "ኢትዮጵያ ወደ ጃፓን ለመጀመሪያ ጊዜ የላከችው መዳብ የተገኘው የት ነው ?", "የኢትዮጵያ የጊዜያዊ ወታደራዊ መንግሥት ባንኮችንና የኢንሹራንስ ኩባንያዎችን የብሔራዊ ንብረት አድርጎ የወረሰው መቼ ነው ?", " ጋናዊው ዲፕሎማት ኮፊ አናን የተባበሩት መንግሥታት ድርጅት ዋና ጸሐፊ ሆነው የተሸሙት መቼ ነው ?", "ጋናዊው ዲፕሎማት ኮፊ አናን የተባበሩት መንግሥታት ድርጅት ስንተኛው ዋና ጸሐፊ ሆነው ናቸው ?", "ከሕንድ የተነሱ ሃይማኖት ምን በመባል ይታወቃሉ ?", "አብርሃማዊ ሃይማኖቶች  ተብለው የሚታወቁት የትኞቹ ሃይማኖቶች ናቸው ?", "የአሜሪካ 32ኛ ፕሬዚዳንት የነበሩት ማን ይባላሉ ?", "ሮዘቨልት ወደ ፕሬዝዳንትነት ከመምጣታቸው ቀድሞ ገለግሉት የነበረው ምን ላይ ነው ?", "ፍራንክሊን ዴላኖ ሮዘቨልት የኒው ዮርክ አገረ ገዥ የሆኑት መቼ ነው ?", "ፍራንክሊን ዴላኖ ሮዘቨልት ሁቨርን አሸንፈው የአሜሪካ ፕሬዝዳንት የሆኑት መቼ በተካሄደው ምርጫ ነው ?", "ፍራንክሊን ዴላኖ ሮዘቨልት በተከታታይ በማሸነፍ የአሜሪካ ፕሬዝዳንት ሲሆኑ ለመጨረሻጊዜ ያሸነፉት ምርጫ በስንት ዓመተ ምህረት የተደረገውን ነው ?", "ፍራንክሊን ዴላኖ ሮዘቨልት አሜሪካንን ለስንት ዘመኖች በፕሬዝዳንትነት መርተዋል ?", "በ2ኛ አለማዊ ጦርነትም ወቅት አሜሪካን ይመሩ የነበሩት የአሜሪካ መሪ ማን ይባላሉ ?", "ፍራንክሊን ዴላኖ ሮዘቨልት ለአካለ ስንኩልነት የዳረጋቸው በሽታ ምን ነበር ?", "ፍራንክሊን ዴላኖ ሮዘቨልት ሲሞቱ ቦታውን የተረከቧቸው ምክትላቸው ማን ይባላሉ ?", "የአሜሪካ ፕሬዚዳንቶች ከ2 ጊዜ (እነሱም 8 አመታት) በላይ ሊያገለግሉ አይችሉም የሚለው የአሜሪካ ሕገ መንግሥት 22ኛ ማሻሻያ አንቀጽ ሕጋዊ ደንብ የሆነው መቼ ነው ?", "ፔኒሲሊንን ያገኘው የብሪታኒያ ተወላጁ ማን ይባላል ?", "፲፰፻፷፰ ዓ/ም ለመጀመሪያ ጊዜ በስልክ ረዳቱን አነጋገረ ሰው ማን ይባላል ?", "የኢትዮጵያ አርበኞችና የፋሺስት ኢጣሊያ ወገኖች ጦር ውጊያ የተካሄደው መቼ ነው ?", "ከኮንጎ የመጣ የቤልጅግ ሠራዊት የጣልያንን ሠራዊት አሸንፎ ፩ሺ፭፻ ወታደሮች በመማረክ አሶሳን የያዘው መቼ ነው ?", " በ፲፱፻፵፱ ዓ/ም የአሜሪካ ምክትል ፕሬዚዳንት ሆነው ኢትዮጵያን የጎነኙት ማን ይባላሉ ?", "ኢትዮጵያ እና ሱዳን ድንበራቸውን የሚወስን የጋራ ጉባዔ ለመመሥረት መወሰናቸውን ያሳወቁት መቼ ነው ?", "በኢትዮጵያ ርዕሰ ከተማ፣ አራት ኪሎ ላይ በሰላማዊ ሰልፍ የወጡ ተማሪዎችን ፖሊሶች በጢስ ቦምብ እና በዱላ የበታተናቸው መቼ ነው ?", " ተማሪዎቹ ለተቃውሞ ሰልፍ በመውጣት የጠቅላይ ሚኒስትር አክሊሉ ሀብተ-ወልድን ምን  አቃጠሉ ?", "በኢትዮጵያ አብዮት ሽብር የአየር በረራ አስተዳደር ሠራተኞች አድማ የተጀመረው መቼ ነው ?", "ሊትዌኒያ እራሷን ከሶቭየት ኅብረት አስተዳደር ውጭ ነጻ መሆኗን ያወጀች መቼ ነበር  ?", "ፔኒሲሊንን ያገኘው የብሪታኒያ ተወላጁ አሌክሳንደር ፍሌሚንግ ያረፈው በምን ምክንያት ነው ?", "ፔኒሲሊንን ያገኘው የብሪታኒያ ተወላጁ አሌክሳንደር ፍሌሚንግ ከዚህ ዓለም በሞት የተለየው መቼ ነው ?", "የአሜሪካ ብሔራዊ ምልክት ምን በመባል ይታወቃል ?", "የአሜሪካ ብሔራዊ ምልክት የሆነው  የአሜሪካ ታላቅ ማኅተም መጀመርያው የተገለጸው መቼ ነው ?", "«ANNUIT CŒPTIS» የሚለው መፈክር በሮማይስጥ ምን ማለት ነው ?", "«NOVUS ORDO SECLORUM» የሚለው መፈክር ትርጉም ምን ማለት ነው ?", "እንደ አሜሪካ ሰንደቅ አለማ ዝንጉርጉር የሆነውን አርማ የአሜሪካ ብሔራዊ ምልክት የቱ ጋር ይቀመጣል ?", "የአሜሪካ ብሔራዊ ምልክት በማኅተሙ ጀርባ ላይ የሚገኘው ምስል ምንድን ነው  ?", "የአሜሪካ ብሔራዊ ምልክት በመንቁራው ውስጥ የሚገኘው መፈክር E PLURIBUS UNUM ትርጓሜው ምን ማለት ነው ?", "የአሜሪካ ብሔራዊ ምልክት የሆነው የአሜሪካ ታላቅ ማኅተም በአሜሪካ ዶላር ላይ እና ፓስፖርት ላይ መታየት የጀመረው መቼ ነው ?", "የአሜሪካ ብሔራዊ ምልክት የሆነው የአሜሪካ ታላቅ ማኅተም ላይ የሚታየው መንድን ነው ?", "የአሜሪካ ብሔራዊ ምልክት ላይ በግራው ጥፍሩ (ከንሥሩ አንጻር) ውስጥ አሥራ ሦስቱ ፍላጻዎች ምንን ይወክላሉ ?", "የአሜሪካ ብሔራዊ ምልክት በቀኙም ጥፍር የወይራ ቅርንጫፍ ላ ምን ምን አሉበት ?", "የአሜሪካ ብሔራዊ ምልክት  ላይ ያለው ፍላጻ የምን ምልክት ነው ?", "የአሜሪካ ብሔራዊ ምልክት ያለው ወይራ የምን ምልክት ነው ?", "የአሜሪካ ብሔራዊ ምልክት ከራሱ በላይ ያሉት 13 ከዋክብት በሰማያዊ በስተኋላ መደብ ላይ ያሉት ምን ይሰራሉ ?", "የአሜሪካ ብሔራዊ ምልክት በመሠረቱ ላይ MDCCLXXVI ያለው ትርጉሙ ምንድን ነው ?", "የአሜሪካ ነጻነት አዋጅ የተፈረመበት ዓመተ ምህረት መቼ ነው ?", "ዕዝራ የጻፋቸው መፅሐፍት እነማን ናቸው ?", "በብሉይ ኪዳን ዘመን በባቢሎን ምርኮ ጊዜ የአይሁድ ካህን የነበረው ማን ይባላል ?", "የሠራያው ልጅ በፋርስ ንጉስ አርጤክስስ ከ5000 ከወገኖቹ ጋራ ወደ ኢየሩሳሌም ለመመለስ ፈቃድ የተቀበለው መቼ ነው ?", "የአንበሳ  እንስሶች መደብ ውስጥ ከየትኛው መደብ ነው የሚመደበው ?", "አራት ግዙፍ ድመቶች በመባል ከሚታወቁት ውስጥ አንዱ የሆነው አራዊት ማን ነው  ?", "አንበሳ አራዊት ከሚባሉት አውሬ በቁመቱና ክብደቱ ስንተኛ ደረጃ ነው ?", "አንበሳ በታሪክ እስያና በደቡብ አውሮፓ እንደነበርና እንደጠፋ የሚታወቅ ነው አሁን የሚገኘው በየት ነው ?", "አንበሳ በጥጋቡ ጊዜ በዝግታ  የሚያንኮራፉ ቢሆንም ምን ያህል ርቀት ድረስ ማንኮራፋቱ ይሰማል ?", "አንበሶች በትልልቅ መንጋ ተከፋፍለው የሚኖሩ ሲሆን እያንዳንዱ መንጋ ስንት አባላትን ይይዛል ?", "አንበሶች በማኅበር ከሚኖሩት ሲሆን ወገናቸው  ከእንስሳት መካከል የትኛው ወገን ነው ?", "በአንበሶች ዘንድ መንጋውን እየተዘዋወሩ የሚጠብቁና የመንጋውን የክልል ወሰን የሚያወጡ የትኞቹ አንበሶች ናቸው ?", "በአንበሶች ዘንድ መንጋውን እየተዘዋወሩ የሚጠብቁና የመንጋውን የክልል ወሰን የሚያወጡ አንበሶች ክብደታቸው ስንት ነው ?", "በአናብስት ቤተሰብ ላይ በቤት ውስጥ አመራር የሚሰጡት እናማን ናቸው ?", "ወደ ጥላ ሥፍራ መሄድን ወይም አደን መጀመርን በመሳሰሉት ሁኔታዎች ብዙውን ጊዜ መንጋውን ለአንድ ዓይነት እንቅስቃሴ የሚያነሳሱት የተኖቹ አናብስት ናቸው ?", "ሴት አንበሶች በአብዛኛው በምን ያህል ጊዜ  ይወልዳሉ ?", "የአንባሳ ግልገሎቹ ዕድገት ፈጣን ሲሆን በምን ያህል ጊዜ ውስጥ መሮጥና መቦረቅ ይጀምራሉ ?", "አንበሳ አብዛኛውን ጊዜውን የሚያሳልፈው ምን በማድረግ ነው ?", "አንበሶች በዕረፍት፣ በመተኛት ወይም በመቀመጥ በቀን ውስጥ ያለውን ምን ያህል ሰዓት ያሳልፋሉ ?", "ሩሲያዊ-አሜሪካዊ የሆነው ጉግልን የፈጠረው ግለሰብ ማን ይባላል ? ", "ሰርጌይ ሚካይሎቪች ብሪን ወላጅ እናት ናሳን ያገለገለችው በምን ሙያ ነው ?", "ሰርጌይ ሚካይሎቪች ብሪን መቼ ተወለደ ?", "ሰርጌይ ሚካይሎቪች ብሪን የትውልድ ስፍራው ማን በመባል ይታወቃል ?", "ሰርጌይ ሚካይሎቪች ብሪን  ሁለተኛ ደረጃ ትምህርቱን የተማረው የት ነው ? ", "ሰርጌይ ሚካይሎቪች ብሪን የባችለር ሳይንስ ዲግሪውን መቼ አገኘ ?", "ሰርጌይ ሚካይሎቪች ብሪን የማስተርስ ዲግሪውን ያገኘው ከየትኛው ዩኒቨርሲቲ ነው ?", "ሰርጌይ ሚካይሎቪች ብሪን የባችለር ሳይንስ ዲግሪውን ያገኘው ከየትኛው ዩኒቨርሲቲ ነው ?", "ሰርጌይ ሚካይሎቪች ብሪን የማስተርስ ዲግሪውን መቼ አገኘ ?", "የጉግል ቴክኖሎጂ ፕሬዝዳንት ማን በመባል ይታወቃል  ?", "ሰርጌይ ሚካይሎቪች ብሪን ወላጅ አባቱ ሚካኤል ሲባልየ እናቱ ስሟ ማን ይባላል ?", "ሰርጌይ ሚካይሎቪች ብሪን አባት የሆነው ሚካኤል ስራው ምንድነው  ?", "ሰርጌይ ሚካይሎቪች ብሪን ጉግልን ከመጀመሩ በፊት ያጠናቸው የትምህርት ዘርፎች ምን ምን ነበሩ  ?", "ሰርጌይ ሚካይሎቪች ብሪን ያለው የሀብት መጠን በዓለም እና በአሜሪካ በስንተኛ ደረጃ እንዲቀመጥ አስችሎታል ?", "ሰርጌይ ሚካይሎቪች ብሪን የዘጠነኛ ዓመት የልደት በዓሉን ሲያከብር ከአባቱ የተበረከተለት ስጦታ ምንድን ነው ?", "ሰርጌይ ሚካይሎቪች ብሪን  የመጀመሪያ ደረጃ ትምህርቱን የተከታተለበት ትምህርት ቤት ምን በመባል ይታወቃል?", "የባህል ጥናት፣ ሥነ ኅብረተሠብ ወይን ሥነ ማኅበረሰብ ሌላ ስሙ ማን ይባላል ?", "ሶሲዮሎጂ የሚለው ቃል መቼ ተፈጠረ ?", " የሰው ልጆች በቡድንና በተናጥል ያላቸውን ባሕል፣ ጠባይና አደረጃጀት የሚያጠና የሳይንስ ክፍል ምን ይባላል ?", "ሶሲዮሎጂ የሚለው ቃል ከሮማስጥ እና ከግሪክ በተውጣጡ ቃላት በማጋጠም የፈጠረው ፈረንሳዊው ሰው ማን ይባላል ?", "በፈረንሳይ ሥር በቅኝ ግዛትነት ትተዳደር የነበረችው ጋቦን ነፃ የወጣችው መቼ ነው ?", "ጋቦን ነፃነቷን ከተቀዳጀች በኋላ የአገሪቱ የመጀመሪያው ፕሬዚደንት የሆኑት ማን ናቸው ?", "በኢትዮጵያ አብዮታዊ ሽግግር የንጉሠ ነገሥቱ መንግሥት የክብር ዘበኛ ሠራዊት አዛዥ የነበሩት ማዮር ጄነራል ታፈሰ ለማ በደርግ መቼ ታሠሩ ?", "የቀዳማዊ ኃይለ ሥላሴ ልጅ ልዕልት ፀሐይ የሞቱት በስንት ዓመተ ምህረት ነው ?", "፲፱፻፶፪ ዓ/ም በኢትዮጵያ እና በኬንያ መኻል ያለውን ድንበር ለማስማማት የተዘጋጀውን የውል ረቂቅ ለኢትዮጵያ ያመጡት አምባሳደር ማን ይባላሉ ?", "የቀዳማዊ ኃይለ ሥላሴ ልጅ ልዕልት ፀሐይ በተወለዱ በስንት ዓመታቸው አረፉ ?", "በብሪታኒያ ንጉዛት እና በአሜሪካ ኅብረት መኻል በአትላንቲክ ውቅያኖስ ውስጥ አዲስ የቴሌግራፍ መስመር  መቼ ተዘረጋ ?", "ብሪታኒያ ንጉዛት እና በአሜሪካ ኅብረት መኻል በአትላንቲክ ውቅያኖስ ውስጥ የተዘረጋውን አዲሱን የቴሌግራፍ መስመር  የሰላምታ መልዕክት በመለዋወጥ የመረቁት እነማን ናቸው ?", "የኢትዮጵያ ንጉሠ ነገሥት መንግሥት የአገሪቱን የመጀመሪያ አየር-ዠበብ (አውሮፕላን)  በስንት ዓመተ ምሀርት ተረከቡ ? ", "ብሪታኒያ ዋና መላክተኛ አምባሳደር ዳግላስ ራይት በ ፲፱፻፶፪ ዓ/ም በኢትዮጵያ እና በኬንያ መኻል ያለውን ድንበር ለማስማማት የውል ረቂቅ የተረከቡት ማን ይባላሉ  ?", "በኢትዮጵያ አብዮታዊ ሽግግር የንጉሠ ነገሥቱ መንግሥት የክብር ዘበኛ ሠራዊት አዛዥ የነበሩት ማን ይባላሉ ?", "የኢትዮጵያ አየር መንገድ ከቦይንግ ኩባንያ ከገዛቸው አሥር ቦይንግ 787 ድሪምላይነር አየር-ዠበቦች የሰጠው የመጀመሪያው ሰሌዳ ቁጥር ስንት ነው ?", "ግሥላ አጥቢ አውሬ ሲሆን የሚገኘው የት ነው  ?", "የአንድ ጎልማሳ ግሥላ ክብደ ምን ያህል ድረስ ሊመዝን ይችላል ?", "ግስላ ከመሬት እስከ ሆዱ ቁመቱ ስንት ሴ. ሜ ይሆናል ?", "የግስላ የጭራው ርዝማኔ ስንት ሴ.ሜ ይሆናል ?", "ግስላ በዱር ሲኖር ለምን ያህል ጊዜ ይቆያሉ ?", "ግስላ በሰው ተይዘው በእንክብካቤ ሲኖሩ ለምን ያህ፤ ጊዜ ይኖራሉ ?", "ቀጭኔ ሹል የሆኑ እሾሆች የታጠሩ ቅጠሎችን ለመቀንጠብ የምትጠቀምበት አካሏ የቱን ነው ?", "ቀጭኔዎች በቀን ምን ያህል ኪሎ ግራም ዕፅዋት መመገብ ይችላሉ ?", "ቀጭኔዎች የተለያዩ ዕፅዋትን የሚበሉ ሲሆን ከሁሉም በይበልጥ የሚመርጡት በአፍሪካ ሜዳዎች የሚገኙትን ምግባቸው ምን ይባላል ?", "አንድ ወንድ ቀጭኔ ምግብ ለመፈለግ ምላሱን ምን ያህል መዘርጋት ይችላሉ ?", "ለቀጭኔ ወደ ላይ በመንጠራራት በጣም ቀላል ነገር ሲሆን ከባዱ ነገር ምንድነው ?", "የቀጭኔ ዕድሜ እየገፋ በሄደ መጠን ቀለሟ ምን እየሆነ ይሄዳል ?", "ቀጭኔዎች በመንጋ ተደራጅተው አንድ ላይ የሚኖሩ ማኅበራዊ ፍጥረታት ሲሆኑ በአነድ መንጋ ምን ያህል ይኖራሉ ?", "አንዲት ነፍሰ ጡር ቀጭኔ የእርግዝና ጊዜ ምን ያህል ነው ?", "ቀጭኔ የእርግዝና ጊዜዋን አጠናቃ ልጅ በምትወልድበት ጊዜ የልጇ ቁመት ምን ያህል ነው ?", "የቀጭኔ ግልገል በምትወለድበት ጊዜ የምታስቀድመው የሰውነት ክፍል የቱን ነው ?", "ቀጭኔ ከተወለደች በኋላ እየተውተረተረች ትነሳና የእናቷን ጡት ለመጥባት ምን ያህል ጊዜ ይፈጅባታል ?", "ቀጭኔ ከተወለደች በኋላ አንድ ሜትር የሚያክል ቁመት ለመጨመር ምን ያህል ጊዜ ያስፈልጋታል ?", "ቀጭኔ ግዙፍ አካል፣ ከፍተኛ ፍጥነት፣ ቅልጥፍናና የማየት ችሎታ ስላላት በብቸኛነት የሚያጠቃት ማን ነው ?", "ቀጭኔ በልቧ እና አንጎላ  መካከል ያለው ምን ያህል ርቀት ነው ?", "የቀጭኔ ልብ ከሰው የደም ግፊት በምን ያዕል የሚበልጥ ግፊት ያመነጫል ?", "የቀጭኔ ልብ በደቂቃ ምን ያህል ይመታል ?", "በደቂቃ እስከ 170 ጊዜ የሚመታው የቀጭኔ ልብ ምን ያህል ውፍረት አለው ?", "ወደ ቀጭኔ አንጎል የሚሄደውን ደም የሚሸከመው የደም ቧንቧ ምን ይባላል ?", "ቀጭኔ ከአንጎል ወደ ልብ የሚመለሰውን ደም የሚሸከመው የደም ቧንቧ ምን ይባላል ?", "በከፍተኛ ኃይል ተገፍትሮ የመጣው ደም የደሙ ግፊት ተስተካክሎ በአንጎል ላይ ጉዳት የማያስከትል ሆኖ በርካታ ወደሆኑ ትናንሽ የደም ሥሮች እንዲገባ የሚሆነው ምን ላይ ነው ?", "በኢትዮጵያ ፕሬስ ድርጅት ሥር የሚተዳደር በኢትዮጵያ በየዕለቱ የሚታተም ብሔራዊ ጋዜጣ ምን ይባላል ?", "አዲስ ዘመን ጋዜጣ በይ ስራውን የጀመረው መቼ ነው ?", "አዲ ዘመን ጋዜጣ ስራውን በይፋ ያስጀመሩት የኢትዮጵያ ንጉሰ ነገስት ማን ይባላሉ ?", "የአዲስ ዘመን ጋዜጣ ስያሜውን ያገኘው ንጉሰ ነገስቱ የተናገሩት ንግግር ምን የሚል ነበር ?", "አዲስ ዘመን ጋዜጣ ለመጀመሪያ ጊዜ ለህትመት ሲበቃ የነበረው የገፅ ብዛት ስንት ነበር ?", "አዲስ ዘመን ከተጀመረበት ጊዜ እስከ ታኅሣሥ ወር ፲፱፻፶፩ ዓ/ም ድረስየሚታተመው መቼ መቼ ነበር ?", "የአዲስ ዘመን ጋዜ በሳምንት አንድ ቀን ከመታተም ወደ ስድስት ቀን እንዲያድግ ያደረጉት እነማን ናቸው ?", "የአዲስ ዘመን ጋዜ በሳምንት አንድ ቀን ከመታተም ወደ ስድስት ቀን እንዲያድግ የተደረገው በስንት ዓመተ ምህረት ነው ?", "አዲስ ዘመን ጋዜጣ በየቀኑ ከሰኞ እስከ እሑድ በሳምንት ሰባት ቀናት መታተም የጀመረው መቼ ነው ?", "አዲስ ዘመን የተለያዩ ቅርፆች የነበሩት ሲሆን ጋዜጣው መካከለኛ ጋዜጣነት /በርሊነር/  ቅርፅ የያዘው መቼ ነው ?", "የኡዝቤኪስታን ርዕሰ ከተማ ማን ትባላለች ?", "በምሥራቅ አፍሪቃ የሚገኙት ታንጋኒካ እና የዛንዚባር ደሴት ተዋሕደው አንድ አገር የመሠረቱት መቼ ነው ?", "ታንጋኒካ እና የዛንዚባር ደሴት ተዋሕደው ሲዋሃዱ የተፈጠረቸው ሀገር  መጠሪያ ስሟን  ማን ብለው ሰየሙ?", "በሶቪዬት ሕብረት ውስጥ የቸርኖቢል የኑክሊዬር መብራት ኃይል ማምረቻ አደጋ የተከሰተው በስንት ዓመተ ምህረት ነው?", "የሳዑዲ አረቢያ ልዑካን ቡድን በሼክ ሞሀመድ ማህሙድ ኤል ሳዋ እየተመራ  ለአጭር ጉብኝት በስንት ዓመተ ምህረት አዲስ አበባ ገባ ?", "የቀድሞ ሚኒስትሮችና ባለ ሥልጣናት ፣ የፖሊስ አለቆች  ከደርግ በተላለፈ ትህዛዝ መቼ ታሠሩ ? ", "የኢትዮጵያ ንጉሰ ነገስት አፄ ናኦድ በስንት ዓመተ ምህረት አረፉ?", "በኩባ በእስፓኝ እና በአሜሪካ መካከል የነበርው የማስተዳደር ፍልሚያ የተቋጨው በስንት ዓመተ ምህረት ነው? ", "ዐፄ ኖኦድን ተክተው የነገሱት ልጃቸው ስማቸው ማን ይባላል ?", "በኢትዮጵያ ዘመን አቆጣጠር ነሐሴ ሰባት  336ኛው ቀን ሲሆን ለክረምት ስንተኛው ቀን ነው ?", "የባንግላዴሽ የባንክ ባለሞያና ኤኮኖሚስት የሆኑት ፕሮፌሰር ሙሃመድ ዩኑስ መቼ ተወለዱ ?", "ማይክሮክሬዲት የተሰኘውን የአነስተኛ የብድር አገልግሎት ተቋም በችግር ለሚኖሩ ወገኖች የመስጠትን ስራ የጀመሩና ያስፋፉ ፕሮፌሰር ማን ይባላሉ  ? ", "በፕሮፌሰር ሙሃመድ ዩኑስ የስራሳቸውንና የስራቸውን ታሪክ የሚያትት የተጻፈው የመፅሐፍ ርዕስ ምን ይባላል ?", "፲፰፻፺፯ ዓ/ም  በሕንድ ግዛት ውስጥ ተከስቶ የ ፳ ሺ ሰዎችን ሕይወት ያጠፋው እሳተ ገሞራ የተከሰተው በየትኛው ሸለቆ ነው ?", "የሰሜን አትለንቲክ የውል ድርጅትን  አሥራ ሁለቱ ምዕራባውያን አገሮች መቼ መሰረቱ ?", " የአፍሪካ ሀገር የሆነችው ሴኔጋል ከ ፈረንሳይ ቅኝ ግዛት የተላቀቀችውና  ነጻነቷን ተቀዳጀች መቼ ነው ?", "አሜሪካዊው የሰብዓዊ መብት ተሟጋችና የጥቁር አሜሪካውያን መሪ የነበረው ታናሹ ማርቲን ሉተር ኪንግ መቼ ተገደለ ?", "አሜሪካዊው የሰብዓዊ መብት ተሟጋችና የጥቁር አሜሪካውያን መሪ የነበረው ታናሹ ማርቲን ሉተር ኪንግ  በማን ተገደለ ?", "አሜሪካዊው የሰብዓዊ መብት ተሟጋችና የጥቁር አሜሪካውያን መሪ የነበረው ታናሹ ማርቲን ሉተር ኪንግ በየትኛው ከተማ ተገደለ ?", "፲፱፻፶፬ ዓ/ም የተከሰከሰው አየር ዠበብ አውሮፕላን ስሙ ማን ይባላል ?", "የኤር ፍራንስ ቦይንግ ፯፻፯ አየር ዠበብ ከፓሪስ ኦርሊ ማረፊያ ተነስቶ ወደ አትላንታ ለመብረር ሲነሳ በደረሰበት አደጋየደረሰበት መቼ ነው ?", "የኤር ፍራንስ ቦይንግ ፯፻፯ አየር ዠበብ በደረሰ አደጋ የሟቹች ቁጥር ስንት ነው ?", "የአሜሪካው ‘ኖርዝ ዌስት ኤየርላይንስ’ ዲ-ሲ-፯ አየር ዠበብ በረራ በሰላማዊ ውቅያኖስ ላይ የወደቀው መቼ ነው ?", "በሰላማዊ ውቅያኖስ ላይ የወደቀው የአሜሪካው ‘ኖርዝ ዌስት ኤየርላይንስ’ አውሮፕላን ስሙ ማን ይባላል ?", " የአሜሪካው ‘ኖርዝ ዌስት ኤየርላይንስ’ ዲ-ሲ-፯ አየር ዠበብ በረራ  በደረሰ የመከስከስ አደጋ አደጋ የሟቹች ቁጥር ስንት ነው  ?", "በኮንኮርድ አየር ዠበብ አምሳል የተሠራው የሶቪዬት ቱፖሌቭ ቲ-ዩ-፻፵፬ ፈረንሳይ ላይ በደረሰበት የበረራ አደጋ የተከሰተው መቼ ነው ?", "በሞንቴኔግሮ የሉዐላዊነት አዋጅ ምክንያት - የቀድሞዋ ዩጎዝላቪያ አካላት የነበሩት ሰርቢያ እና ሞንቴኔግሮ  ስምምነታቸውን መቼ አፈረሱ  ?", "በኮንኮርድ አየር ዠበብ አምሳል የተሠራው የሶቪዬት ቱፖሌቭ ቲ-ዩ-፻፵፬ ፈረንሳይ ላይ በደረሰበት አደጋ የሟቹች ቁጥር ስንት ?", "እቴጌ ምንትዋብ  ባለቤታቸው ማን ይባላል ?", "የዓፄ በካፋ ሚስት የነበሩት እቴጌ ምንትዋብ ከዚህ ዓለም በሞት የተለዩት በስንት ዓመተ ምህረት ነው ?", "የእቴጌ ምንትዋብ የቀብር ስነስርዓት የተፈፀመበት ቤተክርስቲያ ማን ይባላል ?", "የሸዋው ንጉሥ ምኒልክ ሠራዊት እና የጎጃም ንጉሥ ተክለ ሃይማኖት ሠራዊት ውጊያ የገጠሙበት ቦታ ምን ይባላል ?", "የሰሜን አፍሪቃ የፈረንሳይን ቅኝ ገዢነት ማክተሚያ አብሳሪ እንደሆነ የሚገረው ምንድን ነው ?", "የአሰብ የነዳጅ ማጣሪያ ማዕከል የተገነባው በማን ነው ?", "የአሰብ የነዳጅ ማጣሪያ ማዕከል ለመገንባት የመሰረት ድንጋይ መቼ ተጣለ ?", "የኢትዮጵያ ንጉሠ ነገሥት መንግሥት የውጭ ጉዳይ ሚኒስትር ማን ይባላሉ ?", "ዶክቶር ምናሴ ኃይሌ የኢትዮጵያ ንጉሠ ነገሥት መንግሥት የውጭ ጉዳይ ሚኒስትር ከስልጣን ራሳቸውን መቼ አገለሉ ?", "የሸዋው ንጉሥ ምኒልክ ሠራዊት እና የጎጃም ንጉሥ ተክለ ሃይማኖት ሠራዊት እምባቦ በተባለው ቦታ ላይ ውጊያ ገጠሙት በስንት ዓመተ ምህረት ነው ?", "የሸዋው ንጉሥ ምኒልክ ሠራዊት እና የጎጃም ንጉሥ ተክለ ሃይማኖት ሠራዊት  በገጠሙት ውጊያ የተማረከው ንጉስ ማን ይባላል  ?", "፲፰፻፺ ዓ/ም ብዙ መቶ ሰልፈኞች በመድፍ የገደላቸው ጣልያናዊ ማን ይባላል  ?", "የእንግሊዝን አስተዳደር በመቃወም  ሞሃንድራስ ካራምቻንድ ጋንዲ  ያደረገው ድርጊት ምን ነበር  ?", "ሞሃንድራስ ካራምቻንድ ጋንዲ የሚጠራበት ቅፅል ስሙ ማን ነው ?", "በአውሮፓ የሁለተኛው የዓለም ጦርነትን  ያከተመው መቼ ነው ?", "አቶ ለገሰ ዜናዊ አስረስ፣ የኢ.ፌ.ዴ.ሪ. መንግሥት ጠቅላይ ሚኒስትር መቼ ተወለዱ ?", "አቶ ለገሰ ዜናዊ አስረስ፣ የኢ.ፌ.ዴ.ሪ. መንግሥት ጠቅላይ ሚኒስትር የት ተወለዱ ?", "በጥንታዊ ዘመን በላይኛ ጤግሮስ ወንዝ አጠገብ የተገኘ ከተማና ስሙ ማን ይባላል ?", "የዛሬዋ ቱርክ ይህን ስሟ ከማግኘቷ በፊት ትጠራበት የነበረው መጠሪያ ስሟ ማን ይባላል ?", "በ1720 ዓክልበ. ግ. ከነአሦር ከተማን ያቀናው የአሞራዊው ንጉሥ ማን ይባላል ?", "1688-1678 ዓክልበ. በአሦር ላይ የተሾመው የንጉሥ 1 ሻምሺ-አዳድ ልጅ ማን ይባላል ?", "የአሦር መንግስትን ድል አድርጎት ዙሪያው ደ ባቢሎን መንግሥት እንዲተላለፍ ያደረገው የባቢሎን ንጉስ ማን ይባላል ?", "ባቢሎን ለካሣውያን የወደቁት መቼ ነው ?", "አሦር በሚታኒ መንግሥት (ሑራውያን) የተሸነፈው መቼ ነበር  ?", "ሚታኒ በኬጢያውያን ግፊት ሲወድቅ  የአሦር ንጉስ አሹር-ኡባሊት ነጻነቱን ያወጀው መቼ ነው ?", "አሹር-ኡባሊት በባቢሎን ዙፋን ላይ የሾመው የልጁ ስም ማን ይባላል ?", "የሚታኒን መንግሥት በ1290 ዓክልበ. ያሸነፈው የአሦር ንጉስ ማን ይባላል ?", "አዳኝ አንበሶች በጣም ቀልጣፋና ፈጣን ቢሆኑም እንኳ አደን ጊዜ የሚሳካላቸው  ስንት በመቶ  ነው ?", "አንበሶች ክብደታቸው እስከ ስንት ኪሎ ግራም የሆኑ እንስሳት የመጣልና የመግደል አቅም አላቸው ?", "አንበሶች በሰዓት እስከ ስንት ኪሎ ሜትር ድረስ ሊሮጡ ይችላሉ ? ", "በአንበሶች ዘንድ 90 በመቶ  የማደኑን ተግባር የሚያከናውኑት የትኞቹ ናቸው ?", "አንበሶች አድነው ካመጡት ውስጥ በመመገብ ትልቁን ድርሻ የሚያገኙት የትኞቹ ናቸው ?", "ብዙውን ጊዜ አንበሶች የሚያገሱበት ሰዓት የትኛው ነው ?", "ወንዶቹ አንበሶች የሚኖሩበትን ክልል ድንበር ለማሳወቅ እንዲሁም ሌሎች ወንድ አንበሶች ወደ ክልላቸው እንዳይገቡ ለማስጠንቀቅ ምን ያደርጋሉ ?", "አንድ እንስሳ ከገደሉ በኋላ ለሌሎቹ የቤተሰቡ አባላት ምግቡ ያለበትን ቦታ ለማሳወቅ አንበሶች ምን ያደርጋሉ ?", "በአፍሪካ የሚኖር ባለሙሉ ጣት ሸሆኔ ጡት አጥቢ አራዊት የሆነ እንስሳ ማን ይባላል ?", " ቀጭኔ በምድር ከሚገኙ እንሰሳት በርዝማኔ ስንተኛ ደረጃ ይዞ ይገኛል ?", "ወንዱ ቀጭኔ ርዝማኔው ምን ያህል ይሆናል ?", "ወንዱ ቀጭኔ ስንት ኪሎ ግራም ይመዝናል ?", "በቀጭኔ ርዝመት ላይ እስከ አሁን በሪከርድነት የተያዘው  ከፍተኛው ርዝማኔ ስንት ሜትር ነው ?", "በቀጭኔ ክብደት ላይ እስከ አሁን በሪከርድነት የተያዘው  ከፍተኛው ክብደት ስንት ኪ.ግ ነው ?", "ቀጭኔዎች በሰዓት ምን ያህል ኪ.ሜ  ሊሮጡ ይችላሉ ?", "በብሔራት መካከል ሰላምና በጎ ፈቃድ መኖሩን ለማመልከት ለነገሥታትና ለገዥዎች ምን ዓይነት ገጸ በረከትነት ይሰጥ ነበር ?", "በኢትዮጵያ የመጀመሪያ የሆነውን ዘመናዊ ኮሜድ ተውኔት ምን ይባላል ?", "በሀረር ሀደሬ ጢቆ መካነ ሥላሴ", "መንግስቱ ለማ መቼ ተወለደ ?", "በኢትዮጵያ የመጀመሪያ የሆነውን ዘመናዊ ኮሜድ ተውኔት ያስተዋቀቀው ማን ይባላል ?", "መንግስቱ ለማን በኢትዮጵያ የስነ-ጽሁፍ ታሪክ ውስጥ ቀዳሚ ተጠቃሽ ካደረጉት ስራዎቹ የሚጠቀሱት የትኞቹ ናቸው ?", "በተጨማሪም «The bear» የተሰኘውን እና የታዋቂው የሩሲያ ደራሲ ተውኔት መንግስቱ ለማ ምን ብሎ ተርጉሞታለ ?", "መንግስቱ ላማ የጄ.ቢ. ፕሪስትሊን ስ ተርጉሞ ለመድረክ  ያበቃው ስራው ምን ይባላል ?", "መንግስቱ ከተውኔቱ ውጪ የሚታወቅበት ሙያ ምን ነበር ?", "የሴኔጋል የመጀመሪያው መራሄ መንግስት ማን ይባላሉ ?", "የሴኔጋል የመጀመሪያው መራሄ መንግስት ለምን ያህል ጊዜ ሴኔጋልን መሩ ?", "የሴኔጋል ዋና ከተማ ምን ትባላላች ?", "ሊኦፖልድ ሴዳር ሴንጎር በትንሻ የአሳ አጥማጆች መንደር መቼ ተወለዱ ?", "ሊኦፖልድ ሴዳር ሴንጎር አባታችው የሚወለዱበት ጎሳ ማን ይባላል ?", "ሊኦፖልድ ሴዳር ሴንጎር  እናታቸው የሚወለዱበት ጎሳ ማን ይባላል ?", "ሊኦፖልድ ሴዳር ሴንጎር  በ1931 የተመረቁበት ትምህርት ቤት ማን ይባላል ?", "አልበርት ቺኑዋሉሞጉ አቼቤ ኒው ዮርክ ውስጥ በሚገኘው የባርድ ኮሌጅ በምን ሙያ ያገለግል ነበር ?", "አልበርት ቺኑዋሉሞጉ አቼቤ  መቼ ተወለደ ?", "ቺኑዋ አቼቤ ሙሉ ስሙ ማን ይባላል ?", "አልበርት ቺኑዋሉሞጉ አቼቤ  የት ተወለደ ?", "አልበርት ቺኑዋሉሞጉ አቼቤ ወላጅ እናት እና አባት ማን ይባላሉ ?", "አልበርት ቺኑዋሉሞጉ አቼቤ  የመጀመሪያውን ዲግሪ ከየት ዩኒቨርሲቲ አገኘ ?", "አልበርት ቺኑዋሉሞጉ አቼቤ  የመጀመሪያውን ዲግሪ መቼ አገኘ ?", "ለአቼቤ 50 ወደሚሆኑ የአለም ቋንቋ የተተርጎመ እና 10,000,000 ቅጂዎች የተሸጡለት ድንቅ የስነፅሑፍ ስራው ምን በመባል ይታወቃል ?", "አልበርት ቺኑዋሉሞጉ አቼቤ ከስንት ዩኒቨርሲቲ የክብር ዶክትሬት የተቀበለ ሲሆን ብዙ ሽልማቶችንአግኝቷል ?", "በ1988 እ.ኤ.አ. በስነ-ጽሁፍ የኖቤል ሽልማትን የተቀዳጀ ግብጻዊ ደራሲ ማን ይባላል ?", "ናጊብ ማህፉዝ መቼ ተወለደ ?", "ናጊብ ማህፉዝ የትውል ቦታው የት ነው ?", "ናጊብ ማህፉዝ መጠሪያ ስሙን ያገኘው ከየት ነው ?", "ናጊብ ማህፉዝ በስነ-ጽሁፉም ዘርፍ ላይ ምን ያህል ወጥ ልብ-ወለዶች ለዓለም አበርክቷል ?", "ናጊብ ማህፉዝ በስነ-ጽሁፉም ዘርፍ ላይ ምን ያህል አጫጭር ታሪኮችን ለዓለም አበርክቷል ?", "ናጊብ ማህፉዝ በስነ-ጽሁፉም ዘርፍ ላይ ምን ያህል ወጥ የሲኒማ ድርሰቶች ለዓለም አበርክቷል ?", "ናጊብ ማህፉዝ በስነ-ጽሁፉም ዘርፍ ላይ ምን ያህል ተውኔቶችን  ለዓለም አበርክቷል ?", "ተወዳጅነት ካተረፈበት ስራዎቹ መካከል በ1971 ያሳተመውጀ ድርሰቱ ምን ይባላል ?", "ናጊብ ማህፉዝ አምላክን በመገዳደር አስወንጅሎት መጽሃፉም በግብጽ ውስጥ እንዳይሰራጭ ለረጅም ጊዜ የታገደወው ድርሰቱ ምን ይባላል ?", "በ1989 የኢራኑ መሪ አያቶላህ ሮላህ ኾሚኒ የግድያ ትእዛዝ እንዲያስተላልፉበት ያደረገው ስራው ምን ይባላል ?", "ናጊብ ማህፉዝ የመግደል ሙከራ ተደርጎበት በስለት አንገቱ ላይ በመውጋት ጉዳት ያደረሱበት በስንት ዓመተ ምህረት ነው ?", "ናጊብ ማህፉዝ የተገደበት መጽሐፍ በድጋሚ  ለገበያ የቀረበው በስንት ዓመተ ምህረት ነበር ?", "ለግብጽም ሆነ ለአረቡ ዓለም የመጀመሪያው የኖቤልን ሽልማት ተሸላሚ ማን ይባላል ?", "በስነ-ጽሁፍ የኖቤል ተሸላሚ ከሆኑት ሰዎች ሁሉ የረጅም እድሜ ባለቤት በመሆን ሶስተኛ ደረጃን የያዘ ሰው ማን ይባላል ?", "ናጊብ ማህፉዝ ለዓለም በርካታ ስራዎችን አበርክቶ ከዚህ ዓለም ያረፈው መቼ ነው ?", "ናጊብ ማህፉዝ የቀብር ስነ ስርዓት የት ተፈፀመ ?", "የኮረማሽ ወረዳ የት ክልል ትገኛለች?", "ኮረማሽን የመሰረቷት ማናቸው?", "በኮረማሽ ወረዳ ፲፱፻፱ ዓ/ም በተደረገው ጦርነት ማን አሸነፈ?", "የሶቭየት ሕብረት መቼ ፈረሰ?", "የሶቪየት ሕብረት ሰብአዊ ሪፐብሊክ መቼ ተመሰረተ?", "በ፲፱፻፵፱ የሶቭየት ሕብረት ስንት ሪፐብሊካንን ያካተተ ነበር?", "የሶቪዬት ኅብረት መጨረሻ ላይ ታኅሣሥ ፲፮ ቀን ፲፱፻፹፬ ዓ.ም ፈርሶ በዓለም መንግሥታት እውቅናና ስምምነት ሕጋዊ ወራሽነት የማን እንዲሆን ታወጀ?", "ተክለጻድቅ መኩርያ መቼ ተወለዱ?", "ተክለጻድቅ መኩርያ የት ተወለዱ?", "ተክለጻድቅ መኩርያ አዲስ አበባ መጥተው ትምህርታቸውን  የት ተከታተሉ?", "ተክለጻድቅ መኩርያ ለስንት አመት በእስር ቆዩ?", "ተክለጻድቅ መኩርያ የመጀመሪያው መጽሐፍ ምን ይባል ነበር?", "ተክለጻድቅ መኩርያ የመጀመሪያውን መጽሐፋቸውን መቼ አሳተሙ?", "የተክለጻድቅ መኩርያ የመጨረሻው መጽሐፍ ምን ነበር?", "የተክለጻድቅ መኩርያ የመጨረሻው መጽሐፍ መቼ ለአንባቢ ቀረበ?", "ተክለጻድቅ መኩርያ ጡረታ ከወጡ በኃላ ስንት ታላላቅ የታሪክ ስራዎችን ሰርተዋል?", "ተክለጻድቅ መኩርያ መቼ ከዚህ አለም በሞት ተለዩ?", "ተክለጻድቅ መኩርያ በስንት ዓመታቸው ከዚህ አለም በሞት ተለዩ ?", "ኮንግ-ፋጸ (ኮንፉክዩስ) ማን ነው?", "ኮንግ-ፋጸ የተወለደው የት ነው?", "ኮንግ-ፋጸ በየትኛዎቹ አገራት እና ባህሎች ላይ ተጽእኖ አድርጋል?", "ኮንግ-ፋጸ ፍልስፍና ውስጥ ልዩ ትኩረት ያገኙት የትኞቹ ናቸው?", "ኮንግ-ፋጸ ለስንት ደቀ መዛሙርቱ የፍልስፍና ትምህርቱን አስተማረ?", "የኮንግ-ፉጸ ትምህርት በመንግስት ይፋ የሆነው መቼ ነው?", "የኮንግ-ፉጸ ትምህርትን የማን ሥርወ መንግሥት ይፋ አደረገው?", "በቻይና ዘመናዊው የኮንግ-ፉጸ ትምሕርት መቼ ይፋ ሆነ?", "ኮሎኔል ሣህሌ ደጋጎ ስንት ልጅ እና የልጅ ልጅ አሉዋቸው?", "ኮሎኔል ሣህሌ ደጋጎ ባለቤታቸው ማን ይባላሉ?", "ሳውዲ አረብያ የት ነው የምትገኘው?", "ሳውዲ አረብያ በምን ትታወቃለች?", "ሳውዲ አረብያ በማን ተመሰረተች?", "የሳውዲ የአገዛዝ ስርአት ምንድነው?", "በሳውዲ አረቢያ ምን ያህል ህዝቦች ይኖራሉ?", "በሳውዲ አረቢያ ከሚኖሩት ምን ያህሉ የሳውዲ ዜጎች ይኖራሉ?", "ሳውዲ አረብያ የመሬት ስፋቱዋ ምን ያህል ነው?", "ሳውዲ አረብያ በሰሜን የሚያዋስኑዋት የትኞቹ ሀገራት ናቸው?", "ሳውዲ አረብያ በሰሜን ምስራቅ የሚያዋስኑዋት የትኞቹ ሀገራት ናቸው? ", "ሳውዲ አረብያ በደቡብ ምስራቅ የሚያዋስናት ሀገር የትኛው ነው ?", "ሳውዲ አረብያ በደቡብ ምስራቅ የሚያዋስናት ሀገር የትኛው ነው ?", "የሳውዲ አረብያ መሬት በምን የተከበበ ነው?", "ሳውዲ አረብያ የትኞቹን ባህር የያዘ ነው?", "የበፊቱ አራቱ ሳውዲ አረብያ ግዛቶች የትኞቹ ናቸው?", "የበፊቱ አራቱ ሳውዲ አረብያ ግዛቶች የትኞቹ ናቸው?", "በሳውዲ የትኞቹ የእስልምና ተከታዮት ይበዛሉ?", "በሳውዲ ቅዱስ ስፍራ የሚባለው የትኛው ነው?", "በሳውዲ በነዳጅ ምርቱዋ ከአለም ስንተኛ ናት?", "በሳውዲ ከነዳጅ ምርቱዋ በተጨማሪ በምን ትታወቃለች?", "ሳውዲ ከሌሎቹ አረብ አገራት ብቸኛዋ የምን አባል ናት?", "ሳውዲ ለጦር ኃይል ከፍተኛ ገንዘብ በማውጣት ከዓለም በስንተኛ ደረጃ ትገኛለች?", "ሳውዲ የትኞቱ የግሩፕ አባላት ሀገር ናት?", "በፉልሃም ለንደን የሚገኝ የቼልሲ እግር ኳስ ቡድን የእግር ኳስ ሜዳ ምን ይባላል?", "ስታምፎርድ ብሪጅ የእግር ኳስ ሜዳ ስንት ስዎችን ማስተናገድ ይችላል?", "ስታምፎርድ ብሪጅ የለንደን አትሌቲክስ ክለብ ስታድየም ሆኖ መች ተመሰረተ?", "ስታምፎርድ ብሪጅ የየትኛው እግር ኳስ ቡድን ሜዳ ነው?", "ስታምፎርድ ብሪጅ የእግር ኳስ ሜዳ የት ይገኛል?", "የአጼ ዐምደ ጽዮን አባት ማን ናቸው?", "የአጼ ዐምደ ጽዮን አያት ማን ናቸው?", "የአጼ ዐምደ ጽዮን የዙፋን ስም ማን ይባላል?", "አጼ ዐምደ ጽዮን ምን ያህል ጊዜ ነገሱ?", "አጼ ዘርአ ያዕቆብ መቼ ተወለዱ?", "አጼ ዘርአ ያዕቆብ የነገሱበት ዘመን ከመቼ እስከ መቼ ነበር?", "የአጼ ዘርአ ያዕቆብ የዘውድ ስማቸው ማን ይባላል?", "የአጼ ዘርአ ያዕቆብ አባትና እናት ማን ይባላሉ?", "አጼ ዘርአ ያዕቆብ ያረፉት በየት ነው?", "የአጼ ዘርአ ያዕቆብ አባት ባረፉ ጊዜ ማን ነው የአባታቸውን ስልጣን የተረከበው?", "አጼ ዘርአ ያዕቆብ ታላቅ ወንድማቸው ወደ ግዞት እንዲሄዱ ያደረጉት ወዴት ነው?", "አጼ ዘርአ ያዕቆብ ምን ያህል ጊዜ በእስር ቆይተዋል?", "አጼ ዘርአ ያዕቆብ መቼ ዘውዳቸውን ጫኑ?", "የአጼ ዘርአ ያዕቆብ ሚስት ማን ናቸው?", "አጼ ዘርአ ያዕቆብ በደብረ ምጥማቅ ጉባኤ ከግብጾቹ ጳጳሳት ጋር ተገናኝተው የቤተ-ክርስቲያንን ችግር የፈቱት መቼ ነው?", "አጼ ዘርአ ያዕቆብ ከደቀ እስጢፎ እምነት ተከታዮች ከነበሩት ጋር የተከራከሩት በምን ጉዳይ ነው?", "አጼ ዘርአ ያዕቆብ በ1445 በተደረገው ጦርነት ላይ በማሸነፍ የትኛውን ግዛት አጠቃለው መያዝ ቻሉ?", "አጼ ዘርአ ያዕቆብ የነበሩበት ከተማ እንዴት ደብረ ብርሃን ብለው ሊያወጡለት ቻሉ?", "አጼ ዘርአ ያዕቆብ ምን ያህል መፃህፍትን ፅፈዋል?", "አጼ ዘርአ ያዕቆብ መቼ አገቡ?", "አፄ ፋሲል መቼ አረፉ?", "አፄ ፋሲለደስ የዙፋን ስማቸው ማን ይባላል?", "አፄ ፋሲል ለምን ያህል ጊዜ በንግስና ቆዩ?", "አፄ ፋሲል መቼ ነው ለንግስና የበቁት?", "የአፄ ፋሲል የሲመት ንግስና መቼ ተካሄደ?", "አፄ ፋሲል በየትኛው ቤተ-ክርስቲያን ስርአተ ቀብራቸው ተፈፀመ?", "አፄ ፋሲል መቼና የት ተወለዱ?", "በጣም የታወቀው የቅልብልቦሽ አይነት የትኛው ነው?", "በቅልብልቦሽ ጨዋታ ብጀ ማለት ምን ማለት ነው?", "የቅልልብልቦሽ ጨዋታ ለስንት ነው የሚጫወቱት?", "በቅልብልቦሽ ጨዋታ ስንት ጠጠር ድንጋዮች ይጠቀማሉ?", "በቅልብልቦሽ ጨዋታ ብቀ ማለት ምን ማለት ነው?", "በቅልብልቦሽ ጨዋታ ብቀጣጥል ማለት ምን ማለት ነው?", "በቅልብልቦሽ ጨዋታ አራተኛ ለሆነ ምን ይባላል?", "በቅልብልቦሽ ጨዋታ አምስተኛ ለሆነ ምን ይባላል?", "ፍሬደሪክ ዊልሄልም ኒትሸ ማን ነው?", "የኒሽ አቁዋም ምን ነበር?", "ፍሬደሪክ ዊልሄልም ኒትሸ ከመቼ እስከ መቼ ኖረ?", "ፍሬደሪክ ዊልሄልም ኒትሸ በምን የታወቀል?", "የኒትሽ ጹሁፎች በምን ዙርያ ያተኩራሉ?", "በዛብህ የትውልድ ቦታው የት ነው?", "የሰብለ እናት ማን ናቸው?", "የበዛብህ ወላጆች እነማን ናቸው?", "የሰብለ እናት እንዴት ሞቱ?", "በዛብህ ስሙ ለምን በዛብህ ተባለ?", "ፍቅር እስከ መቃብር ደራሲ ማን ነው?", "በዛብህ ዜማና ቅኔ የት ተማረ?", "ፊት አውራሪ መሸሻ እንዴት ሞቱ?", "በዛብህ እንዴት ሞተ?", "ፍቅር እስከ መቃብር በደራሲ ሀዲስ አለማየሁ መቼ ቀረበ?", "በዛብህ ለምን የትውልድ ቦታውን ጥሎ ሄደ?", "በዛብህ በደብረ ወርቅ ሳለ በማን ቤት ተጠግቶ ኖረ?", "ለበዛብህ የወላጆቹን ሞት ማን ነገረው?", "በዛብህ በአዲስ አበባ ሳለ በየት ቤተ ክርስቲያን ተቀጥሮ ሰራ?", "ሰብለን ለሞት ያደረሳት በሽታ ምን ነበር?", "የፍቅር እስከ መቃብር የታሪኩ ይዘት ምን አይነት ነው?", "የፍቅር እስከ መቃብር ድርሰት ከሌሎቹ ከዶ/ር ሀዲስ አለማየሁ ድርሰቶች በምን ይለያል?", "በዛብህ በማን እርዳታ ወደ አዲስ አበባ መጣ?", "በዛብህ ለምን ወደ ዲማ ተመለሰ?", "የሰብለ አጎት ማን ናቸው?", "ሰብለ ወንጌል በየት አረፈች?", "አጼ ልብነ ድንግል የራሱንና የሰብለ ወንጌልን ምስሎች ወደ የት ላከው?", "ሰብለ ወንጌል መቼ አረፈች?", "ሆ ቺ ሚን የፈረንሳይ ሶሻሊስት ፓርቲን መቼ ተቀላቀለ?", "ሆ ቺ ሚን የኢንዶቻይና ኮሚኒስት ፓርቲን መቼ መሰረተ?", "ሆ ቺ ሚን ትግሉን ለማሸነፍ ምን አይነት መንገድ ተጠቀመ?", "በቬትናም በህዝቡ ትግል ፈረንሳዮች ሲወጡ በእነርሱ እግር የመጡት እነማን ናቸው?", "በቬትናም በህዝቡ ትግል ፈረንሳዮች ሲወጡ በእነርሱ እግር የመጡት የአሜሪካ ኢምፔሪያሊዝም ከመቼ ጅምሮ ነው?", "ሆ ቺ ሚን ማን ነው?", "አለቃ ገብረሃና ገብረማሪያም የሕይወት ዘመናቸው ከመቼ እስከ መቼ ነው?", "አለቃ ገብረሃና ገብረማሪያም አባታቸው ማን ናቸው?", "አለቃ ገብረሃና ገብረማሪያም እናታቸው ማን ናቸው?", "አለቃ ገብረሃና ገብረማሪያም መቼ ተወለዱ?", "አለቃ ገብረሃና ገብረማሪያም የት ተወለዱ?", "አለቃ ገብረሃና ገብረማሪያም ለከፍተኛ የቤተክርስቲያን ትምህርት ወዴት ተላኩ?", "ገብረሃና ገብረማሪያም የአለቅነት ማዕረጋቸውን እንዴት አገኙ?", "አለቃ ገብረሃና ገብረማሪያም አዲሱን ዓይነት የቤተክርስቲያን አቋቋም ምን ብለው ሰየሙት?", "አለቃ ገብረሃና ገብረማሪያም በ1890ዓ.ም ከማን ጋር ነው ፎቶ የተነሱት?", "የዲጂታል ዑደት ምንድን ነው?", "የዲጂታል ዑደት ከአናሎግ የኤሌክትሪክ ዑደት ምን ይለየዋል?", "የጨኖ አማካይ ክብደት ስንት ነው?", "ግራጫ ቢጤ የሆነ፣ ፈርጠም ያለ፣ ከደቡብ ምዕራብ ኢትዮጵያ እስከ ደቡብ አፍሪቃ፣ በተጨማሪም በኮንጎ ደኖች የሚገኝ ዝንጀሮ ምን ይባላል?", " የደን ዝንጀሮች በአብዛኛው በየት አካባቢ ይኖራሉ?", "ጨኖዎች በተራራማ ሥፍራዎች በምን ያህል ከፍታ ላይ ይገኛሉ?", "ጨኖዎች ከወለዱ በኃላ ለቀጣይ እርግዝና ምን ለያህል ጊዜ መቆየት አለባቸው?", "የአንድ ሕይወት ያለው ማህብረሰብ የዘር ውርስ ባህሪይ ከትውልድ ወደትውልድ እየተቀየረ መሄድ ምን ይባላል?", "ዝግመተ ለውጥን ለመጀመርያ ጊዜ በሳይንሳዊ መልኩ የተነተነው ማነው?", "ማህበረሰባዊ ጄኔትክስ እሚባለው የምን ጥናት ውህድ ነው?", "ማህበረሰባዊ ጄኔትክስ መቼ ተመሰረተ?", "የአዋሽ ብሔራዊ መዝናኛ እና የዱር አራዊት ጥበቃ ክልል አሁን ያለው የቆዳ ስፋት ስንት ነው?", "በአዋሽ ብሔራዊ መዝናኛ እና የዱር አራዊት ጥበቃ ክልል የሚገኘው ተራራ ስም ማነው?", "የመጀመሪያው ብሔራዊ የዱር አራዊት ጥበቃ ባለ-ሥጣን ከተመሠረተ በኋላ የተደረገው የመጀመርያ ስራ ምንድን ነበር?", "የአገሪቱን የዱር አራዊት ኃብት መጠን ለማረጋገጥ የተመረጠው ሰው የምን ሃገር ዜጋ ነበር?", "በክልሉ ስድስቱ በኢትዮጵያ ውስጥ ብቻ የሚገኙት የወፍ ዝርያዎች ስማቸውን ጥቀስ?", "ዋሻ ውስጥ የሚገኘው ቤተክርስቲያን በማን እና መቼ ተሰራ?", "ዋሻው በምን አይነት ጉዞ ነው ከላሊበላ 6 ሰአት የሚፈጀው?", "ዓፄ ይምርሃነ ክርስቶስ ከየት ሆኖ ነበር አገሩን ያስተዳድር የነበረው?", "ይህን ቤተክርቲያን በ16ኛው ክፍለዘመን መግቢያ ላይ የጎበኘው ሰው ስሙ ማን ነው?", "ፍራንሲስኮ አልቫሬዝ በዚህ ቤተክርቲያን ውስጥ አይኖሩበትም ያለው ማንን ነው?", "የታሪክ ማስታወሻ የተሰኘው መፅሀፍ በማን ተፃፈ?", "የጥንታዊት ኢትዮጵያ ጀግኖች አርበኞች ማኅበር ለመጀመሪያ ጊዜ ማህበሩን የመሰረቱት መሥራቾች ስንት ነበሩ?", "የጥንታዊት ኢትዮጵያ ጀግኖች አርበኞች ማኅበር የተሻሻለው ሁለተኛ ስም ማን ነው?", "የጥንታዊት ኢትዮጵያ ጀግኖች አርበኞች ማኅበር የተዘጋበት ምክንያት ምንድን ነው?", "አቡነ ባስልዮስ በ14 አመታቸው በደብረ ሊባኖስ ገዳም ያስተማሯቸው መምህር ማን ነበሩ?", "አቡነ ባስልዮስ የህይወት ዘመናቸው ከስንት አስከ ስንት ነበር?", "ፋሺስት ኢትዮጵያን በወረረበት ጊዜ አቡነ ባስልዮስ ምን ደረጃ ላይ ነበሩ?", "አቡነ ባስልዮስ በመጀመርያ የምን ቤተክርስቲያን አስተዳዳሪ ነበሩ?", "ንጉሰ ነገስቱ በስደት የት ሃገር ነበሩ?", "ብርሃንና ሰላም ማተሚያ ቤት መቼ ስራ ጀመረ?", "ጥንታዊ ኢትዮጰያውያን ሊቃውንት መጻሕፍት የሚጻፈው እንዴት ነበር?", "በኢትዮጵያ የዘመናዊ ሕትመት ሥራ በማን ዘመን ተጀመረ?", "የብርሃንና ሰላም ማተሚያ ቤትም የምሥረታው ዋና ዓላማ ምንድ ነው?", "የመጀመሪያውን የሸክላ ማጫዋች ለአፄ ሚኒልክ ያመጡላቸው እነማን ናቸው?", "የመጀመሪያውን የሸክላ ማጫዋች ሄንሪ ደ አርሊንስ እና ኒኮላስ ሊዋንቲቭ ለአፄ ሚኒልክ ያመጡላቸው መቼ ነበር?", "ኢትዮጵያ ውስጥ ለመጀመሪያ ጊዜ ድምፃቸው በዲስክ የተቀረፁት እነማን ናቸው?", "በኢትዮጵያ የሙዚቃ ታሪክ በሸክላ የተቀረፀው የመጀመሪያው ሙዚቀኛ ዜማ የማን ነበር?", "አንኮበር ከተማ በማን ተቆረቆረች?", "አንኮበር ከተማ መቼ ተቆረቆረች?", "አንኮበር ከተማን ያስፋፋት ማነው?", "አንኮበር ከተማ ከደብረ ብርሃን በምን ያህል ርቀት ላይ ትገኛለች ?", "ጋሊልዮ መቼ ተወለደ?", "ጋሊልዮ በስንት ዓ.ም ሞተ?", "ጋሊልዮ ምን ዓይነት ስራን በመስራት ታዋቂ ሊሆን ቻለ?", "የጋሊልዮ ሁሉም ክብደት ያላቸው ነገሮች በእኩል ሰዓት መሬት ይደርሳሉ የሚለው አስተሳሰብ ያረጋገጠው ማነው?", "በካቶሊክ ቤተክርስቲያን ጋሊልዮ ለእስር ያበቃው ምን ነበር?", "የጋሊልዮ ጥናት ትክክለኛ እንደነበር በማመን የካቶሊክ ቤተክርስቲያንን ወክለው ስለደረሰበት ግፍ ይቅርታ የጠየቁት ማናቸው?", "የሮማው ፓፓ ጆን ፓውል 2ኛ የጋሊልዮ ጥናት ትክክለኛ እንደነበር በማመን የካቶሊክ ቤተክርስቲያንን ወክለው ስለደረሰበት ግፍ ይቅርታ የጠየቁት ከስንት ዓመት በኋላ ነበር?", "የሮማው ፓፓ ጆን ፓውል 2ኛ የጋሊልዮ ጥናት ትክክለኛ እንደነበር በማመን ማንን ወክለው ነው ስለደረሰበት ግፍ ይቅርታ የጠየቁት?", "ለመጀመሪያ ጊዜ ጨረቃ ላይ ያረፈው ሰው ሰራሽ ነገር መቼ ነበር?", "ለመጀመሪያ ጊዜ ጨረቃ ላይ ያረፈው ሰው ሰራሽ ነገር የማን ሀገር ነበር?", "ለመጀመሪያ ጊዜ የሰው ልጅ እራሱ ጨረቃ ላይ የወጣው መቼ ነው?", "የሰው ልጅ ለመጀመሪያ ጊዜ ጨረቃ ላይ የወጣው በምን መንኮራኩር ተጠቅሞ ነበር?", "የጨረቃን ምድር የመጨረሻው የረገጠው ሰው ማን ነው?", "በአንኮበር ምን ዓይነት ስራዎች በብዛት ይሰሩ ነበር?", "ፓራላሎግራም ምንድነው?", "ፓራላሎግራም በውስጡ ምን ምን ይዟል?", "የአራት ማዕዘን ዉስጣዊ ማዕዘኖች ድምር ስንት ዲግሪ ይሆናል?", "ፓራሎግራም ሆኖ ተነካኪ ጎኖቹ እኩል ያልሆኑና ማዕዘኖቹ ኦብሊክ የሆኑ አራት መአዘን ምን ይባላል?", "አፄ ይስሐቅ የዙፋን ስማቸው ማን ይባላል?", "የቀዳማዊ አጼ ዳዊት ሁለተኛ ወንድ ልጅ እና የቀዳማዊ ቴዎድሮስ ታናሽ ወንድም ማን ናቸው?", "አፄ ይስሐቅ በኮሶጌ ያሰሩት ቤተክርስቲያን ምን ይባላል?", "አፄ ይስሐቅ ያሰሩት ደብረ ይሥሓቅ የሚባለው ቤተክርስቲያን በየት ተሰራ?", "ለመጀመሪያ ጊዜ ሰዎችን ከመሬት ወደ ጨረቃ ለማጓጓዝ የተዘጋጀው አፓሎ 11 መንኮራኩር የሰራው የጠፈር ምርምር ጣቢያ ማን ይባላል?", "ናሳ ለመጀመሪያ ጊዜ ሰዎችን ከመሬት ወደ ጨረቃ ለማጓጓዝ ያዘጋጀው መንኮራኩር ምን ይባላል?", "ሀምሌ 16/1961 አፓሎ 11 ከመሬት ሲመነጠቅ በውስጡ ስንት ጠፈርተኞችን ይዞ ነበር?", "ሀምሌ 16/1961 አፓሎ 11 ከመሬት ሲመነጠቅ በውስጡ የያዛቸው ጠፈርተኞችን እነማን ነበሩ?", "የጨረቃን ምድር በእግራቸው ለመርገጥ የመጀመሪያዎቹ ሰዎች እነማን ናቸው?", "የአፓሎ 11 ሚሲዮን ወደ ጠፈርይዞ የተጓው ሮኬት ማን ይባላል?", "የሳተርን ሮኬት አፖሎ 11 ሚሲዮንን ይዞ ጉዞ የጀመረበት ጠፈር ማእከል ማን ይባላል?", "የሳተርን ሮኬት አፖሎ 11 ሚሲዮንን ይዞ ከምን ያህል ጊዜ በኋላ ጨረቃ ላይ ደረሰ?", "ሳምሱ-ዲታና የማን ልጅ እና ወራሽ ነበር?", "የሃሙራቢ ሥርወ መንግሥት መጨረሻ ንጉሥ ማን ነበር?", "በአንድ የታሪክ ፅላት የተቀረፀው ከሳምሱ-ዲታና ጋር የታገለው ስርወ መንግስት ማን ይባላል?", "ሳምሱ-ዲታናም እንደ ተገደለ የመሰለው መቼ ነበር?", "የሃሙራቢ አባት ማን ይባላል?", "የሃሙራቢ ወራሽ ከሆነ በኃላ በሜስፓጦምያ በጦርነት የትኛውን መንግስት አስፍፍ?", "ሃሙራቢ እንደ ሕግ ሰጪ ንጉስ ዝነኛ ስለሚሆን ምስሉ በየት ሀገር መንግስት ቤቶች እስከ ዛሬ ይታያል?", "ክርስታል ሬዴዎች አንቴናቸው እና ከፍታቸው በያንስ ስንት መሆን አለበት?", "የኋንግ ዲ ሚስት ማን ትባላለች?", "ኋንግ ዲ የተወለደው በየት ስፍራ ነው?", "ስለ ኋንግ ዲ የሚነገረው ትውፊት ምንድን ነው?", "ኋንግ ዲ በይፋ የቻይና ንጉስነት ማዕረግ የወሰደው ስንት ውጊያዎችን ካሸነፈ በኋላ ነበር?", "ኋንግ ዲ ከዋና ሚስቱ በተጨማሪ የነበሩት 3 ሚስቶች እነማን ናቸው?", "ማርክሲስም-ሌኒኒስም በተለይ በካርል ማርክስና በቭላዲሚር ሌኒን ትምህርት የተመሠረተ ፖለቲካዊ ርዕዮተ ዓለም ምን ይባላል ?", "የሂና ተክል ቁመቱ ምን ያህል ነው?", "የቁጥሮችን ቅልቅል ውጤት የሚያጠና ሲሆን ብዙ ጊዜ ቁጥሮች ሲደመሩ፣ ሲቀነሱ፣ ሲባዙና ሲካፈሉ የሚያሳዩትን ባህርይ የሚመረምር ምን ይባላል?", "ቁጥርን መጻፍ የጀመሩት እነማን ናቸው?", "የሒሳብና የሥነ ቁጥር እድገት በስንተኛው ክፍለ ዘመን በጣም አደገ?", "አሁን በመላው አለም የሚሰራበት ቁጥር ምን ይባላል?", "ቦሌ ዓለም አቀፍ የአውሮፕላን ማረፊያ ከምን ቦታ በስምንት ኪሎሜትር ርቀት ላይ ይገኛል?", "አውሮፕላን ወደ ኢትዮጵያ መግባት የጀመሩት በማን ዘመን ነበር?", "የመጀመሪያው ቋሚ የአውሮፕላን ጣቢያ የተሠራው የት ነው?", "የመጀመሪያው ቋሚ የአውሮፕላን ጣቢያ የተሠራው ስያሜ ምን ነበር?", "በፋሺስት ወረራ ዘመን በአገር ውስጥ እና ከአገር ውጭ የበረራ መሥመር የነበረው ኩባንያ ምን ነበር?", "ከጣልያን ድል ወዲህ ልደታ አውሮፕላን ጣቢያን እነማን ይገለገሉበት ነበር?", "የኢትዮጵያ አየር መንገድ መቼ ተመሰረተ?", "የአዲስ አበባ አየር ጣቢያ ዝርዝር ጥናት እንዲያዘጋጅ የተመረጠው ድርጅት ማን ነው?", "የቦሌ ዓለም አቀፍ የአውሮፕላን ማረፊያ የቀድሞ ስም ማን ነበር?", "የቦሌ ዓለም አቀፍ የአውሮፕላን ማረፊያ ግንባታ መቼ ተመረቀ?", "የአበቦቹ ቀለም እንዴት አይነት ነው?", "ጓሳ ምን ያህል ሜትር ድረስ ይደርሳል?", "የአበባ ቅጠሎች ርዝመት ምን ያህል ነው?", "ፓርጦሎን የምን ሃገር ንጉስ ነበር?", "የፓርጦሎን ስም የተጠቀሰበት መጽሃፍ በምን ቋንቋ ነበር የተጻፈው?", "ሂስቶሪያ ብሪቶኑም የብሪታንያውያን ታሪክ መቼ ተጻፈ?", "ፓርጦሎን መጀመርያ ምን ያህል ሠፈረኞችን ይመራ ነበር?", "የኤሌክትሪክ መጠነ እንቅፋት የደረሰበት ሰው ማን ይባላል?", "አንድ ኤሌክትሪክ አካል በውስጡ ሊያልፍ የሚሞክር የኤሌክትሪክ ጅረትን የሚያደናቅፍበት መጠን ልኬት ምን ይባላል?", "ለብዙ ቁሶችና ሁኔታዎች ጸንቶ የሚቆየው ቋሚ ቁጥር ምንድን ነው?", "የአንድ ሽቦ መጠነ እንቅፋት በምን ይወሰናል?", "የአንድ ሽቦ መጠነ እንቅፋት ከርዝመት እና ከስፋት ከማን ጋር በቀጥታ ከማን ጋር በተቃራኒ ይወሰናል?", "የኤሌክትሪክ መጠነ እንቅፋት በምን ይለካል?", "የብረት ማዕድናት በስንት ይከፈላሉ?", "አንድ ትሮይ ስንት ግራም ነው?", "ንፁህ ብር ምን በመባል ይታወቃል?", "ወርቅ የይዘቱ ሚዛን የሚለካው በምንድን ነው?", "በፈረንሳይ አገር ከሚገኘው ከዘመናት በፊት የወርቅና የብር እንዲሁም የተለያዩ የከበሩ ማዕድናት ይሸጥበት ከነበረው ትሮይስ ከተማ ምን የሚለው ስያሜ ተገኘ?", "በጣም ንፁህ የሆነ ወርቅ መጠን ምን ያህል ይሆናል?", "በ1935 የትኛውን ዩንቨርሲቲ ተቀላቀለ?", "የተክዋሜ ንክሩማህ የት ተወለደ?", "የተክዋሜ ንክሩማህ መቼና የት ተወለደ?", "ንክሩማህ የመምህርነት ምስክር ወረቀት መቼ አገኘ?", "የአስዋን ግድብ ግንባታ የተጀመረው መቼ ነው?", "የአስዋን ግድብ ቀዳሚ የግንባታ ሙከራ የተካሄደው በየትኛው ክፍለ ዘመን ነው?", "የአስዋን ግድብ ሙሉ ዲዛይን የተደረገው በእነማን ነበር?", "የጎፋ ብሔረሰብ ቋንቋ ምን በመባል ይጠራል ከየትኛው የ ቋንቋ ቤተሰብ ነው?", "የጎፋ ብሔረሰብ ቋንቋ የምን ቤተሰብ ነው?", "የጎፋ ብሔረሰብ ህዝብ በ1999ዓ.ም በተደረገው የቤት ቆጠራ ምን ያህል ነበሩ?", "የጎፋ ብሔረሰብ ዋና የሃብት መሰረቱ ምንድን ነው?", "የጥንቱ ጎፋ ግዛት ስር የነበሩ ክልሎች እንዴት ይተዳደሩ ነበር?", "በጎፋ ብሔረሰብ ባህላዊ አስተዳደሩ ቁንጮ፣ ከእርሱ ቀጥሎ የሚገኙትን ባለሥልጣናትና አማካሪዎችን የመሾምና የመሻር ሥልጣን ያለው ማነው?", "የጎፋ ብሔረሰብ ለጋብቻ የሚሆን እድሜ ከስንት ጀምሮ ነው?", "በጎፋ ብሔረሰብ ሳታገባ የቆየች ሴት የራሷን ንብረት በመያዝ ወደ ወንዱ ቤት በፈቃዷ ሄዳ በመግባት የሚፈጸም የጋብቻ ዓይነት ምንድን ይባላል?", "በጎፋ ብሔረሰብ ሚስት ከሞተች እህቷ ወይም የቅርብ ዘመዷ በምትክ ሚስትነት የምትሰጥበት የጋብቻ ዓይነት ምን ይባላል?", "የጎፋ ብሔረሰብ ባህላዊ ምግብ ምንድን ነው?", "የኮንታ ብሔረሰብ የአፍ መፍቻ ቋንቋ ምንድን ነው?", "በኮንታ ብሔረሰብ ስንት አይነት ጋብቻ አለ?", "የኮንታ ብሔረሰብ የሙዚቃ መሣሪያዎች ለምን አገልግሎት ይውላሉ?", "የኮንታ ብሔረሰብ ባህላዊ ምግብ ምንድን ነው?", "ለወደፊቱ የሚመጣን ገቢና ወጪ የሚተነብይ የንዋይ ወይም የገንዘብ እቅድ ምን ይባላል?", "አንድ ግለሰብ ዕዳ ውስጥ እየገባ መሆኑን መረዳት ሲጀመር መጀመሪያ ምን ማረግ አለበት?", "ባለ እዳ ግለሰብ የኮንሶሊዴሽንን ወይም የሪፋይናንሲንግን እድሎችን ካላገኘ ሊያገኛቸው የሚችላቸው አማካሪዎች ማን ይባላሉ?", "በኢትዮጵያ የሕግ ባለሙያ እና የአካል ጉዳተኛ መብትቶች ተሟጋች ማን ትባላለች?", "የትነበርሽ ንጉሴ የአይን ብርሃኗን ያጣችው መቼ ነው?", "የትነበርሽ ንጉሴ የመጀመሪያ ደረጃ ትምህርቷን የት ተከታተለች?", "የትነበርሽ ንጉሴ ሁለተኛ ደረጃ ትምህርቷን የት ተከታተለች?", "የትነበርሽ ንጉሴ የመጀመሪያ ዲግሪዋን በምን የትምህርት ዘርፍ ተመረቀች?", "የትነበርሽ ንጉሴ ሁለተኛ ዲግሪዋን በምን የትምህርት ዘርፍ ተመረቀች?", "የትነበርሽ በ2006ዓ.ም የምን ማህበር መሰረተች?", "አዳም ረታ መቼ ተወለደ?", "የአዳም ረታ የመጀመርያ መፅሃፍ ምንድን ነው?", "አዳም ረታ የመጀመሪያ ዲግሪውን በምን ዘርፍ ነበር ያገኘው?", "“እቴሜቴ ሎሚ ሽታ” በተሰኘው መፅሀፍ ላይ ምን አይነት ያጻጻፍ ስልት ተጠቅሟል?", "ለመጀመሪያ ጊዜ መቼቱን ከሀገር ውጭ ያደረገበት መፅሃፍ ምንድን ነው?", "አለቃ ደስታ መቼ ተወለዱ?", "የኢትዮጵያ ዕውቅ የቤተክርስቲያን ሊቅ፣ የመዝገበ ቃላት አዘጋጅና ደራሲ ማን ናቸው?", "አለቃ ደስታ ተክለወልድ በብርሃንና ሰላም ቀዳማዊ ኃይለ ሥላሴ ማተሚያ ቤት በምን ስራ አገልግለዋል?", "አለቃ ደስታ ተክለወልድ በብርሃንና ሰላም ቀዳማዊ ኃይለ ሥላሴ ማተሚያ ቤት ከመቼ እስከ መቼ ሰሩ?", "አለቃ ደስታ የት ተወለዱ?", "አለቃ ደስታ ያረፉት መቼ ነው?", "የእስክንድርያ ማስተማርያ ቤት በየት የሚገኝ ትምህርት ቤት ነበር?", "የእስክንድርያ ማስተማርያ ቤት ከመቼ እስከ መቼ አገልግሎት ሲሰጥ ነበር?", "የእስክንድርያ ማስተማርያ ቤት የምን ትምህርት የሚሰጥበት ተቋም ነበር?", "የእስክንድርያ ሥነ መለኮት ትምህርት ቤት መቼ ተመሰረተ?", "ከ173-182 ዓም በማን መሪነት ነበር ተቋሙ በትምህርቱ ታዋቂ የሆነው?", "በፓንታይኖስ መሪነት ተቋሙ በትምህርቱ ታዋቂ የሆነው መቼ ነበር?", "ፓንታይኖስ ከመጠመቁ በፊት የምን ፍልስፍና ተከታይ ነበር?", "ከፓንታይኖስ በኋላ የእስክንድርያ ትምህርት ተቋሙ ማን መምራት ጀመረ?", "ቀሌምንጦስ ዘእስክንድርያ የእስክንድርያ ትምህርት ተቋምን ከመቼ እስከ መቼ መራ?", "ከቀሌምንጦስ በኋላ ማን ተቋሙን ተረከበ?", "ዳምጠው አየለ መቼ ተወለደ?", "የዳምጠው አየለ ባለቤት ማን ይባላሉ?", "ዳምጠው አየለ ስንት ልጆች አሉዋቸው?", "ዳምጠው አየለ ስንት አልበም ሰርቷል?", "ዳምጠው አየለ ትምህርቱን በየት ትምህርት ቤት ተከታተለ?", "የዳምጠው አየለ ሁለቱ ልጆች ማን ማን ይባላሉ?", "ዳምጠው አየለ በመራቤቴ ሳለ ምን ያደርግ ነበር?", "ዳምጠው አየለ ወደ አዲስ አበባ ይዞት የመጣው ማነው?", "ዳምጠው አየለ ወደ አዲስ አበባ ሲመጣ የትምህርት ደረጃው ስንተኛ ነበር?", "ዳምጠው አየለ ወደ አዲስ አበባ ይዘውት የመጡት ክፍሌ ሞገስ ምኑ ነበሩ?", "ዳምጠው አየለ መነሻ የሆነው ዘፋኝ ማነው?", "ዳምጠው አየለ ምድር ጦር ለምን ያህል ጊዜ አገለገለ?", "ምድር ጦር የሙዚቃ ቡድን መቼ ተመሰረተ መቼስ ፈረሰ?", "ዳምጠው አየለ የመጀመሪያው አልበሙ መቼ ተለቀቀ ምንስ ይሰኝ ነበር?", "ዳምጠው አየለ የመጀመሪያው አልበሙ ምን ይሰኝ ነበር?", "ዳምጠው አየለ የመጀመሪያው ወፌ ላላ የተሰኘ አልበሙ የምን ሥራ ነበር?", "ዳምጠው አየለ ከኢትዮጵያ ውጭ የት አገር ኖሯል?", "ዳምጠው አየለ በስንት ዓመቱ ሞተ?", "ዳምጠው አየለ ህይወቱ መቼ አለፈ ?", "ቅዱስ ላሊበላ ከዚህ ዓለም በስንት ዓመቱ አረፈ?", "የጸጉር መውጫ ቀዳዳዎች ከቆዳ ስር በሚገኙ የወዝ እጢዎች በሚመነጭ ቅባት ወይም ወዝ እና በሞቱ የቆዳ ህዋሳት በብዛት መከማቸትና በቀዳዳው መደፈን የሚፈጠር እባጭ ምን ይባላል?", "ብጉርን ሊያባብስ የሚችል ነገር ምንድን ነው?", "ብጉር በብዛት ሊወጣ የሚችልባቸው ቦታዎች ምን ምን ናቸው?", "የቡጉር መፈጠር ምንን ያስከትላል?", "በ1913 የአሜሪካ ፕሬዝዳንት የነበረው ማን ነው?", "በ1913 የሄርበርት ሁቨር የስራ መስካቸው ምን ነበሩ?", "ሄርበርት ሁቨር በፅሁፍ ፕሬዝዳንት የሆነው መቼ ነው?", "ሄርበርት ሁቨር በይፋ ፕሬዝዳንት የሆነው መቼ ነው?", "ሄርበርት ሁቨርን ተቃርኖ በምርጫ የተወዳደረው ሰው ማን ነው?", "ሄርበርት ሁቨር መቼ ስልጣናቸውን ለቀቁ?", "ሄርበርት ሁቨር መቼ ተመረቀ?", "ሄርበርት ሁቨር በምን ተመረቀ?", "31ኛው የአሜሪካ ፕሬዝዳንት ማን ነበሩ?", "ሄርበርት ሁቨር ከመቼ እስከ መቼ የአሜሪካ ፕሬዝደንት ነበሩ?", "ሄርበርት ሁቨር የሕይወት ዘመናቸው ከመቼ እስከ መቼ ነበር?", "የሄርበርት ሁቨር የትውልድ ቦታው የት ነው?", "ሄርበርት ሁቨር ወላጆች ከሞቱ በኃላ ማን ነው ያሳደገው?", "ሄርበርት ሁቨር በየት ዩንቨርስቲ ተማረ?", "ሄርበርት ሁቨር ምን ያህል አሜሪካውያን ቱሪስቶችና ሠራተኞች ከአውሮፓ ወደ አገራቸው መልሰዋል?", "ሄርበርት ሁቨር አሜሪካውያን ወደ ሀገራቸው እንዲመለሱ ያደረጉት በምን ምክነያት ነው?", "የካሣ የትዳር አጋር ማን ትባላለች?", "ካሳ ስንት ልጆች ወለደ?", "ካሳ እንዴት የጋዘጠኝነት ሙያውን አንድ ብሎ የጀመረው?", "ካሳ በትምህርት ቤቱ ሚኒ ሚዲያ ክለብ ውስጥ አንቢገባ ያደረጉት ማን ናቸው?", "አቡነ አረጋዊ መቼ ተወለዱ?", "የአቡነ አረጋዊ ወላጆች ማን ናቸው?", "አቡነ አረጋዊ መቼ ተሰወሩ?", "አቡነ አረጋዊ በየት አካባቢ ተወለዱ?", "ለአቡነ አረጋዊ ወላጆቻቸው ያወጡላቸው ስም ማን ይባላል?", "አቡነ አረጋዊ ማን ዘንድ ስርዓተ ምንኩስናን ተማሩ?", "አቡነ አረጋዊ በገዳመ ዳውናስ (ግብጽ) የማን ደቀመዝሙር ነበሩ?", "አቡነ አረጋዊ በሮም ምን ያህል የቤተ መንግስት ሰዎች ወደ ምናኔ ማረኩ?", "ዘጠኙ ቅዱሳን መቼ ወደ ኢትዮጵያ መጡ?", "አቡነ አረጋዊ ከብዙ ፍለጋ በኋላ በስተመጨረሻ በየት ተቀመጡ?", "አቡነ አረጋዊ በየት መጽሐፍትን ተረጎሙ?", "አቡነ አረጋዊ እድሜያቸው ስንት ሲሆን ወደ ብሔረ ህያዋን ሄዱ?", "ቅዱስ ባስሊዮስ ዘቄሣርያ የት ተማሩ?", "ቅዱስ ባስሊዮስ ዘቄሣርያ ማን ናቸው?", "ቅዱስ ባስሊዮስ ዘቄሣርያ የትኞቹን የእምነት ተከታዮት ወደ ክርስትና መለሱ?", "ቅዱስ ባስሊዮስ ዘቄሣርያ የትውልድ ስፍራቸው በየት ነው?", "ቅዱስ ባስሊዮስ ዘቄሣርያ መቼ ተወለዱ?", "የቅዱስ ባስሊዮስ ዘቄሣርያ ጋደኛ ማን ናቸው?", "ቅዱስ ባስሊዮስ ዘቄሣርያ ለምን ወደ ቁስጥጥኒያ ሄዱ?", "ቅዱስ ባስሊዮስ ዘቄሣርያ እና ጋደኛው በአቴንስ ለስንት አመት ተቀመጡ?", "አባ ጊዮርጊስ ዘጋስጭ መቼ ተወለዱ?", "አባ ጊዮርጊስ ዘጋስጭ መቼ አረፉ?", "አባ ጊዮርጊስ ዘጋስጭ አባት ማን ናቸው?", "አባ ጊዮርጊስ ዘጋስጭ በስንት ዓመታቸው አረፉ?", "አቡነ ጴጥሮስ መቼ ለግራዚያኒ ቀረቡ?", "ጣሊያን ፋሺስት ዳግም ወደ ኢትዮጵያ መቼ መጣ?", "ብፁዕ አቡነ ጴጥሮስ አልሸሽም ብለው መቼ ለኢጣሊው እንደራሴ ለራስ ኃይሉ እጃቸውን ሰጡ?", "የብፁዕ አቡነ ጴጥሮስ ሐውልት መቼ ተሰራ?", "የብፁዕ አቡነ ጴጥሮስ ሐውልት በማን አሳሳቢነት ተሰራ?", "አረማይክ የምን ቋንቋ ነው?", "አረማይክ ከምን ቋንቋ ቤተሰብ ይመደባል?", "አረማይክ ቋንቋ ይፋዊ ቋንቋ መቼ ተደረገ?", "አረማይክ ቋንቋን ይፋዊ ቋንቋ ያደረገው የአሦር ንጉሥ ማነው?", "ባሕር ዛፍ ወደ ኢትዮጵያ የመጣው ከየት ሀገር ነው?", "በዓለም ላይ ምን ያህል የባሕር ዛፍ ዝርያዎች አሉ?", "ባሕር ዛፍ ወደ ኢትዮጵያ እንዲመጣ ያደረጉት ንጉስ ማን ናቸው?", "አቡነ ቴዎፍሎስ በማን ተገደሉ?", "በኢትዮጵያ ሁለተኛውን ፓትርያርክ ለመሾም በተደረገው ምርጫ አቡነ ቴዎፍሎስ በስንት ድምፅ ተመረጡ?", "የመጀመሪያው ኢትዮጵያዊ ፓትርያርክ ማናቸው?", "አቡነ ቴዎፍሎስ የተገደሉት መቼ ነው?", "የኢትዮጵያ ኦርቶዶክስ ተዋሕዶ ቤተ ክርስቲያን ሁለተኛው ርዕሰ ሊቃነ ጳጳሳት ወፓትርያርክ የነበሩት ማን ናቸው?", "አቡነ ቴዎፍሎስ ንባብ እና ዜማን ከማን ተማሩ?", "አቡነ ቴዎፍሎስ በስንት ዓ.ም ወደ አዲስ አበባ መጡ?", "አቡነ ቴዎፍሎስ የሐረርጌ ጳጳስ ሆነው የተሾሙት መቼ ነው?", "አቡነ ቴዎፍሎስ የሐረርጌ ጳጳስ ሆነው የተሾሙት በማን ነው?", "አቡነ ቴዎፍሎስ የሐረርጌ ጳጳስ ሆነው የተሾሙት የት ነው?", "አለቃ ደስታ ተክለወልድ በድሬዳዋ በአልዓዛር ማተሚያ ቤት ለምን ያህል አመት ሰሩ?", "አለቃ ደስታ ተክለወልድ በድሬደዋ በየትኛው ማተሚያ ቤት ሰሩ?", "አሩሪ አተር ወደ ኢትዮጵያ መቼ ገባ?", "ከአኩሪ አተር ምን ይዘጋጃል?", "አኩሪ አተር በውስጡ ምን ንጥረ ነገሮችን ይዟል?", "በኢትዮጵያ ስንት አይነት የአኩሪ አተር ዝርያ አለ?", "አኩሪ አተር በኢትዮጵያ ውስጥ በብዛት የት ይመረታል?", "አኩሪ አተር በአለም ላይ በብዛት የት ይመረታል?", "ጀስቱን ቢበር በግራሚ ምርጥ የዳንስ ቅጅ በሚባል ፈረጅ ሊሸለም ያረገው ዘፈኑ ምንድን ነው?", "ጀስቲን ቢበር ምን ያህል ቅጅዋችን ሸጧል?", "ጀስቲን ቢበር መቼ ተወለደ?", "ጀስቲን ቢበር ለመጀመሪያ ጊዜ የተመለመለው በማን ነው?", "ጀስቲን ቢበር እውቅናን እንዴት አገኘ?", "ጀስቲን ቢበር ከህዝብ ጋር መቼ ተጋጨ?", "ትራምፕ ለቤቱ ስንተኛ ልጅ ነው?", "የትራምፕ አባትና እናት እነማን ናቸው?", "የዶናልድ ትራምፕ አያቶች ከየት ናቸው?", "ዶናልድ ጆን ትራንፕ መቼ ተወለደ?", "ትራምፕ የት ተወለደ?", "45ኛው የዩናይትድ ስቴትስ ኦፍ አሜሪካ ፕሬዚደንት ማን ነው?", "ትራምፕ የፕሬዝደንትነት ስልጣን ላይ መቼ ወጣ?", "ትራምፕ በኮሌጅ እያለ የት ድርጅት ይሰራ ነበር?", "ዘኦፕሬንተስ የተባለው ፕሮግራም በኤን ቢ ሲ ላይ መቼ ቀረበ?", "ትራምፕ ለመጀመሪያ ጊዜ ለዮናይትድ ስቴትስ ፕሬዘዳንትነት ተወዳዳሪ ለሁለት የሪፎርም ፓርቲ እጩነት ያሸነፈው መቼ ነበር?", "በ2015 ለፕሬዝዳንትነት እንደሚወዳደረ ያሳወቁት የትኛውን የፖለቲካ ፓርቲን በመቀላቀል ነው?", "ትራምፕ በስንት አመቱ ስልጣን ላይ ወጣ?", "በሽታውን እንዴት መከላከል ይቻላል?", "የቪስቶሶሚሲስ በሽታ በምን ሕዋስ አማካኝነት ይተላለፋል?", "የቪስቶሶሚሲስ በሽታ ምን ሊያጠቃ ይችላል?", "የቪስቶሶሚሲስ የህመሙ ምልክት ምንድን ነው?", "የቪስቶሶቶሚሲስ በሽታ ሲቆይ በልጆች ላይ ምን ሊያስከትል ይችላል?", "የቪስቶሶቶሚሲስ በሽታ ሲቆይ በአዋቂዎች ላይ ምን ሊያስከትል ይችላል?", "የቢልሃርዝያ በሽታ እንዴት ይሰራጫል?", "የብልሃርዝያ በሽታ አምጪ ትሎች ከምን ይመነጫሉ?", "ቅዱስ ላሊበላ መቼ ተወለደ?", "ቅዱስ ላሊበላ የት ተወለደ?", "የቅዱስ ላሊበላ ወላጆች እነማን ናቸው?", "ቅዱስ ገብረ ማርያም ንግስናውን ለቅዱስ ላሊበላ በስንት ዓመቱ አስረከበው?", "ቅዱስ ላሊበላ ለምን ያህል ጊዜ ነገሰ?", "እብድ ውሻ ምልክቱ ምንድን ናቸው?", "የእብድ ውሻ በሽታው ምልክት በምን ያህል ጊዜ ይታያል?", "የእብድ ውሻ በሽታ በአለም ደረጃ ምን ያህል ሰዎችን ለሞት እየዳረገ ነው?", "እብድ ውሻ በሽታ የማይገኝበት አህጉር የት ነው?", "በአብዛኛው በአውሮፓ በአውስትራሊያ የእብድ ውሻ በሽታ የሚገኘው በምን ላይ ነው?", "መዓዛ ብሩ ስንት ልጆች አሉዋት?", "መኣዛ ብሩ በኢትዮጵያ ሬድዮ ካበረከተቻቸው አንጋፋ ስራዎች አንዱ የትኛው ነው?", "መዓዛ ብሩ ምን ያህል ጊዜ ከሬድዮ ጋር ተራራቀች?", "መዓዛ ብሩ ለምን ከመቼ እስከ መቼ ባለው ጊዜ ከሬድዮ ጋር ተራራቀች?", "መዓዛ ብሩ የየትኛው ኤፍ ኤም ራድ ጣቢያ ባለቤት ነች?", "መዓዛ ብሩ ሸገር 102.1 ኤፍ ኤም ራድዮ ጣብያን መቼ አቋቋመች?", "መዓዛ ብሩ የት ተወለደች?", "መዓዛ ብሩ በስንት ዓመተ ምህረት ተወለደች?", "መዓዛ ብሩ ከአንደኛ እስከ ሦስተኛ ክፍል ድረስ የት ተማረች?", "መዓዛ በቅድስት ማርያም ትምህርት ቤት እስከ ስንተኛ ክፍል ተማረች?", "መዓዛ ብሩ ወደ ከፍተኛ የትምህርት ተቋም መቼ ገባች?", "መዓዛ ብሩ የከፍተኛ ትምህርቷን የት ተማረች?", "መዓዛ ብሩ በአዲስ አበባ ዩኒቨርሲቲ በምን ትምህርት ዘርፍ ተመደበች?", "መዓዛ ብሩ በማን አማካኝነት ወደ ኢትዮጵያ ሬድዮ ልትገባ ቻለች?", "መዓዛ ብሩ ከአዲስ አበባ ዩኒቨርሲቲ መቼ ተመረቀች?", "አዞዎች በምን መልክ ይራባሉ?", "አዞዎች ለምን አምፌቢያን ይባላሉ?", "አዞዎች በምን ይተነፍሳሉ?", "አዞዎች ሲፈለፈሉ ምን ያህል ርዝመት ይኖራቸዋል?", "የአዞ አይን ምን ያህል ዲግሪ ማየት ይችላሉ?", "የ2014 እ.ኤ.አ ፊፋ የዓለም ዋንጫ አዘጋጅ ሀገር ማን ነበረች?", "በዓለም ዋንጫ ታሪክ ለመጀመሪያ ጊዜ የጉል ላይን ቴክኖሎጂ በጥቅም ላይ የዋለው መቼ ነው?", "ብራዚል በ2014 የፊፋ ዓለም ዋንጫ ስታዘጋጅ ስንተኛዋ ነበር", "ከ1930 ጀምሮ በተደረገው የዓለም ዋንጫ ላይ ሻምፒዮን የነበሩት ሀገራት እነማን ናቸው?", "፳ኛው የፊፋ የዓለም ዋንጫ በየት ሀገር ይዘጋጃል?", "ብራዚል ፳ኛው የፊፋ የዓለም ዋንጫ ያዘጋጀችው በስንት ዓመተ ምህረት ነው?", "የ2014 እ.ኤ.አ. የፊፋ የዓለም ዋንጫ ስንተኛው ነው?", "፳ኛው የፊፋ የዓለም ዋንጫ በብራዚል በስንት ከተሞች ይካሄዳል ይዘጋጃል?", "በብራዚል በተካሄደው በ2014ቱ ፳ኛው የፊፋ የዓለም ዋንጫ በአጠቃላይ ስንት ጨዋታዎች ይደረጋሉ?", "በብራዚል ለተካሄደው ለ2014ቱ ፳ኛው የፊፋ የዓለም ዋንጫ ስንቱ ስቴድየሞች አዲስ የተገነቡ ናቸው?", "ዝናሽ ማሞ ማን ናት?", "ዝናሽ ማሞ መቼ ተወለደች?", "ዝናሽ ማሞ የት ተወለደች?", "የዝናሽ ማሞ እድገቱዋ የት ነው?", "ዝናሽ ማሞ በኢትዮጵያ ሬድዮ መቼ መስራት ጀመረች?", "ዝናሽ ማሞ በኢትዮጵያ ሬድዮ ለስንት አመታት አገለገለች?", "የዝናሽ እናት እና አባት ማን ይባላሉ?", "የትነበርሽ ንጉሴ በ2017 ምን ተሸለመች?", "የትነበርሽ ንጉሴ በኢትዮጵያ የዓይነ ስውራን የሴቶች ክንፍ ማህበር ውስጥ ለስንት አመት ሰራች?", "ካሣ አያሌው የልደት ቀኑ መቼ ነው?", "የአቶ ካሣ ወላጆች ማን ናቸው?", "ካሣ አያሌው የትና መቼ ተወለደ?", "የኢትዮጵያ ቴሌቪዥን መቼ ተከፈተ?", "የኢትዮጵያ ቴሌቪዥን ውስጥ የመጀመሪያ ሴት የነበሩት ማን ናቸው?", "ወ/ሮ እሌኒ በየትኛው የበጎ አድራጎት ድርጅት ውስጥ ትልቅ ስራን ሰርተዋል?", "ወ/ሮ እሌኒ ጡረታ ከወጡ በኋላ ምን በማድረግ ጊዜቸውን ያሳልፉ ነበር?", "ወ/ሮ እሌኒ የትዳር አጋራቸው ማን ናቸው?", "ወ/ሮ እሌኒ ከትዳር አጋራቸው ጋር መቼ ትዳር መሰረቱ?", "የወ/ሮ እሌኒ ስርአተ ቀብርራቸው መቼ ተፈፀመ?", "የወ/ሮ እሌኒ ስርአተ ቀብርራቸው በየት ተፈፀመ?", "ወ/ሮ እሌኒ በስንት አመታቸው አረፉ?", "የወ/ሮ እሌኒ አያት ማን ናቸው?", "ወ/ሮ እሌኒ መቼ ተወለዱ?", "ወ/ሮ እሌኒ እድገታቸው በየት ነው?", "ወ/ሮ እሌኒ አንደኛና ሁለተኛ ደረጃ ትምህርታቸውን በየት ተከታተሉ?", "ወ/ሮ እሌኒ ከማህበራዊ ሳይንስ ዘርፍ በየት የነፃ የትምህርት እድል ደረሳቸው?", "ወ/ሮ እሌኒ በየት ድርጅት የመጀመሪያ ስራ ተቀጠሩ?", "የወ/ሮ እሌኒ የስራ አጋር የነበሩት ማን ናቸው?", "የዩኔስኮ አካል በይነ መንግስታዊ ኮሚቴ 10ኛ ስብሰባውን በየት ተደረገ?", "የዩኔስኮ አካል በይነ መንግስታዊው ኮሚቴ 10ኛ ስብሰባውን መቼ አደረገ?", "በዚህ ስብሰባ ላይ ስንት ባህላዊ ቅርሶች ለውሳኔ ቀረቡ?", "በኢትዮጵ ሁለተኛ የማይዳሰስ ዓለም አቀፍ የሰው ልጆች ወካይ ቅርስ ሆኖ የተመዘገበበው ባህላዊ ቅርስ የትኛው ነው?", "የተመዘገበበት የፋየል እና የውሳኔ ቁጥር ስንት ነው?", "የመስቀል በዓል በዩኔስኮ መቼና በየት ተመዘገበ?", "የመስቀል በዓል የተመዘገበው ስንተኛ ዙር ስብሰባ ላይ ነበር?", "የሲዳማ ብሔር የዘመን መለወጫ በዓል የሆነው ፍቼ ጨምበላላ ለማስመዝገብ የተሰራው ጥንታዊ ሰነድ መቼ ወደ ዩኔስኮ ተላከ?", "የገዳ ስርአት በዩኔስኮ ለማስመዝገብ ጥናታዊ ሰነድ መቼ ተላከ?", "አባ ጊዮርጊስ ዘጋስጭ በየት ተማሩ?", "አባ ጊዮርጊስ ዘጋስጭ በየት መነኮሱ?", "አባ ጊዮርጊስ ዘጋስጭ የስንቱ የዓፄ ዳዊት ልጆችን መምህር ነበሩ?", "ቅዱስ ባስሊዮስ ዘቄሣርያ የምንኩስናን ትምህርት ለመማር ወደ የትኞቹ ሀገራት ሄደዋል?", "ቅዱስ ባስሊዮስ ዘቄሣርያ የቁንስጥጢናውን የሊቃውንት ጉባኤ መቼ ተሳተፉ?", "አባ ፍሬምናጦስ ወንድም ማን ናቸው?", "አባ ፍሬምናጦስ በሮማ የት አካባቢ ተወለዱ?", "አባ ፍሬምናጦስ ማን የተባለው ነጋዴ ጋር ወደ ኢትዮጵያ መጡ?", "አባ ፍሬምናጦስ የስንት ዓመት እድሜ እያሉ ወደ ኢትዮጵያ መጡ?", "ብጫ ሱማራ ፊልም መቼ ተሰራ?", "ዘ ቢተልስ ሙዚቃ ቡድን የሠሩት ዝንኛና ተወዳጅነት ያገኘ የልጆች ካርቶን ፊልም ምን ይባላል?", "ኑኒስ ለ52 አመት የነገሰው በየትኞቹ ወገን ነው?", "ኑኒስ በእነማን እርዳታ ነው ምዕራብ እስያን ማሸነፍ የቻለው?", "ኑኒስ ማን ነው?", "የኑኒስ ሚስት ማን ትባላለች?", "ኑኒስ ለስንት አመት ነገሰ?", "የጮቄ ወረዳ በምን ይታወቃል?", "የጮቄ ተራራ ስሙ ምን ይባላል?", "በቢቡኝ ወረዳ ውስጥ ከሚገኙ የተፈጥሮ የቱሪስት መስህብ ሃብቶች መካከል አንዱ ማነው?", "የጮቄ ወረዳ ከባህር ዳር ከተማ ምን ያህል ይርቃል?", "የጮቄ ወረዳ ተፋሰሶች ለአባይ ወንዝ ምን ያህል ድርሻ አላቸው?", "በጮቄ ወረዳ ምን ያህል የአባይ ገባሮች እና የውሃ ጅረቶች ይገኙበታል?", "የጮቄ ተራራ ከባህር ወለል በምን ያህል ከፍታ ላይ ይገኛል?", "የጮቄ ተራራ ጠቅላላ ስፋቱ ስንት ነው?", "ኤዎስጣጤዎስ ማን ናቸው?", "የኤዎስጣጤዎስ ወላጆች ማን ይባላሉ?", "ኤዎስጣጤዎስ መቼ ተወለዱ?", "ኤዎስጣጤዎስ ማን ተቃወማቸው?", "ኤዎስጣጤዎስ ያረፉት በየት ነው?", "ኤዎስጣጤዎስ አጥብቀው የሚያስተምሩት ትምህርት ምንድን ነው?", "የኤዎስጣጤዎስ የመጀመሪያ ስማቸው ማን ነው?", "የኤዎስጣጤዎስ ተከታዩች እነማን ናቸው?", "FYBA መቼ ተቋቋመ?", "የቅርጫት ኳስ ጨዋታ በአምስት ተጨዋቾች እንዲሆኑ መቼ ተወሰነ?", "የመጀመሪያው የባስኬት ቦል ውድድር መቼ ተጀመረ?", "የመጀመሪያው የባስኬት ቦል ውድድር በየት በሚገኝ ጂምናዝየም ተጀመረ?", "ለመጀመሪያ ጊዜ የባስኬት ቦልን የተጫወቱት ማን ናቸው?", "ለባስኬት ቦል መጫወቻ ተብሎ የተዘጋጀው የመጀመሪያ ኳስ ቀለሙ ምን አይነት ነው?", "የሴቶች ባስኬት ቦል ውድድር የተጀመረው የት ነው?", "የመጀመሪያው የሴቶች ባስኬት ውድድር መቼ ተጀመረ?", "አብርሃም ሊንክን መች ተወለዱ?", "አብርሃም ሊንከን መቼ ሞተ?", "የአብርሃም ሊንከን ሚስት ማናት?", "አብርሃም ሊንከንን ማን ገደላቸው?", "የአብርሃም ሊንከን አባት ስራቸውስ ምን ነበር?", "አብርሃም ሊንከን  ስንት ልጆች ነበሩዋቸው?", "አብርሃም ሊንከን ከመቼ ጀምሮ ወደ ስልጣን መጡ?", "አብርሃም ሊንከን ስንተኛው የአሜሪካ ፕሬዝዳንት ነበሩ?", "አብርሃም ሊንክን እንዴት ነው የሞተው?", "የአብርሃም ሊንከን የስራ ዘርፋቸው ምን ነበር?", "አብርሃም ሊንከን በ፲፰፻፳፮ ዓ.ም. ለየትኛው ክፍለ ሀገር ምክር ቤት መቀመጫ ተመረጡ?", "አብርሃም ሊንከን ባርነትን መቃወም የጀመሩት መቼ ነው?", "አብርሃም ሊንከን ለመጀመሪያ ጊዜ ለፕሬዝዳንታዊ ምርጫ ዕጩ የሆኑት መቼ ነው?", "አብርሃም ሊንከን የባርነት ተቋዋሚዋች ሪፐብሊካን ፓርቲን መቼ መሰረቱ?", "አብርሃም ሊንከን ሜሪ ቶድን መቼ አገቡ?", "አብርሃም ሊንከን ሁለተኛውን ፕሬዝዳንታዊ ምርጫ መቼ አሸንፉ?", "የህንዳውያን የወታደሮችና የገዢዎች ክፍል ምን ተብሎ ይጠራል?", "የጋሞ ጎፋ ዞን ዋና ከተማ ማናት?", "አርባ ምንጭ የየትኛው ዞን ዋና ከተማ ናት?", "በጋሞ ብሔረሰብ የክብርና የማዕረግ ልብስ የሚባለው የትኛው ነው?", "የከተማዋ የሙቀት መጠን ምን ያህል ነው?", "ከተማዋ በምን ያህል የባህር ወለል ከፍታ ላይ ትገኛለች?", "የከተማዋ የአየር ንብረት ምን አይነት ነው?", "የከተማዋ የዝናብ መጠን በአማካኝ ምን ያህል ነው?", "ከተማዋ ከፍተኛ የዝናብ መጠን የምታገኘው በየትኞቹ ወራት ነው?", "በአርባ ምንች የሚገኘው ብሔራዊ ፓርክ የትኛው ነው ?", "የቅርጫት ኳስ ጨዋታ ማን ፈጠረው?", "የቅርጫት ኳስ ጨዋታ መቼ ተፈጠረ?", "የቅርጫት ኳስ ጨዋታ የተፈጠረው ምናዊ ዜግነት ባለው ሰው ነው?", "የቅርጫት ኳስ ጨዋታ በየት ሀገር ተፈጠረ?", "ኮሎኔል ሣህሌ ደጋጎ መቼ ተወለዱ? ", "ኮሎኔል ሣህሌ ደጋጎ የት ተወለዱ?", "ኮሎኔል ሣህሌ ደጋጎ ከወላጆቻቸው ከእነማን ተወለዱ?", "ኮሎኔል ሣህሌ ደጋጎ ትምህርታቸውን በየት ተከታተሉ?", "ኮሎኔል ሣህሌ ደጋጎ በ1942 ዓ/ም የት ተቀጠሩ?", "ኮሎኔል ሣህሌ ደጋጎ የሙዚቃን ትምህርትን ያስተማራቸው ማነው ?", "ኮሎኔል ሣህሌ ደጋጎ የትኞቹን የሙዚቃ መሣሪያዎችንም በብቃት ይጫወቱ ነበር?", "ኮሎኔል ሣህሌ ደጋጎ በነበራቸው ብቃት ከተራ ወታደርነት ወደ የትኛው ማዕረግ አደጉ?", "ኮሎኔር ሣህሌ ደጋጎ በእግር ባንድ የትኛውን የሙዚቃ መሳሪያ ይጫወቱ ነበር?", "ኮሎኔል ሣህሌ ደጋጎ በየትኛው የሙዚቃ ዘርፎች ይሰሩ ነብር?", "ሣህሌ ደጋጎ የአኮርዲዮን ጥዑም ዜማ ለጣቢያው አድማጮች የሚያንቆረቁሩት በየትኛው የራዲዮ ጣቢያ ነው?", "ሣህሌ ደጋጎ በክቡር ዘበኛ ኦርኬስትራ እፁብ ድንቅ በማድረግ የበኩላቸውን ሚና የተጫውቱት ከነማን ጋር ነው?", "ጎንደር ከተማ በምን ትታወቃለች?", "ጎንደር ከተማ የኢትዮጵያ ዋና ከተማ የሆነችው መቼ ነው?", "በ1637 አፄ ፋሲል ላይ ያመፁት ማን ናቸው?", "መልክዓ ክርስቶስ በአፄ ፋሲል ላይ ያመፁት መቼ ነው?", "አፄ ፋሲል ልጃቸውን ዳዊትን መቼ ወደ ግዞት ቤት ወሰዱት?", "አፄ ፋሲል በ1664-5 ማን የተባለው የህንድ ንጉስ ሲነግስ መልካም ምኞታቸውን ገለጹ?", "የኢትዮጵያ ነገስታት ተፎካካሪያቸውን ወደ የትኛው ግዞት ቤት እንዲሄዱ ነበር የሚያደርጉት?", "የኒሽ አቁዋም ምን ነበር?", "ማርኮ ፖሎ የምን ሀገር ዜጋ ነው?", "ማርኮ ፖሎ የእድሜ ዘመኑ ከመቼ እስከ መቼ ነበር?", "ማርኮ ፖል በስንት ዓመቱ ነበር ከጣልያን ቬኒስ ከተማ ተነስቶ ጉዞ የጀመረው?", "ወደ ሞንጎሊያና ቻይና ከተጓዙ አውሮፓውያን ቀደምት የሆነው ማነው?", "ማርኮ ፖል በ17 ዓመቱ ከጣልያን ቬኒስ ከተማ ተነስቶ ወዴት ሄደ?", "ማርኮ ፖሎ በኩብላ ካህን ቤተመንግስት ሥልጣን ተሰጥቶት ስንት ዓመት ቆየ?", "ኢትዮጵያ ውስጥ ያሉ የባህል ሙዚቃ መሳሪያዎች ስንት መደብ አላቸው?", "ኢትዮጵያ ውስጥ ያሉ የባህል ሙዚቃ መሳሪያዎች መደቦች ምን ምን ናቸው?", "የክር ሙዚቃ መሳሪያዎች ድምፅ የሚሰጡት እንዴት ነው?", "ብላታ መርስዔ ኀዘን ወልደ ቂርቆስ የት ተወለዱ?", "ብላታ መርስዔ ኀዘን ወልደ ቂርቆስ መቼ ተወለዱ?", "ብላታ መርስዔ ኀዘን ወልደ ቂርቆስ የመጀመሪያ ሥራቸውን በስንት ዓመታቸው ጀመሩ?", "ባቢሌ የዝሆኖች መጠለያ መቼ ተመሰረተ?", "ባቢሌ የዝሆኖች መጠለያን የሚካፈሉት ክልሎች እነማን ናቸው?", "ባቢሌ የዝሆኖች መጠለያ ከአዲስ አበባ በስንት ኪሎ ሜትር ርቀት ላይ ይገኛል።?", "በምሥራቅ አፍሪካ ብቻ የሚገኙትን “ሎክሶዳንታ አፍሪካና ኦርሊያንሲ” የተባሉትን ንዑስ የዝሆን ዝርያ ለማልማትና ለመጠበቅ የተዘጋጀው መጠለያው ምን ይባላል?", "የባቢሌ የዝሆኖች መጠለያ ጠቅላላ ስፋት ስንት ነው?", "ከ1956 ጀምሮ የዋግ አውራጃ ማዕከል እና የሰቆጣ ወረዳ ዋና ከተማ ማን ናት?", "ከሰቆጣ ምን ያህል ርቆ የውቅሮ መስቀል ክርስቶስ አለት ውቅር ቤተክርስቲያን ይገኛል?", "ኩባር የተሰኘው የጥንቱ የኢትዮጵያ ገናና ማዕከል የት ይገኛል?", "ሰቆጣ መቼ ነዉ የኢትዮጵያ ዋና ከተማ የነበረችው?", "በኢትዮጵያ ከሚገኙት አምስቱ ነጋድራሶች መካከል በሰቆጣ የነበረው ማነው?", "በሰቆጣ የነበረዉ ትልቁ ግብይት ምንድን ነዉ?", "ጣሊያኖች በሰቆጣ ላይ የመርዝ ጋዝ ቦምብ የጣሉት መቼ ነው?", "ሰቆጣ የማን መቀመጫ ነበረች?", "የከተራ በዓል መች ይከበራል? ", "የጥምቀት በዓል መች ይከበራል?", "ጌታችን ኢየሱስ ክርስቶስ በስንት ዓመተ ምህረት ተጠመቀ?", "ጌታችን ኢየሱስ ክርስቶስ የት ተጠመቀ?", "ጌታችን ኢየሱስ ክርስቶስ በማን ተጠመቀ?", "ኤጲፋንያ ምን ማለት ነዉ?", "የመጀመሪያው የዓለም ጦርነት ከመቼ እስከ መቼ ተካሄደ?", "የመጀመሪያው የዓለም ጦርነት ለስንት ዓመታት ተካሄደ?", "የመጀመሪያው የዓለም ጦርነት የተካሄደው በማን መካከል ነው?", "የደን በዓል ቀን መቼ ተጀመረ?", "የምድር ባቡር መስመር መሰራት የተጀመረው ከስንት ዓ.ም ጀምሮ ነው ምን ያህል ጊዜስ ፈጀ?", "የምድር ባቡር መስመር ዝርጋት መቸተ ተጠናቀቀ?", "የምድር ባቡር መሰራት ዝርጋት ከስንት ዓመታት በኋላ ተጠናቀቀ?", "አልፍሬድ ኢልግ መቼ ተወለዱ?", "አልፍሬድ ኢልግ በየት ሀገር ተወለደ?", "በዳግማዊ ዓፄ ምኒልክ ዘመነ መንግሥት የዘውድ አማካሪ እና የአገሪቱን የውጭ ጉዳይ እስከ መምራት የደረሰው የስዊትዘርላንድ ዜጋ ማን ይባላል?", "አልፍሬድ ኢልግ የምን ሀገር ዜጋ ነው?", "አልፍሬድ ኢልግ በአገራችን ያስተዋወቀው ስልጣኔ ምንድን ነው?", "አልፍሬድ ኢልግ ለሞት ያበቃው ምን ነበር?", "ንጉስ ምኒልክ ኢልግ እንዲሰራላቸው ያዘዙት ምን ነበር?", "ኢልግ በደሞዘኝነት ተቀጥሮ ሲሰራ የነበረው የስራ ዘርፍ ምንድን ነው? ", "ኢልግ በደሞዘኝነት ተቀጥሮ ሲሰራ ደሞዙ ስንት ነበር?", "ለመጀመሪያ ጊዜ የብር እና የወርቅ ሳንቲም መጠቀም የጀመሩት ማን ናቸው?", "የወረቀት ገንዘብ ለመጀመሪያ ጊዜ ጥቅም ላይ የዋለው በማን ነው?", "የወረቀት ገንዘብ ለመጀመሪያ ጊዜ ጥቅም ላይ የዋለው በየት ሀገር ነው?", "በቻይና ለመጀመሪያ ጊዜ ጥቅም ላይ የዋለው የወረቀት ገንዘብ ምን ይባል ነበር?", "አውሮጳ ውስጥ ለመጀመሪያ ጊዜ የወረቀት ገንዘብ ጥቅም ላይ የዋለው መቼ ነው?", "አውሮጳ ውስጥ ለመጀመሪያ ጊዜ የወረቀት ገንዘብ ጥቅም ላይ የዋለው የት ሀገር ነው?", "በቻይና የሶንግ ስርወ መንግስት ዘመን የሚባለው ከመቼ እስከ መቼ ነው ?", "ቻይና 970 ዓ.ም. - 1276 ዓ.ም. ስትመረራ የነበረው በማን ስርወ መንግስት ነው?", "በአንድ አገር ወይም ማህበረሰብ ውስጥ ለሸቀጥ እና አገልግሎት መግዢያ እንዲሁም እዳ መክፈያ የሚያገለግ ማንኛውም ነገር ሁሉ ምን ይባላል?", "የዘመናዊ ሀገር የገንዘብ አቅርቦት በስንት ይከፈላል?", "መንግስት እና የህዝብ አስተዳደር የተሰኘው መጽሐፍ በማን ተጻፈ?", "መንግስት እና የህዝብ አስተዳደር የተሰኘው መጽሐፍ መቼ ተጻፈ?", "ሰው ሲፈጠር ጌታ እና ደሀ ሆኖ  አልተፈጠረም ታዲያ ድህነት እና ጌትነት በምን ተለየ ?", "የሙዚቃ ትምህርት ቤት የተቋቋመው በማን ዘመነ መንግስት ነበር?", "የሙዚቃ ትምህርት ቤት የተቋቋመው መቼ ነበር?", "ደቡብ አፍሪካ የፊፋ ዓለም ዋንጫን ያዘጋጀችው  በስንት ዓመተ ምህረት ነበር?", "የመጀመሪያዋ አፍሪካዊ የፊፋ ዓለም ዋንጫን ያዘጋጀች ሀገር ማን ናት?", "በደቡብ አፍሪካ የተካሄደው ፲፱ኛው የፊፋ የዓለም ዋንጫ ከመቼ እስከ መቼ ተካሄደ?", "ደቡብ አፍሪካ ስንተኛውን የፊፋ የዓለም ዋንጫ አዘጋጀች?", "የ2010 ዓ.ም. የዓለም ዋንጫ አዘጋጅ ማን ናት?", "ደቡብ አፍሪካ የትኞቹን የአፍሪካ ሀገሮች በመብለጥ ነው የመጀመሪያዋ አፍሪካዊ የአለም ዋንጫ አዘጋጅ ለመሆን የበቃችው?", "ደቡብ አፍሪካ ባዘጋጀችው የአለም ዋንጫ የፍፃሜ ጨዋታው የት ስታዲየም ተካሄደ?", "በደቡብ አፍሪካ በየተካሄደው የአለም ዋንጫ የፍፃሜ ጨዋታ የዳኙት እንግሊዛዊ ዳኛ ማን ይባላሉ?", "የፊፋ የዳኞች ኮሚቴ ለደቡብ አፍሪካ ዋንጫ ከኮንካፍ ስንት ዳኞችን መረጠ?", "ኢትዮ ሬይን ሜከርስ በ1996ዓ.ም. ለመትከል ካቀዱት ምን ያህሉን አሳኩ?", "በኢትዮጵያ ውስጥ ዛፎች በመትከል ረሃብን ለመከልከል የተቋቋመ የሰዎች ስብስብ ምን በመባል ይታወቃል?", "ኢትዮ ሬይን ሜከርስ በኢትዮጵያ ያለውን ችግር ለመቅረፍ አንዱ መፍትሔ ምንድን ነው ይላሉ?", "ኢትዮ ሬይን ሜከርስ እንጦጦ አካባቢ ከኢትዮጵያ ቅርስ ባለደራ ጋር አንድ ላይ በመሆን ችግኝ የተከሉት መች ነበር?", "ኢትዮ ሬይን ሜከርስ እንጦጦ አካባቢ ከኢትዮጵያ ቅርስ ባለደራ ጋር አንድ ላይ በመሆን ምን ያህል ችግኝ ተከሉ?", "ኢትዮ ሬይን ሜከርስ በ1995ዓ.ም. እንጦጦ አካባቢ ከማን ጋር በመሆን አስር ሺህ ያህል ችግኝ ተከሉ?", "ኢትዮ ሬይን ሜከርስ በ1995ዓ.ም. ከኢትዮጵያ ቅርስ ባለደራ ጋር በመሆን አስር ሺህ ያህል ችግኝ የተከሉት የት ነው?", "ኢትዮ ሬይን ሜከርስ በ1995ዓ.ም. ከኢትዮጵያ ቅርስ ባለደራ ጋር በመሆን በእንጦጦ ከተከሉት አስር ሺህ ችግኝ ምን ያህሉ ጸደቀ?", "ኢትዮ ሬይን ሜከርስ በ1996ዓ.ም. ምን ያህል ችግኝ ለመትከል አቀዱ?", "ላይቤሪያ በአፍሪካ በየትኛው ክፍል ትገኛለች?", "ላይቤሪያ የተመሰረተችው በማን ነው?", "ላይቤሪያ ከአሜሪካ በመጡ ነጻ በወጡ ሰዎች መች ተመሰረተች?", "የላይቤሪያ ዋና ከተማ ስም ማን ይባላል?", "ላይቤሪያ ነጻነቷን መች አገኘች?", "የላይቤሪያ ዋና ከተማ ስያሜዋን ያገኘችወ በየትኛው የአሜሪካን ፕሬዝደንት ስም ነው?", "በላይቤሪያ የእርስ በእርስ ጦርነት የነበረው ከመቼ እስከ መቼ ነበር?", "ከ1989 እስከ 2005 እ.ኤ.አ. በላይቤሪያ የተከሰተው የእርስ በእርስ ግጭት ምን ያህል ሰዎችን ለስደት ዳረገ?", "በላይቤሪያ ከ1989 እስከ 2005 እ.ኤ.አ. ድረስ ስንት ጊዜ የእርስ በእርስ ግጭት ተከሰተ?", "ላይቤሪያ ከውቅያኖሶች በየትኛው ትዋሰናለች?", "የላይቤሪያ መንግስት በወታደራዊው ኃይል ከስልጣን የተፈናቀለው መች ነበር?", "የላይቤሪያ ዩኒቨርሲቲ የተመሰረተው መች ነበር?", "የላይቤሪያ ዩኒቨርሲቲ የት ከተማ ይገኛል?", "ላይቤሪያ የምትገኝበት አህጉር የት ነው?", "አልጄርያ የምትገኝበት አህጉር የት ነው?", "አልጄርያ በአፍሪካ በየትኛው አቅጣጫ ትገኛለች?", "አልጄርያ በሰሜን በኩል በማን ትዋሰናለች?", "አልጄርያ በምስራቅ በኩል በማን ትዋሰናለች?", "አልጄርያ በሜድትራንያን ባህር ጋር ከየት በኩል ትዋሰናለች?", "አልጄርያ ከጎረቤቷ ሞሮኮ ጋር በየት አቅጣጫ ትዋሰናለች?", "አልጄርያ ከጎረቤቷ ሊቢያ ጋር ከየት አቅጣጫ ትዋሰናለች?", "የአልጄርያ ዋና ከተማ ማን ትባላለች?", "የአልጄርያ የጥንት መንግሥት ስያሜ ምን ይባል ነበር?", "አልጄርያ ከዛሬዎቹ ቱኒዚያና ምስራቅ ሞሮኮ ጋር በጥንት ምን ተብላ ትጠራ ነበር?", "የፀሀይ ቅርጽ ምን ይመስላል?", "የፀሀይ ዋልታዎቿን የሚያገናኘው ዲያሜትር እርዝመት ከወገቧ ዲያሜትር በምን ያህል መጠን ያንሳል?", "የፀሀይ  የሚታየው ገጽ ስኂን ምን ያህል ነው?", "በሥነ ፈለክ ተመራማሪዎች ግምት የፀሀይ እድሜ ስንት ነው?", "የፀሀይ የመጠነ ቁስ ጥንቅር ነገሮች መካከል 1% ያህሉ ምንድን ነው?", "የፀሀይ የመጠነ ቁስ ጥንቅር ነገሮች መካከል 74% ያህሉ ምንድን ነው?", "ከፀሀይ የመጠነ ቁስ ጥንቅር ነገሮች መካከል የሂሊየም መጠን ምን ያህል ነው?", "ከፀሀይ የመጠነ ቁስ ጥንቅር ነገሮች መካከል የሃይድሮጂን መጠን ምን ያህል ነው?", "ከፀሀይ የመጠነ ቁስ ጥንቅሮች መካከል የብረቴ ንጥረ-ነገሮች ጥርቅም መጠን ምን ያህል ነው?", "የፀሀይ የመጠነ ቁስ ጥንቅር ነገሮች መካከል 25% ያህሉ ምንድን ነው?", "በካናዳ 1974 ዓ.ም. ሕገ መንግስት ሥር ኢንዲያን፣ ሜቲ፣  እና ኤስኪሞዎች እንዲካተቱ የተደረጉት ነዋሪዎች ምን በመባል ይታወቃሉ?", "የካናዳ ጥንታዊ ነዋሪዎች በሀገሪቱ ሕገ-መንግስት ሥር የተካተቱት መቼ ነበር?", "በካናዳ በተደረገው የ1993 ዓ.ም ሕዝብ ቆጠራ የካናዳ ጥንታዊ ነዋሪዎች ብዛታቸው ስንት ነበር?", "የመጀመሪያው ተመዝግቦ የተገኘው ሕገ-መንግሥት የታወጀው በማን ነበር?", "ኡሩካጊና የመጀመሪያውን እንደ ሕገ-መንግሥት የሚታየውን ሕገ ፍትሕ መቼ ነበር ያወጀው?", "የባቢሎኑ ንጉሥ ሃሙራቢ ሕግጋት የታወጀው መች ነበር?", "በጽኹፍ ከተገኙ ሕግጋት ጥንታዊው ሕግ መች ነበር የተጻፈው?", "የኢሲን ንጉሥ ሊፒት-እሽታር ሕግጋት መች ነበር የታወጀው?", "በጽኹፍ ከተገኙ ሕግጋት ጥንታዊ የሆነው ሕግ የማን ነበር?", "በ1704 ዓክልበ. በባቢሎኑ ሕዝቡን ለማስተዳደር ሕግ አውጥቶ የነበረው ንጉሥ ማን ይባላል?", "ሕገ ሙሴ ለእስራኤል መቼ ነበር የተሰጣቸው?", "አንጎላ ከቅኝ ግዛት የተላቀቀቸው መቼ ነበር?", "የበርሊኑ ጉባኤ መች ነበር የፖርቱጋልን የቅኝ ግዛት ድንበር የወሰነው?", "በአንጎላ ፕሬዝዳንቱን፣ ምክትል ፕሬዝዳንቱንና የሚኒስትሮች ምክር ቤቱን የያዘው አካል ምን ተብሎ ይጠራል?", "በአንጎላ የሚገኙ አስራ ስምንቱ ክልሎች አስተዳዳሪዎች የሚሾሙት በማን ነው?", "የአንጎላ ጦር ሰራዊት ብዛት ምን ያህል ይሆናል?", "የአንጎላ ሦስቱ የትግል ቡድኖች ከምን ስምምነት በኋላ ነበር ወደ ሽግግር መንግስት ምስረታ የገቡት?", "ከአልቮር ስምምነት በኋላ ሦስቱ የአንጎላ የትግል ቡድኖች መች ነበር የሽግግር መንግስት ለማቋቋም የወሰኑት?", "በላሊበላ ስንት ውቅር አብያተ ክርስቲያናት አሉ?", "ከላሊበላ አስራ አንዱ ውቅር አብያተ ክርስቲያናት ግዙፉ የትኛው ነው?", "ከላሊበላ አስራ አንዱ ውቅር አብያተ ክርስቲያናት ቤተ ጊዮርጊስ ምን ዓይነት ቅርፅ አለው?", "ከላሊበላ አስራ አንዱ ውቅር አብያተ ክርስቲያናት የመስቀል ቅርጽ ያለው የትኛው ነው?", "በላሊበላ የጌታ ልደት ቀን በልዩ ሁኔታ የሚዘመረው ቤዛ ኵሉ የተሰኘው ዝማሬ የሚቀርበው በየትኛው ቤተ መቅደስ ነው?", "በላሊበላ የጌታ ልደት ቀን በቤተ ማርያም የሚቀርበው ልዩ ዝማሬ ምን ይባላል?", "በሕንድ ንጉሥ አሾካ መንግሥት የአሾካ አዋጆች ሕግጋት የታወጀው መች ነበር?", "በሕንድ ንጉሥ አሾካ መንግሥት በ264 አክልበ. የታወጀው ሕግ ምን በመባል ይታወቅ ነበር?", "በ885ዓ.ም. የድሮ ሕጎችን፣ የኦሪትና የወንጌል ሕግጋትን በመጠቀም አዲስ የእንግሊዝ ሕገ መንግሥት ያዘጋጀው ንጉሥ ማን ይባላል?", "ታላቁ አልፍሬድ የድሮ ሕጎችን፣ የኦሪትና የወንጌል ሕግጋትን በመጠቀም አዲስ የእንግሊዝ ሕገ መንግሥት መች ነበር?", "የአሾካ አዋጆች ሕግጋት በ264 አክልበ. የታወጀው በማን ነበር?", "የሎምባርዶች ሕግጋት መች ነበር የታወጀው?", "በዛሬው ሩሲያ የክዬቭ ታላቅ መስፍን ያሮስላቭ ሕገ መንግሥቱን ያዘጋጀው መች ነበር?", "በ1009 ዓ.ም. የክዬቩ ታላቅ መስፍን ያሮስላቭ ያዘጋጀው ሕገ መንግሥቱ ጥቅም ላይ የዋለው የት ሀገር ነበር?", "በ1009 ዓ.ም. ተዘጋጅቶ በሩሲያ ጥቅም ላይ የዋለው ሕገ መንግሥት ያዘጋጀው ማን ነበር?", "በ596 ዓ.ም. በጃፓን በልዑል ሾታኩ እንደተጻፈ የሚታመነው ሕገ መንግሥት ስንት አንቀጽ ነበረው?", "በ596 ዓ.ም. በጃፓን 17 አንቀጽ ያለው ሕገ መንግሥት በማን እንደተጻፈ ይታመናል?", "በ596 ዓ.ም. በልዑል ሾታኩ የተደነገገው ባለ 17 አንቀጽ ሕገ መንግሥት ጥቅም ላይ የዋለው የት ነበር?", "በጃፓን 17 አንቀጽ ያለው ሕገ መንግስት በልዑል ሾታኩ የተጻፈው መቼ ነበር?", "አስመራ የኤርትራ ዋና ከተማ የተደረገችው መች ነበር?", "በ1898 የኤርትራ ዋና ከተማ ከምጽዋ ወደ የት ተዘዋወረ?", "በ1898 የኤርትራ ዋና ከተማ ወደ አስመራ የተዛወረው ከየት ነበር?", "ጣልያኖች በአድዋ ጦርነት በኢትዮጰያ  ከተሸነፉ በኋላ በኤርትራ ሾመውት የነበረው ማን ነው?", "ጣልያኖች በአድዋ ጦርነት በኢትዮጰያ ከተሸነፉ በኋላ በኤርትራ ፈርዲናንዶ ማርቲኒ የሾሙት መች ነበር?", "ተንቀሳቃሽ ምስልና ድምጽ ከማሰራጫ የሚቀበል የመገናኛ ዘዴ ምን ይባላል?", "ቦሪስ ሮዚንግ ለመጀመሪያ ጊዜ ተንቀሳቃሽ ምስልን ለመላክና ለመቀብል የሚያስችል መሳሪያ የፈጠረው ምን ቴክኖሎጂ በመጠቀም ነው?", "ቦሪስ ሮዚንግ ለመጀመሪያ ጊዜ ተንቀሳቃሽ ምስልን ለመላክና ለመቀብል የሚያስችል መሳሪያ ሲርቲን ቴክኖሎጂ በመጠቀም የፈጠረው በስንት ዓ.ም. ነው?", "ለመጀመሪያ ጊዜ ተንቀሳቃሽ ምስልን ለመላክና ለመቀብል የሚያስችል መሳሪያ ፈጠራ ባለቤት የሆነው ቦሪስ ሮዚንግ የየት ሀገር ዜጋ ነው?", "በ1925 እ.ኤ.አ. ጆን ሎጂ ቤርድ የተሰኘው የስኮትላንድ ተመራማሪ ምን ዓይነት ተንቀሳቃሽ ምስሎችን በቴሌቪዥን ለመላክ ቻለ?", "በ1925 እ.ኤ.አ. 2ቅጥ ያላቸው ተንቀሳቃሽ ምስሎችን በቴሌቪዥን ለመላክ የቻለው የስኮትላንድ ተመራማሪ ማን ይባላል?", "በ1925 እ.ኤ.አ. 2ቅጥ ያላቸው ተንቀሳቃሽ ምስሎችን በቴሌቪዥን ለመላክ የቻለው ጆን ሎጂ ቤርድ የየት ሀገር ተመራማሪ ነበር?", "ለመጀመሪያ ጊዜ ተንቀሳቃሽ ምስልን ለመላክና ለመቀብል የሚያስችል መሳሪያ ሲርቲን ቴክኖሎጂ በመጠቀም የፈጠረው ማነው?", "ጆን ሎጂ ቤርድ 2ቅጥ ያላቸው ተንቀሳቃሽ ምስሎችን በቴሌቪዥን ለመላክ የቻለው መች ነበር?", "ጆን ሎጂ ቤርድ በ1926 እ.ኤ.አ. በቴሌቪዥን ምን ዓይነት ምስሎችን ነበር ማስተላለፍ የቻለው?", "በ1926 እ.ኤ.አ. በቴሌቪዥን ጥቁርና ነጭ ምስሎችን ለመጀመሪያ ጊዜ ማስተላለፍ የቻለው ሰው ማን ይባላል?", "በ1926 እ.ኤ.አ. የመጀመሪያውን የቴሌቪዥን መግለጫ የሰጠው ሰው ማን ይባላል?", "በጆን ሎጂ ቤርድ የመጀመሪያውን የቴሌቪዥን መግለጫ የተሰጠው መች ነበር?", "በ1927 እ.ኤ.አ. 16 የምስል ገጽታ በሰከንድ ከዋሽንግተን ዲሲ ወደ ኒውዮርክ ከተማ በሽቦ የላከው ሰው ማን ይባላል?", "ጆን ሎጂ ቤርድ በቴሌቪዥን ጥቁርና ነጭ ምስሎችን ያስተላለፈው መች ነበር?", "ኸርበርት አይቭስ 16 የምስል ገጽታ በሰከንድ ከዋሽንግተን ዲሲ ወደ ኒውዮርክ ከተማ በሽቦ የላከው መች ነበር?", "በ1927 እ.ኤ.አ. ኸርበርት አይቭስ 16 የምስል ገጽታ በሰከንድ በሽቦ የላከው ከየት ወደ የት ነበር?", "በ1927 እ.ኤ.አ. ኸርበርት አይቭስ 16 የምስል ገጽታ በሰከንድ በራድዮ የላከው ወደ የት ከተማ ነበር?", "በ1927 እ.ኤ.አ. ኸርበርት አይቭስ 16 የምስል ገጽታ በሰከንድ ከዋሽንግተን ዲሲ ወደ ኒውዮርክ ከተማ የላከው በምን ነበር?", "በ1927 እ.ኤ.አ. ኸርበርት አይቭስ 16 የምስል ገጽታ በሰከንድ ከዋሽንግተን ዲሲ ወደ ዊፓኒ ኒው ጀርሲ  የላከው በምን ነበር?", "ፊሎ ፍራንስዎርዝ የመጀመሪያውን የተሟላና በኤሌክትሪክ ስካኒንግ ብቻ የሚስራውን የቴሌቭዥን ስርዓት ተግባር ላይ ያዋለው መች ነበር?", "በ1927 እ.ኤ.አ. የመጀመሪያውን የተሟላና በኤሌክትሪክ ስካኒንግ ብቻ የሚስራውን የቴሌቭዥን ስርዓት ተግባር ላይ ያዋለው ሰው ማን ነበር?", "በጥር 1928 እ.ኤ.አ. የመጀመሪያው የቴሌቪዥን ማሰራጫ ጣቢያ የት ተከፈተ?", "በኒው ዮርክ የመጀመሪያው የቴሌቪዥን ማሰራጫ ጣቢያ መች ተከፈተ?", "በ1927 እ.ኤ.አ. ኸርበርት አይቭስ በሽቦ ያስተላለፈው ተንቀሳቃሽ ምስል በሰከንድ ምን ያህል የምስል ገጽታ ነበር?", "በ1927 እ.ኤ.አ. በፊሎ ፍራንስዎርዝ ተሰርቶ ተግባር ላይ የዋለው የመጀመሪያውን የተሟላ የቴሌቭዥን ስርዓት የሚሰራው እንዴት ነበር?", "በ1927 እ.ኤ.አ. 16 የምስል ገጽታ በሰከንድ ከዋሽንግተን ዲሲ ወደ ኒውዮርክ ከተማ በሽቦ የላከው ሰው ኸርበርት አይቭስ የማን ድርጅት ሰራተኛ ነበር?", "በአንድ ሀገር ውስጥ ሕጎችን ለማውጣትና ለማስፈጸም ስልጣን ያለው አካል ምን ይባላል?", "በዓለም ላይ የሪፐብሊካዊ መንግሥት መስፋፋት የጀመረው ከስንተኛው ክፍለ ዘመን አንስቶ ነው?", "የኮሚንስት መንግስት ለመጀመሪያ ጊዜ የተመሰረተው በየት ሀገር ነው?", "ሕይወት ያላቸው ነገሮች ባሕሪ፣ ጸባይ፣ አፈጣጠር እና ከአካባቢያቸው ጋር እርስ በርስም ያላቸውን ግንኙነት የሚያጠና ዘርፍ ምን ይባላል?", "ዮወሪ ሙሴቪኒ አሁን የዩጋንዳ ምንድን ናቸው?", "ዮወሪ ሙሴቪኒ የየት ሀገር ፕሬዝዳንት ናቸው?", "ዩጋንዳ በስንት ወረዳዎች የተከፈለች ናት?", "በዩጋንዳ ስንት ክልሎች አሉ?", "ቪክቶሪያ ሐይቅ  የሚገኘው የት ነው?", "የዩጋንዳ የመንግስት የሥራ ቋንቋ ምንድን ነው?", "በዩጋንዳ ዋናው የንግድ ቋንቋቸው ምንድን ነው?", "በዩጋንዳ ብዙ ተናጋሪ ያለው ቋንቋ ምንድን ነው?", "በዩጋንዳ በሁለተኛነት ደረጃ የሚነገረው ቋንቋ ምንድን ነው?", "ካምፓላና እንትቤን በየት ሀገር የሚገኙ ከተሞች ናቸው?", "ዩጋንዳ የምትገኘው የት አህጉር ውስጥ ነው?", "በዩጋንዳ የአቴሶ ቋንቋ በተናጋሪዎች ብዛት በስንተኛነት ይገኛል?", "ዩጋንዳ በአፍሪካ በየት አቅጣጫ ትገኛለች?", "በዩጋንዳ ኪስዋሂሊ ቋንቋ በስፋት ለምን አገልግሎት እያገለገለ ነው?", "ዩጋንዳ እ.ኤ.አ. ከ1894 ጀምሮ ስትገዛ የነበረው በማን ነው?", "ዩጋንዳ የአሁኑን ቅርጽ የያዘችው መች ነው?", "801.\tበዩጋንዳ በማን መሪ ጊዜ ነበር ከ300,000 በላይ ሰዎች ያለቁት?", "ዩጋንዳ ከመቼ ጀምሮ ነበር በታላቁ ብሪታን ስትገዛ የነበረው?", "በዩጋንዳ እ.ኤ.አ. በ1971 ሥልጣን የያዘው ማን ነበር?", "ኢዲአሚን ከሥልጣን የወረደው መቼ ነበር?", "ኢዲአሚን በዩጋንዳ ሥልጣን የያዘው መቼ ነበር?", "በኢዲአሚን ሥልጣን ዘመን ስንት ሰው አለቀ?", "ኢዲአሚን የየት ሀገር መሪ ነበር?", "ዮወሪ ሙሴቪኒ መቼ ነው ወደ ስልጣን የመጡት?", "የአሁኑ የዩጋንዳ ፕሬዝደንት ማን ይባላሉ?", "ከማአንያን ቋንቋ በየት አካባቢ የተገኘ ቋንቋ ነው?", "በመለጋሲ ቋንቋ በአረፍተ ነገር ውስጥ ከሁሉ የሚቀድመው ምንድን ነው?", "በመለጋሲኛ ቋንቋ የሚናገሩ የማዳጋስካር ነዋሪዎች ከየት አካባቢ የመጡ ናቸው?", "በመለጋሲኛ ቋንቋ የሚናገሩ የማዳጋስካር ነዋሪዎች ከእንዶኔዚያ የመጡት ከስንት ዓመት በፊት ነው?", "የመለጋሲ ቋንቋ 90% የሚሆኑት ቃላት ከየትኛው ቋንቋ ጋር ይመሳሰላል?", "የመለጋሲ ቋንቋ ከማአንያን ቋንቋ ጋር በመቶኛ ምን ያህል የሚመሳሰሉ ቃላትን ይዟል?", "የመለጋሲ ቋንቋ ከባንቱና ከአረብኛ ቋንቋዎች በመቶኛ ምን ያህል ቃላትን ተውሷል?", "የመለጋሲ ቋንቋ ከየት ቤተሰብ ነው?", "መለጋሲ የማን ሀገር ዋና ቋንቋ ነው?", "የማዳጋስካር መደበኛ ቋንቋ ምንድን ነው?", "ፍሪዩልያን ቋንቋ በጣልያን የት አካባቢ ይነገራል?", "ፍሪዩልያን ቋንቋ በጣልያን በምን ያህል ሰዎች ይነገራል?", "የጣና ሐይቅ ምን ያህል የወለል ስፋት አለው?", "ክርስትናን ለኢትዮጵያ ያስተዋወቀው አቡነ ሰላማ መቃብር የት ይገኛል?", "በጣና ሐይቅ ምን ያህል ደሴቶች አሉ?", "የጣና ሐይቅ መጋቢ ወንዞች እነማን ናቸው?", "በኢትዮጵያ በመጠኑ አንደኛ የሆነው ሐይቅ የቱ ነው?", "በጣና ሐይቅ ከሚገኙ ደሴቶች የቀደምት ኢትዮጵያውን መሪዎች መቃብር የሚገኘው በየትኛው ነው?", "የጣና ሐይቅ ርዝመት ምን ያህል ነው?", "የጣና ሐይቅ ስፋት ምን ያህል ነው?", "የጣና ሐይቅ ስንት መጋቢ ወንዞች አሉት?", "በጣና ሐይቅ ከሚገኙ ደሴቶች ገዳማትና አብያተ ክርስቲያናት የሆኑት ምን ያህሉ ናቸው?", "ከጣና ሐይቅ በዓመት ምን ያል የዓሳ ምርት ይገኛል?", "ጣና ሐይቅ በዓመት ሊሰጠው ከሚችለው የዓሳ ምርት እየተመረተ የሚገኘው ምን ያህል እጁ ነው?", "በጣና ሐይቅ ከሚገኙ ደሴቶች 22ቱ ምንድን ናቸው?", "በ18ኛው ክፍለ ዘመን ከካይሮ እስከ ጣና ተጉዞ የአባይ ወንዝ መነሻ ጣና ሐይቅ ነው ያለው ማነው?", "በ18ኛው ክፍለ ዘመን ከካይሮ እስከ ጣና ተጉዞ የአባይ ወንዝ መነሻ ጣና ሐይቅ ነው ያለው ጄምስ ብሩስ የምን ሀገር ዜጋ ነው?", "ጄምስ ብሩስ ከካይሮ እስከ ጣና ተጉዞ የአባይ ወንዝ መነሻ ጣና ሐይቅ ነው ያለው መቼ ነው?", "ጄምስ ብሩስ የአባይ ወንዝ መነሻ ጣና ሐይቅ ነው ያለው ከየት እስከ የት ተጉዞ ነው?", "ቡክሀርት ባልደክኼር የአባይን ምንጭ ከኢትዮጵያ ተራሮች ስር ማግኘቱን ለዓለም ያበሰረው መቼ ነበር?", "በ1937 የአባይን ምንጭ ከኢትዮጵያ ተራሮች ስር ማግኘቱን ለዓለም ያበሰረው የጀርመን ተወላጅ ማን ነበር?", "የአባይን ምንጭ ከኢትዮጵያ ተራሮች ስር ማግኘቱን ለዓለም ያበሰረው ቡክሀርት ባልደክኼር የምን ሀገር ተወላጅ ነው?", "ባሕር ዳር ከተማ ከአዲስ አበባ በምን ያህል ርቀት ላይ ትገኛለች?", "ባሕር ዳር ከተማ ከጢስ አባይ በምን ያህል ርቀት ላይ ትገኛለች?", "ባሕር ዳር ስንት የገጠር ቀበሌዎች አሏት?", "ባሕር ዳር ከተማ ከባሕር ጠለል በምን ያህል ከፍታ ትገኛለች?", "ባሕር ዳር በኢትዮያ በየትኛው አቅጣጫ የምትገኝ ከተማ ናት?", "የባሕር ዳር ከተማን ስያሜ ያወጡት ማናቸው?", "ባሕር ዳር በኢትዮጵያ የየትኛው ክልል ዋና መዲና ናት?", "ባሕር ዳር በስንት ዓመተ ምሕረት ተመሰረተች?", "ባሕር ዳር ከተማ ከጣና ሐይቅ በየትኛው አቅጣጫ ትገኛለች?", "ባሕር ዳር ስንት ክፍለ ከተሞች አሏት?", "ባሕር ዳር ከተማ በሰሜናዊ ጫፍ የምትገናኘው ከየትኛው ሐይቅ ጋር ነው?", "ባሕር ዳር ስንት የከተማ ቀበሌዎቸ አሏት?", "አባይ በመጽሐፍ ቅዱስ እንደተገለጸው ምንጩ ከየት ነው?", "አባይ ጣናን አቋርጦ ካለፈ ከምን ያህል ርቀት አባይ ፏፏቴ የሚፈጠረው?", "አባይ በመጽሐፍ ቅዱስ ውስጥ ምን ተብሎ ይጠራል?", "የአባይ ፏፏቴ ላይ ውሃው ወደ ታች ምን ያህል ርቀት ይወረወራል?", "አባይ በኢትዮጵያ ምድር ሲጓዝ ምን ያህል ርቀት ይሸፍናል?", "የአባይ ወንዝ ምንጭ ሀገር ማናት?", "በኢትዮጵያ ካሉ ወንዞች ትልቁ ወንዝ የቱ ነው?", "የአፋር ክልል የበፊቷ ዋና መዲና ማን ነበረች?", "የአፋር ክልል የቆዳ ስፋቱ ምን ያህል ነው?", "አፋር ክልል በ1999 እ.ኤ.አ. በተደረገ ቆጠራ ምን ያህል ሰው ይኖራል?", "አፋር ክልል በኢትዮጵያ ክልል ስንት ተብሎ ይታወቃል?", "የአፋር ክልል ዋና ከተማ ማናት?", "አፋር በየት ሀገር የሚገኝ ክልል ነው?", "ሉሲ በአፋር ክልል የተገኘችው መቼ ነበር?", "ሉሲ የተገኘችው በየት ክልል ነው?", "በአፋር ክልል ውስጥ የተገኘችው ረጅም እድሜ ያስቆጠረችው የሰው ቅሪተ አካል ማን ትባላለች?", "በአፋር ክልል ከሉሲ በተጨማሪ አዲስ የተገኘችው የሰው ቅሪተ አካል መቼ ተገኘች?", "በአፋር ክልል ከሉሲ በተጨማሪ አዲስ የተገኘችው የሰው ቅሪተ አካል መቼ ተገኘች?", "የሊንጋላ ቋንቋ ምን ያህል ተናጋሪዎች አሉት?", "የሊንጋላ ምንጭ ምን ቋንቋ ነበር?", "ሊንጋላ ቋንቋ ከየትኘው ቋንቋ ቤተሰብ ይመደባል?", "የሊንጋላ ቋንቋ ኮንጎ ዲሞክራቲክ ሪፐብሊክ በየትኛው አካባቢ ይነገራል?", "ጉጃራቲ ቋንቋ በታንዛንያ ምን ያህል ተናጋሪዎች አሉት?", "ጉጃራቲ ቋንቋ በሕንደኬ ምን ያህል ተናጋሪዎች አሉት?", "ጉጃራቲ በምን ቋንቋ ወገን ይገኛል?", "ጉጃራቲ ቋንቋ በምድር በምን ያህል ተናጋሪዎች ለመግባቢያነት ያገለግላል?", "ጉጃራቲ ቋንቋ በዩጋንዳ ምን ያህል ተናጋሪዎች አሉት?", "ጉጃራቲ ቋንቋ በፓኪስታን ምን ያህል ተናጋሪዎች አሉት?", "ጉጃራቲ ቋንቋ በኬንያ ምን ያህል ተናጋሪዎች አሉት?", "ጉጃራቲ ቋንቋ 45.5 ሚልዮን ያህል ተናጋሪዎች ያሉት በየት ነው?", "ጉጃራቲ ቋንቋ 250,000 ያህል ተናጋሪዎች ያሉት በየት ነው?", "ጉጃራቲ ቋንቋ 150,000 ያህል ተናጋሪዎች ያሉት በየት ነው?", "ጉጃራቲ ቋንቋ 50,000 ያህል ተናጋሪዎች ያሉት በየት ነው?", "ጉጃራቲ ቋንቋ 100,000 ያህል ተናጋሪዎች ያሉት በየት ነው?", "ጉጃራቲ ቋንቋ በተናጋሪ ሰዎች ብዛት ስንተኛ ደረጃ ይዟል?", "ጉጃራቲ ቋንቋ ፊደላት የማንን ፊደላት ይመስላሉ?", "ጉጃራቲ ቋንቋ የየት አካባቢ ነዋሪዎች ብሔራዊ ቋንቋ ነው?", "የጉጃር ሕዝብ ወደ ህንደኬ የመጡት በስንተኛው ክፍለ ዘመን ነው?", "በሴኔጋል ፓርላማ ውስጥ ካሉት ሁለት ምክር ቤቶች ፻፳ መቀመጫዎች ያለው የቱ ነው?", "በሴኔጋል ከሚገኙ ስደተኞች ብዛት ያላቸው የተሰደዱት ከየት ሀገር ነው?", "የሴኔጋል ብሔራዊ ቋንቋ ምንድን ነው?", "በሴኔጋል ፓርላማ ውስጥ ካሉት ሁለት ምክር ቤቶች ፻ መቀመጫዎች ያለው የቱ ነው?", "በሴኔጋል ዳኞች የሚሾሙት በማን ነው?", "በሴኔጋል ምን ያህል የፖለቲካ ድርጅቶች አሉ? ", "በሴኔጋል በሕዝብ ብዛት ትልቋ ከተማ ማን ናት?", "የሴኔጋል ቱባ ከተማ ምን ያህል ነዋሪ አላት?", "የሴኔጋል ፓርላማ ስንት ምክር ቤት አለው?", "በሴኔጋል በሕዝብ ብዛት ሁለተኛ የሆነች ከተማ ማን ናት?", "የሴኔጋል ቱባ ከተማ በነዋሪ ብዛት ስንተኛው ነው?", "በሴኔጋል ፓርላማ ውስጥ ካሉት ምክር ቤቶች አንዱ የብሔራዊ ስብስብ ምን ያህል መቀመጫዎች አሉት?", "በሴኔጋል ካላት ሕዝብ ብዛት ምን ያህሉ የክርስትና ሃይማኖት ተከታይ ነው?", "በሴኔጋል ካላት ሕዝብ ብዛት ምን ያህሉ የእስልምና ሃይማኖት ተከታይ ነው?", "በሴኔጋል ከፍተኛ የሆነ የፖለቲካ ተጽእኖ ያላቸው የእስልምና ሃይማኖት መሪዎች ምን ተብለው ይጠራሉ?", "በሴኔጋል ተወዳጅ የሆነው የሙዚቃ ስልት ምን ይባለል?", "በሴኔጋል ማራባውት የሚባሉት የእስልምና ሃይማኖት መሪዎች ምን ዓይነት ተጽዕኖ አላቸው?", "በሴኔጋል ካሉ ባህላዊ ስፖርታዊ ውድድሮች የሚወደደው ምንድን ነው?", "በሴኔጋል ዋና ከተማ ዳካር ምን ያህል ነዋሪዎች አሉ?", "በሴኔጋል ፓርላማ ውስጥ ካሉት ምክር ቤቶች አንዱ ሴኔት ምን ያህል መቀመጫዎች አሉት?", "የአሜሪካ የስደተኖች ኮሚቴ ባቀረበው የ2008 እ.ኤ.አ. የዓለም ስደተኞች አጠቃላይ ቅኝት መሠረት በሴኔጋል በ2007 እ.ኤ.አ. ምን ያህል ስደተኞች ይገኛሉ?", "የስዊስ ሀገር ስንት ብሔራዊ ቋንቋዎች አሏት?", "በስዊስ ከሮማንሽ በተጨማሪ ምን ምን ብሔራዊ ቋንቋዎች አሉ?", "ሮማንሽ የምን ቤተሰብ ቋንቋ ነው?", "ሮማንሽ ቋንቋ በስዊስ ምን ያህል ተናጋሪዎች አሉት?", "ከስዊስ አገር ብሔራዊ ቋንቋዎች ሁሉ ትንሽ ተናጋሪ ያለው ቋንቋ የቱ ነው?", "በስዊስ ሀገር የሮማንሽ ቋንቋ ተናጋሪዎች በመቶኛ ምን ያህል ይሆናሉ?", "የሮማንሽ ቋንቋ በሰሜን ጣልያን ከሚነገሩት ቋንቋዎች ለየትኞቹ ቅርብ ነው?", "የቀድሞው የናዋትል ቋንቋ አጻጻፍ ተቃጥሎ የጠፋው በማን ነው?", "የኡቶ-አዝቴካዊ ቋንቋ ቤተሠብ የሆነና በሜክሲኮ ኗሪዎች የሚነገር ቋንቋ ምንድን ነው?", "የናዋትል ቋንቋ አሁን የሚጸፈው በምን ፊደላት ነው?", "የቀድሞው የናዋትል ቋንቋ አጻጻፍ ከማን ጽሕፈት ጋር ይመሳሰል ነበር?", "የኡቶ-አዝቴካዊ ቋንቋ ቤተሠብ የሆነው ናዋትል በማን የሚነገር ቋንቋ ነው?", "ናዋትል በምን ቋንቋ ቤተሠብ ውስጥ ይመደባል?", "በሜክሲኮ የናዋትል ቋንቋ የነዋሪዎቹ መደበኛ መግባቢያነቱ የቀነሰው እነማን ከወረሯቸው በኋላ ነበር?", "ናዋትል ቋንቋ በሜክሲኮ በምን ያህል ሰዎች ይገራል?", "የናዋትል ቋንቋ በሌላ በምን ቋንቋ ተጽእኖ ስር ነው?", "የአማራ ክልል የቆዳ ስፋት ምን ያህል ነው?", "የአማራ ክልል በስንት ዞኖች የተከፈለ ነው?", "በአማራ ክልል የት አካባቢ ነው የእብነ በረድ ክምችት እንዳለ በጥናት የተለየው?", "በአማራ ክልል ስንት የከተማ አስተዳደሮች ይገኛሉ?", "የአማራ ክልል ዋና ከተማ ማን ናት?", "በኢትዮጵያ የሰሜን ተራሮች ብሔራዊ ፓርክ የት ክልል ይገኛል?", "በአማራ ክልል ሰሜን ሸዋ ዞን ምን ማዕድን ይገኛል?", "የኦፓል ማዕድን በአማራ ክልል በየትኛው ዞን ይገኛል?", "በአማራ ክልል የሚገኙ በርካታ ወንዞችን በስንት ዋና ዋና ተፋሰሶች መክፈል ይቻላል?", "በአማራ ክልል ያለው ከፍተኛ የውሃ ሀብት ክምችት የምን ዘርፍ ልማት ለማድረግ ምቹ ነው?", "በአማራ ክልል ውስጥ ጥሩ የጸጉር ምርት ያላቸው የየት አካባቢ በጎች ዝርያዎች ናቸው?", "በአማራ ክልል ዋና ዋና ተፋሰሶች እነማን ናቸው?", "በአማራ ክልል ውስጥ ተጠቃሽ ከሆኑት ሐይቆች እነማን ይገኛሉ?", "የአማራ ክልል ምጣኔ ሀብታዊ እንቅስቃሴ በአብዛኛው ምን ላይ የተመሰረተ ነው?", "በአማራ ክልል ውስጥ በወተት ምርታቸው የታወቁት የየት አካባቢ ከብት ዝርያዎች ናቸው?", "የቻይና ኃያላት የደቡብ ኮርያ ደሴቶችን በቦምብ የደበደቡት መቼ ነው?", "በኦምዱርማን ውግያ የእንግሊዝ ሠራዊት ሱዳንን ድል በማድረግ ቅኝ አገር ያደረጉት በስንት ዓመተ ምህረት ነው?", "በ1890 በተደረገው የኦምዱርማን ውግያ ሱዳንን ድል ያደረጋት የማን ሀገር ሠራዊት ነው?", "በ1890 በተደረገው የኦምዱርማን ውግያ የእንግሊዝ ሠራዊት ድል ያደረገው ማንን ነው?", "በቡሩንዲ ሻለቃ ፒዬር ቡዮያ የአገሪቱን ፕሬዚደንት ዣን ባፕቲስት ባጋዛን በመፈንቅለ መንግሥት ስልጣን የያዘው በስንት ዓመተ ምህረት ነው?", "በቡሩንዲ በ፲፱፻፸፱ ዓ/ም ሻለቃ ፒዬር ቡዮያ በመፈንቅለ መንግሥት ስልጣን የያዘው ማንን ሽሮ ነው?", "በቡሩንዲ በ፲፱፻፸፱ ዓ/ም ፕሬዚደንት ዣን ባፕቲስት ባጋዛን በመፈንቅለ መንግሥት ከስልጣናቸው የሻራቸው ማን ነው?", "በቡሩንዲ በ፲፱፻፸፱ ዓ/ም ሻለቃ ፒዬር ቡዮያ በመፈንቅለ መንግሥት ዣን ባፕቲስት ባጋዛን ከስልጣን በማስወገድ የሀገሪቱ ምን ሆነ?", "አሪዞና ስቴት የት ሀገር ይገኛል?", "በአሪዞና ዋነኛው ፓርቲ ማን  ነው?", "አሪዞና በዩናይትድ ስቴትስ በየት አቅጣጫ የሚገኝ ግዛት ነው?", "የአሪዞና ስቴት ከየትኞቹ ስቴቶች ጋር ይዋሰናል?", "የአሪዞና ሕግ አውጪ የ60 ምክር ቤት አባላትና የስንት ሴኔት አባላት ውቅር ነው?", "የአሪዞና ሕግ አውጪ የ30 ሴኔት አባላትና የስንት ምክር ቤት አባላት ውቅር ነው?", "በአሪዞና ሕግ አውጪ አካል 30ዎቹ አባላት ምንድን ናቸው?", "በአሪዞና ሕግ አውጪ አካል 60ዎቹ አባላት ምንድን ናቸው?", "በአሪዞና ሴናተሮችና የምክር ቤት አባላት ከስንት ጊዜ በላይ በተከታታይ መመረጥ አይችሉም?", "የአሪዞና ሕግ አስፈጻሚ ዘርፍ አስተዳዳሪ ለስንት ዓመት ስልጣን ላይ ይቆያል?", "የአሪዞና ሕግ አስፈጻሚ ዘርፍ አስተዳዳሪነት ከስንት ጊዜ በላይ በተከታታይ መመረጥን ይከለከላል?", "መልአከ-ፀሐይ ኢያሱ መቼ ተቀበረ?", "መልአከ-ፀሐይ ኢያሱ የተቀበረበት ቤተክርስቲያን የት ይገኛል?", "በሁለተኛው የዓለም ጦርነት ፍጻሜ ጃፓን በተሸናፊነቷ እጇን የሰጠችው በስንት ዓመተ ምህረት ነበር?", "መልአከ-ፀሐይ ኢያሱ የት ቤተክርስቲያን ተቀበረ?", "ለሦስት ቀናት የጋየውና አስር ሺህ ሕንጻዎችን ያወደመው የሎንዶን ትልቁ እሳት የተከሰተው በስንት ዓመተ ምህረት ነው?", "በነሐሴ ፳፯ ቀን ፲፮፻፶፰ ዓ/ም አስር ሺህ ሕንጻዎችን ያወደመው የሎንዶን ትልቁ እሳት ለስንት ቀን ቆየ?", "በነሐሴ ፳፯ ቀን ፲፮፻፶፰ ዓ/ም ለሦስት ቀናት የቆየው የሎንዶን ትልቁ እሳት ምን ያህል ሕንጻዎችን አቃጠለ?", "ብሪታንያ የጎርጎራዊ ዘመን አቆጣጠርን የተቀበለችው በስንት ዓመተ ምህረት ነበር?", "ብሪታንያ የጎርጎራዊ ዘመን አቆጣጠርን ለመቀበል የምዕራብ አውሮፓ አገራት ዘመን አቆጣጠራቸውን ከቀየሩ በኋላ በስንት ዓመት ዘግይታለች?", "በጣልያን ወረራ ዘመን የሸዋ አርበኞች ቡልጋ ላይ ተሰባስበው መልአከ-ፀሐይ ኢያሱን ያነገሡት በስንት ዓመተ ምህረት ነበር?", "በነሐሴ ፳፯ ቀን ፲፱፻፳፱ ዓ/ም በጣልያን ወረራ ዘመን የሸዋ አርበኞች ቡልጋ ላይ ተሰባስበው ያነገሡት ማንን ነበር?", "በነሐሴ ፳፯ ቀን ፲፱፻፳፱ ዓ/ም በጣልያን ወረራ ዘመን የሸዋ አርበኞች ቡልጋ ላይ ተሰባስበው ያነገሡት የማንን ልጅ ነበር?", "ሕንድ ከአንግሊዝ ነጻነቷን እንዳገኘች በጃዋሃርላል ኔህሩ ምክትል ፕሬዚደንትነት የሚመራ ጊዜያዊ መንግሥት የመሰረተችው በስንት ዓመተ ምህረት ነው?", "ነሐሴ ፳፯ ቀን ፲፱፻፴፰ ዓ/ም ሕንድ ከአንግሊዝ ነጻነቷን እንዳገኘች በማን የሚመራ ጊዜያዊ መንግሥት አቋቋመች?", "የርዋንዳን ፍጅት አስከትሎ የተባበሩት መንግሥታት ድርጅት ያቋቋመው የወንጀለኛ ፍርድ ቤት ጃን ፖል አካዬሱ ላይ የፈረደበት በስንት ዓመተ ምህረት ነው?", "ነሐሴ ፳፯ ቀን ፲፱፻፴፰ ዓ/ም የርዋንዳን ፍጅት አስከትሎ ማን ያቋቋመው የወንጀለኛ ፍርድ ቤት ነው ጃን ፖል አካዬሱ ላይ የፈረደበት?", "ነሐሴ ፳፯ ቀን ፲፱፻፴፰ ዓ/ም የርዋንዳን ፍጅት አስከትሎ የተባበሩት መንግሥታት ድርጅት ያቋቋመው የወንጀለኛ ፍርድ ቤት ማን ላይ ፈረደ?", "በጃን ፖል አካዬሱ ላይ የተባበሩት መንግሥታት ድርጅት ያቋቋመው የወንጀለኛ ፍርድ ቤት ለምን ፈረደበት?", "ቶክ ፒሲን በየት የሚነገር ቋንቋ ነው?", "በስሜን ፓፑዋ ኒው ግኒ የሚነገረው የእንግሊዝኛ ቋንቋ ድቅል ምን ይባላል?", "በስሜን ፓፑዋ ኒው ግኒ የሚነገረው የቶክ ፒሲን ቋንቋ የምን ቋንቋ ድቅል ነው?", "ቶክ ፒሲን በአንደኛ ቋንቋነት በምን ያህል ሰዎች ይነገራል?", "ቶክ ፒሲን በሁለተኛ ቋንቋነት በምን ያህል ሰዎች ይነገራል?", "የቶክ ፒሲን አጀማመር በየትኛው ውቅያኖስ ላይ ባሉ ደሴቶች የነበሩ ሰዎች ነበሩ?", "ቢል ክሊንተን መቼ ተወለደ?", "ቢል ክሊንተን የት ተወለደ?", "ቢል ክሊንተን ከ1993 – 2001 በአሜሪካ ምን ኃላፊነት ነበረው?", "ቢል ክሊንተን የአሜሪካ ፕሬዝደንት ሆነው የሰሩት ከመቼ እስከ መቼ ነው?", "በአሜሪካ እ.ኤ.ኣ ከ1993 – 2001 ፕሬዝደንት የነበረው ማነው?", "ቢል ክሊንተን ፕሬዝደንት ሳይሆኑ በፊት ስንቴ የአርካንሳው ግዛት አስተዳዳሪ ሆነው ሰሩ?", "ቶማስ ጄፈርሰን የአሜሪካ ስንተኛ ፕሬዝደንት ናቸው?", "ቶማስ ጄፈርሰን መቼ ተወለዱ?", "ቶማስ ጄፈርሰን መቼ ሞቱ?", "ቶማስ ጄፈርሰን ከመቼ እስከ መቼ የአሜሪካ ፕሬዝዳንት ሆነው ሰሩ?", "ቶማስ ጄፈርሰን ያቋቋሙት ዩኒቨርሲቲ ምን ይባላል?", "የቨርጂኒያ ዩኒቨርሲቲ መስራች ማነው?", "የቶማስ ጄፈርሰን ወላጅ አባት ማነው?", "የቶማስ ጄፈርሰን ወላጅ እናት ማናት?", "ቶማስ ጄፈርሰን በሚሲሲፒ ወንዝ አቅራቢያ ቦታ የገዙት ከማን ነው?", "ቶማስ ጄፈርሰን ከእንግሊዝ ንጉሥ የአሜሪካንን ነጻነት አዋጅ ያወጁት መች ነበር?", "አዲስ አበባ የሚለውን ስም ለከተማዋ የሰጡት ማናቸው?", "እቴጌ ጣይቱ አዲስ አበባ የሚለውን ስም ለከተማዋ የሰጡት መች ነበር?", "አዲስ አበባ የኢትዮጵያ ምንድን ናት?", "የአፍሪካ ሕብረት መቀመጫ መዲና ማናት?", "የኢትዮጵያ ዋና መዲና ማናት?", "በኢትዮጵያ ከባህር ጠለል 2500 ሜትር ከፍታ የምትገኝ እንዲሁም በሀገሪቱ ትልቋ ከተማ ማን ትባላለች?", "አዲስ አበባ ከተማ ከባህር ጠለል በምን ያህል ከፍታ ትገኛለች?", "አዲስ አበባ የተቆረቆረችው ማን በመረጠው ቦታ ነው?", "አዲስ አበባ የተመሰረተችው በማን ነው?", "አዲስ አበባ የተመሰረተችው መች ነው?", "ዳግማዊ ምኒልክ አዲስ አበባን መች መሰረቷት?", "የአዲስ አበባ ዩኒቨርሲቲ መገኛ ከተማ ማናት?", "የአዲስ አበባ ዩኒቨርሲቲ የመጀመሪያ ስም ማን ነበር?", "ቀዳማዊ ኃይለ ሥላሴ ዩኒቨርሲቲ አሁን ምን በመባል ይጠራል?", "የአዲስ አበባ ዩኒቨርሲቲ መስራች ማናቸው?", "በዳግማዊ ምኒልክ በ፲፰፻፸፰ (1878) ዓ.ም. እቴጌ ጣይቱ በመረጡት ቦታ የተቆረቆረችው ከተማ ማን ትባላለች?", "የጣልያን ፋሺስት ጦር ከኢትዮጵያ ተሸንፎ ከወጣ በኋላ ቀዳማዊ ኃይለ ሥላሴ ወደ ሀገራቸው ከስደት የተመለሱት መቼ ነበር?", "በሀገራችን ታሪክ የመጀመሪያው ሕገ መንግሥት ለሕዝብ ተወካዮች ምክር ቤት የቀረበው መቼ ነበር?", "በሀገራችን ታሪክ የመጀመሪያው ሕገ መንግሥት እንዲዘጋጅ የተደረገው በማን ነበር?", "የጣልያን ፋሺስት ጦር ኢትዮጵያን በ፲፱፻፳፰ ሲወር ንጉሠ ነገሥት የነበሩት ማን ናቸው?", "የጣልያን ፋሺስት ጦር ኢትዮጵያን በ፲፱፻፳፰ ሲወር ንጉሠ ነገሥት ቀዳማዊ ኃይለ ሥላሴ ለተባበሩት መንግሥታት አባል ሀገራት አቤቱታ ያቀረቡት የት ነበር?", "የጣልያን ፋሺስት ጦር ኢትዮጵያን በመውረሩ ምክንያት  ቀዳማዊ ኃይለ ሥላሴ በስደት ስንት ዓመት ቆዩ?", "የቀዳማዊ ኃይለ ሥላሴ ንጉሣዊ አስተዳደር የሥልጣን ዘመን ሲያከትም ሥልጣኑን የያዘው መንግሥት ርዕዮቱ ምን ነበር?", "በጣልያን ፋሺስት ወረራ ጊዜ ቀዳማዊ ኃይለ ሥላሴ ወዴት ሀገር ነበር የተሰደዱት?", "ቀዳማዊ ኃይለ ሥላሴ በማን ታሰሩ?", "ቀዳማዊ ኃይለ ሥላሴ መቼ ታሰሩ?", "የጃንሆይ ኃይለ ሥላሴ የትውልድ መጠሪያ ስም ማን ይባላል?", "የአጼ ኃይለ ሥላሴ የመንግስት ስማቸው ማን ይባላል?", "ልዑል ራስ መኮንን በዳግማዊ ምኒልክ ተወክለው ወዴት ነበር የተላኩት?", "ራስ መኮንን የዳግማዊ ምኒልክ ተወካይ በመሆን አውሮፓን የጎበኙት ስንት ጊዜ ነው?", "ከኢጣልያ ጋር በተደረገው ጦርነት ራስ መኮንን ምን ያህል የጦር ሠራዊት ይመሩ ነበር?", "ራስ መኮንን የውጫሌ ስምምነት መፍረሱን የተረዱት በየት ሀገር ጉብኝት ሲያደርጉ ነበር?", "የኢጣልያ ጋዜጦች የውጫሌ ውል ስምምነትን አላከበሩም ብለው በጽሑፋቸው የወቀሱት ማንን ነበር?", "ልዑል ራስ መኮንን የአውሮፓ ሀገሮችን የጎበኙት የማን ተወካይ ሆነው ነበር?", "የኢጣልያ ጋዜጦች የውጫሌ ውል ስምምነትን አላከበሩም ብለው የጀርመንን ንጉሠ ነገስት የወቀሱት ምን በማድረጋቸው ነበር?", "ራስ መኮንን ግብዓተ መሬታቸው የት ተፈጸመ?", "የራስ መኮንን አርባ በአዲስ አበባ የት ቦታ ተደረገ?", "ራስ መኮንን መቼና የት ሞቱ?", "የራስ መኮንን አርባ በአዲስ አበባ እንዲደረግ የወሰነው ማን ነው?", "የራስ መኮንን በታመሙ ጊዜ ሕክምና የተደረገላቸው የት ነበር?", "የራስ መኮንን አርባ በአዲስ አበባ የተደረገበት ዕለቱ ምን ነበር?", "ራስ መኮንን የት ተቀበሩ?", "ልዑል ራስ መኮንን ወላጅ አባታቸው ማን ይባላሉ?", "ልዑል ራስ መኮንን የማን አባት ናቸው?", "ራስ መኮንን ወልደሚካኤል መቼና የት ተወለዱ?", "ልዑል ራስ መኮንን ወልደሚካኤል ከስንት ዓመታቸው ጀምሮ የዳግማዊ ምኒልክ ባለሟል ሆነው ሰሩ?", "ልዑል ራስ መኮንን ወልደሚካኤል ጋብቻ የመሰረቱበት ዓመት መቼ ነበር?", "ልዑል ራስ መኮንን ወልደሚካኤል አጎታቸው ማን ነበሩ?", "ልዑል ራስ መኮንን ወልደሚካኤል እስከ ስንት ዓመታቸው ከወላጆቻቸው ጋር ኖሩ?", "ልዑል ራስ መኮንን በስንት ዓመታቸው ትዳር መሰረቱ?", "ልዑል ራስ መኮንን ትዳር የመሰረቱት ከማን ጋር ነው?", "ልዑል ራስ መኮንን እናታቸው ማን ይባላሉ?", "የልዕልት ተናኘወርቅ አባታቸው የየት ክፍለ ሀገር ንጉሥ ነበሩ?", "ልዑል ራስ መኮንን ልጃቸውን አጼ ኃይለ ሥላሴን የወለዱት መቼ ነበር?", "ልዑል ራስ መኮንን ከባለቤታቸው ልዕልት ተናኘወርቅ ንጉሠ ነገሥት የሆኑትን ልጃቸውን የወለዱት መቼ ነበር?", "ዋዝንቢት ባለ ስንት አጽቄ ነፍሳት ነው?", "ዋዝንቢት ከምን ወገን የሚመደብ ነፍሳት ነው?", "የዋዝንቢት ነፍሳት መለያው ምንድን ነው?", "ዋዝንቢት ድምጽ የሚወያወጣው እንዴት ነው?", "ዋዝንቢት ለምን ተግባር ድምጽ ሊያወጣ ይችላል?", "ዋዝንቢት የጥሪ ዘፈን ድምጽ ለምን ተግባር ሊያወጣ ይችላል?", "የሴቷ ዋዝንቢት እንቁላል መጣያ አካል ቅርጹ ምን ዓይነት ነው?", "በዓለማችን ምን ያህል የዋዝንቢት ዝርያዎች አሉ?", "ዋዝንቢት የሚንቀሳቀሰው በየትኛው ክፍለ ቀን ነው?", "ብርቱካን በምን የአየር ጸባይ ይበቅላል?", "የብርቱካን ልጣጭ ለምን ይጠቅማል?", "ፋሺሽት ጣልያን ሁለተኛ ዙር ኢትዮጵያን ለመውረር በመጣ ጊዜ ምን ያህል ተዋጊ አውሮፕላኖችን ተጠቅሟል?", "ፋሺሽት የተጠቀመበት ማስተርድ ጋዝ የኬሚካል መሳሪያ ምን ጉዳት ያስከትላል?", "ፋሺሽት ጣልያን ድጋሚ ኢትዮጵያን ሲወር የተጠቀመበት መርዛማ ኬሚካል ምን ይባላል?", "በሰርጎ ገቦች የተገደሉት ኢትዮጵያዊ ጀግና ማናቸው?", "ጣልያን ኢትዮጵያን ለመውረር ድጋሚ የመጣበት ዓመት መቼ ነው?", "ጣልያን ኢትዮጵያን ለመውረር ድጋሚ ሲመጣ ስንት ጦር ሠራዊት ነበረው?", "ሉሲ የተባለችው የሰው ልጅ ቅሪተ አካል ከተገኘች ስንት ዓመት ይሆናታል?", "በዓለም ጥንታዊ ከሚባሉት ሀገሮች አንዷ የሆነችው ማናት?", "አምስት ሚልዮን ዓመታት ቆይታ ያለው የሰው ልጅ ቅሪተ አካል የተገኘበት ቦታ የት ነው?", "ወደ ንጉሥ ሰለሞን በመሄድ ጥያቄ ያቀረበችው ኢትዮጵያዊት ንግሥት ማን ናት?", "የንግሥት ሳባ ቤተ መንግስት የት ይገኛል?", "እስልምና በዓለም በስንተኛው ክፍለ ዘመን ተስፋፋ?", "ንግስት ሳባ ወደ ንጉሥ ሰሎሞን ሄዳ ጥያቄ ስለማቅረቧ የሚያወሳው ታሪክ በየትኛው የመጽሐፍ ቅዱስ ክፍል ላይ ይገኛል?", "ብዙ የኮምፒዩሮችን የያዘ የመገናኛ መረብ ምን ይባላል?", "ክፍለ ኢንተርኔት መቼ ነው የተጀመረው?", "ድረ ገጽ ተግባር ላይ የዋለው ከመቼ ጀምሮ ነው?", "እ.ኤ.አ. በ1980 ዩኒቨርሲቲዎችና ኮሌጆች እንደ መገናኛ ዘዴ የተቀሙበት ነገር ምን ነበር?", "በምድር ስርዓት ፈለክ መሀል ላይ የምትገኘው ማናት?", "መሬት በጸሐይ ዙሪያ የምታደርገው ዑደት ምን ያህል ጊዜ ይወስዳል?", "መሬት በራሱ ዙሪያ የምታደርገው ሹረት ውጤቱ ምንድን ነው?", "የወቅቶች መፈራረቅ ምክንያቱ ምንድን ነው?", "በስርዓተ-ፈለክ ውሥጥ ያሉ አካላት የብርሃን ምንጫቸው ማናት?", "እጽዋት ካርቦን ዳይኦክሳይድ እና አልሚ ምግቦች የሚያስተጻምሩት በምን አማካኝነት ነው?", "ስለፀሀይ ሳይንሳዊ መግለጫ ከሰጡ ጥንታዊ የግሪክ ፈላስፎች ቀዳሚው ማን ነው?", "ስለፀሀይ ሳይንሳዊ መግለጫ ከሰጡ ፈላስፎች ቀዳሚው የሆነው አናክሳጎራስ የየት ሀገር ፈላስፋ ነበር?", "አናክሳጎራስ ስለፀሀይ በሰጠው ሳይንሳዊ መግለጫ ምክንያት ከተፈረደበት የሞት ፍርድ በማን ዳነ?", "ለመጀመሪያ ጊዜ ምድር ጸሓይን ትዞራለች እንጂ ፀሓይ መሬትን አትዞርም ብሎ ያስተማረው ማን ነበር?", "ኒቆላዎስ ቆጰርኒቆስ ለመጀመሪያ ጊዜ ምድር ጸሓይን ትዞራለች እንጂ ፀሓይ መሬትን አትዞርም ብሎ ያስተማረው መቼ ነበር?", "ኒቆላዎስ ቆጰርኒቆስ ስለፀሓይ በ16ኛው ምእት ምን ብሎ ነበር ያስተማረው?", "በ17ኛ ምእት በቴሌስኮፕ የታገዘ የፀሓይ ምርምር ጀማሪ ማን ነበር?", "ጋሊሊዮ በቴሌስኮፕ የታገዘ የፀሓይ ምርምር የጀመረው መች ነበር?", "ጋሊሊዮ በ17ኛው መቶ ክፍለ ዘመን የፀሓይ ምርምር የጀመረው በምን እየታገዘ ነበር ?", "ፕሪዝም በመጠቀም የፀሓይ ብርሃን የልዩ ልዩ ቀለማት ጥርቅም መሆኑን ያወቀው ማን ነበር?", "አይዛክ ኒውተን በምን ነበር የፀሓይ ብርሃን የልዩ ልዩ ቀለማት ጥርቅም መሆኑን ያወቀው?", "አይዛክ ኒውተን ፕሪዝም በመጠቀም ምን አሳየ?", "የኢንፍራሬድ ጨረር  ግኝት ባለቤት ማን ነው?", "ዊሊያም ኸርሽል የኢንፍራሬድ ጨረር ግኝት ባለቤት የሆነው በስንተኛው መቶ ክፍለ ዘመን ነበር?", "ስለፀሓይ በ19ኛው ምእት በምን ዓይነት መሳሪያ ይደረግ የነበረው ጥናት መጥቆ የነበረው?", "ስለፀሓይ በስፔክትሮስኮፕ እጅግ ብዙ ጥናት የተጀመረበት ክፍለ ዘመን መች ነበር?", "ዊሊያም ኸርሽል በ19ኛው መቶ ክፍለ ዘመን ያገኘው ግኝት ምን ነበር?", "የፀሓይ ክብደት ከመሬት ጋር ሲነጻጸር ስንት እጥፍ ይበልጣል?", "የፀሓይ ብርሃን መሬት ለመድረስ ምን ያህል ጊዜ ይወስድበታል?", "በሥርዓተ-ፀሓይ የፀሓይ ክብደት ምን ያህል እጅ ይሆናል?", "የፀሓይ ብርሃን ጨረር መሬት ላይ በምን ያህል ፍጥነት ይደርሳል?", "የፀሓይ ክብደት ከጁፒተር ጋር ሲነጻጸር ስንት እጥፍ ይበልጣል?", "ኬንያ በሰሜን በኩል የምትዋሰነው ከማን ጋር ነው?", "ኬንያ የምትገኘው በየት ነው?", "ኬንያ በምስራቅ የምትዋሰነው ከማን ጋር ነው?", "ኬንያ ከሶማሊያ ጋር የምትዋሰነው በየት አቅጣጫ ነው?", "ኬንያ ከእንግሊዝ ቅኝ ግዛት የወጣችው መቼ ነው?", "ኬንያን ቅኝ የገዛቻት ሀገር ማናት?", "የኬንያ ሕገ መንግሥት በሕዝበ ውሳኔ የተሻሻለው መቼ ነው?", "ኬንያ በስንት የአስተዳደር ክልሎች የተከፈለች ናት?", "ኬንያ ስንት የአስተዳደር ክልሎች አሏት? ", "የኬንያ ዋና መዲና ማናት?", "የናይጄሪያ ሰራዊት ሰላም ለማስከበር ወደ ላይቤሪያ የገባው መች ነበር?", "ናይጄሪያ ለዓለም ከምታቀርባቸው ምርቶች ዋነኞቹ የትኞቹ ናቸው?", "ናይጄሪያ ለዓለም ገበያ በምታቀርበው የፔትሮሊየም ምርት ስንተኛ ናት?", "የናይጄሪያ የቆዳ ስፋት ስንት ነው?", "ናይጄሪያ በቆዳ ስፋት ከዓለም ስንተኛ ደረጃ ላይ ትገኛለች?", "በናይጄሪያ ከፍተኛው ቦታ በምን ያህል ከፍታ ላይ ይገኛል?", "በናይጄሪያ ትልቁ ተራራ ምን ይባላል?", "በናይጄሪያ ትልልቆቹ ወንዞች ማንና ማን ናቸው?", "ኒጄርና ቤንዌ የት ሀገር የሚገኙ ወንዞች ናቸው?", "ናይጄሪያ በአፍሪካ በየትኛው ክፍል ትገኛለች?", "የግብጽ ዋና መዲና ማናት?", "ካይሮ ለግብጽ ምኗ ናት?", "ዋና ከተማዋ ካይሮ የሆነችው ሀገር ማን ናት?", "በግብጽ ዋናዋ የወደብ ከተማ ማን ትባላለች?", "አሌክሳንድርያ ከተማ በነዋሪ ቁጥር ከግብጽ ከተሞች ስንተኛዋ ናት?", "ከግብጽ ከተሞች በሕዝብ ብዛት ሁለተኛ የሆነችው ከተማ ማናት?", "አሌክሳንድርያ ከግብጽ ከተሞች በዋናነት የምትታወቅበት ነገር ምንድን ነው?", "ግብጽ የምትገኝበት አህጉር የት ነው?", "በመጽሐፍ ቅዱስ መሰረት ከማየ አይኅ በኋላ መጀመሪያ በአፍሪካ የሰፈሩት ሕዝቦች እነማን ናቸው?", "በመጽሐፍ ቅዱስ መሰረት ካም የማን ልጅ ነው?", "ሜሪላንድ በየት ሀገር የምትገኝ ስቴት ናት?", "የሜሪላንድን ስቴት መሀል ለመሀል የሚከፍለው ወሽመጥ ምን ይባላል?", "በሜሪላንድ ስቴት ትልቁ የከፍታ ቦታ የት ነው?", "በ2003 እ.ኤ.ኣ. የሜሪላንድ ስቴት ዓመታዊ ምርት ምን ያህል ነበር?", "በ2003 እ.ኤ.ኣ. የሜሪላንድ ስቴት ነዋሪዎች ዓመታዊ ገቢ ምን ያህል ነበር?", "የሜሪላንድ ስቴት ዋና አውሮፕላን ማረፊያ ምን ይባላል?", "በ2003 እ.ኤ.ኣ. የሜሪላንድ ስቴት ነዋሪዎች ባላቸው አማካኝ የነፍስ ወከፍ ዓመታዊ ገቢ መጠን ከአሜሪካ ስንተኛ ደረጃ ይዞ ነበር?", "ሜሪላንድ በየትኛው ውቅያኖስ ትዋሰናለች?", "በ1996 እ.ኤ.ኣ. የሜሪላንድ ስቴት ሕዝብ ብዛት ስንት ነበር?", "በ1996 በሜሪላንድ ስቴት ከሚኖሩ ነዋሪዎች በመቶኛ ምን ያህሎቹ የሌላ ስቴት ወይም ሀገር ተወላጆች ነበሩ?", "በ1996 በሜሪላንድ ስቴት ከሚኖሩ ነዋሪዎች ምን ያህሎቹ የሌላ ስቴት ወይም ሀገር ተወላጆች ነበሩ?", "ከሱመር ነገስታት መካከል የኡሩክ ከተማ መስራች ማነው?", " “የኤንመርካርና የአራታ ንጉስ” በሚል ተረት ውስጥ ከሱመር ነገስታት መካከል ኤንመርካር የማን ልጅ ነው?", "በሱመር እምነት መሰረት ኡቱ ምንድን ነው?", "የሱመር ንጉሥ የነበረው ኤንመርካር ያሰራው ታላቅ መስጊድ በየት ነበር?", "ከሱመር ነገስታት መካከል ኤንመርካር የመሰረታት ከተማ ማናት?", "አንጎላ የቆዳ ስፋቷ ምን ያህል ነው?", "አንጎላ በቆዳ ስፋት ከዓለም ስንተኛ ናት?", "አንጎላ በምሥራቅ በማን ነው የምትዋሰነው?", "አንጎላ በ2004 እ.ኤ.አ. ከቻይናው ኤክሲም ባንክ ምን ያህል ብር ተበድራለች?", "አንጎላ ከምእራብ አቅጣጫ በማን ትዋሰናለች?", "አንጎላ በኮንጎ ዲሞክራሲያዊ ሪፐብሊክ ከየት አቅጣጫ ትዋሰናለች?", "አንጎላ በአትላንቲክ ውቅያኖስ ከየት አቅጣጫ ትዋሰናለች?", "አንጎላ በዛምቢያ ከየት አቅጣጫ ትዋሰናለች?", "አንጎላ በናሚቢያ ከየት አቅጣጫ ትዋሰናለች?", "አንጎላ ከሰሜን-ምስራቅ አቅጣጫ በማን ትዋሰናለች?", "አንጎላ ከደቡብ አቅጣጫ በማን ትዋሰናለች?", "ላሊበላ በኢትዮጵያ በየትኛው ክልል ይገኛል?", "ላሊበላ ከባህር ጠለል በምን ያህል ከፍታ ላይ ትገኛለች?", "የላሊበላ ከተማን ታዋቂ ያደረጋት ምንድን ነው?", "ሰው ራሱ ማምረት የማይችለውን ነገር ለማግኘት የሚያደርገው የምርቶች ልውውጥ ስርዓት ሂደት ምን ይባላል?", "ከግሪክ ፊሎስ (ፍቅር) እና ሶፎስ (ጥበብ) ከሚሉት ቃላት ውህደት የተፈጠረው ቃል ምን ይባላል?", "ፍልስፍና የሚመረምረው ስንት ዋነኛ ነገሮችን ነው?", "ናሚቢያ በአፍሪካ በየት አቅጣጫ ትገኛለች?", "ናሚቢያ ከአትላንቲክ ውቅያኖስ ጋር በየት አቅጣጫ ትዋሰናለቸው?", "በምስራቅ አቅጣጫ ናሚቢያ በማን ሀገር ትዋሰናለች?", "ናሚቢያ ከደቡብ አፍሪካ ነጻነቷን ያገኘችው መቼ ነው?", "ናሚቢያ ዋና ከተማዋ ማነው?", "ዊንድሁክ ዋና ከተማዋ የሆነችው ሀገር ማናት?", "ሁለትና ከዛ በላይ የሆኑ ኮምፒዩተሮችን እርስ በእርስ በማገናኘት የሚፈጠር ትስስር ምን ይባላል?", "በኮምፒዩተሮች አውታር ምን ማድረግ ይቻላል?", "የኮምፒዩተሮች አውታር ስንፈጥር ኮምፒዩተሮቹን በምን በምን መንገድ ልናገናኛቸው እንችላለን?", "ቴምፕላርስ የተባለው ስርዓት መቼ ተመሰረተ?", "ቴምፕላሮች የገዳማዊ ኑሮዋቸውን ማን በደነገገው ሕግ መሰረት ነው የሚመሩት?", "ክላርቮው በርናርድ የመሰረተው የገዳማውያን ሥርዓት ምን ይባላል?", "ቴምፕላሮች ለገዳማዊ ኑሮዋቸው የሚከተሉት ሥርዓት ምን ይባላል?", "የሲሰተርሲያን ገዳማዊ ስርዓት መስራች ማነው?", "የቴምፕላርስ በሌላ ስማቸው ምን ተብለው ይታወቃሉ?", "አንደኛው የመስቀል ጦርነት የተካሄደው መቼ ነበር?", "የመጀመሪያው ፈላስፋ ማን ይባላል?", "ታሊዝ የፀሐይ ግርዶሽ እንደሚኖር የተናገረው መቼ ነበር?", "ታሊዝ የተወለደበት ቦታ አሁን በየትኛው ሀገር ክልል ውስጥ ይገኛል?", "ታሊዝ ዓለምና በውስጧ ያሉ ነገሮች ከምን እንደተፈጠሩ ነበር የሚያምነው?", "የዚህ ዓለም ጥንተ ፍጥረቱ ከአየር ነው ብሎ የሚያምን የነበረው ፈላስፋ ማነው?", "ዓለምና በውስጧ ያሉ ነገሮች ከውሃ እንደተፈጠሩ ያምን የነበረው ፈላስፋ ማን ነው?", "ሄራቅሊጠስ የዚህ ዓለም ጥንተ መሰረት ምንድን ነው ብሎ ነበር የሚያምነው?", "በአናክሲሜነስ አመለካከት የዚህ ዓለም ጥንተ መሰረት ምንድን ነው?", "ታሊዝ የተወለደበት ቦታ የቀድሞ ስም ማን ይባላል?", "የዚህ ዓለም ጥንተ ፍጥረቱ ከእሳት እንደሆነ የሚያምን የነበረው ፈላስፋ ማነው?", "በ516 ዓክልበ. በዴሞክራሲያዊ መንገድ የተሻሸለ ለአቴና ሕገ መንግሥት ያወጣው ማን ነበር?", "ክሊስቴኔስ በዴሞክራሲያዊ መንገድ የተሻሸለ ለአቴና ሕገ መንግሥት ያወጣው መች ነበር?", "አሪስጣጣሊስ የየት ሀገር ፈላስፋ ነው?", "በ350ዓክልበ. ስለ ሕገ መንግሥት ያወቀው ግሪካዊ ፈላስፋ ማን ነበር?", "ሮማውያን 12ቱ ሰንጠረዦች የተሰኘውን ሕጋቸውን መች ነበር ለመጀመሪያ ጊዜ ያወጡት?", "በ457 ዓክልበ. ሮማውያን ለመጀመሪያ ጊዜ ያወጡት ሕግ ምን በመባል ይጠራ ነበር?", "12ቱ ሰንተረዦች የተባለ ሕገ መንግስት በ457 ዓክልበ. ለመጀመሪያ ጊዜ ያዘጋጁት እነማን ነበሩ?", "የግሪኩ ፈላስፋ አሪስጣጣሊስ መች ነበር ስለሕገ መንግሥት ሀሣብ ለይቶ ያወቀው?", "ድራኮ የአቴና ሕግጋትን መች ጻፈ?", "ከመጀመሪያው የአቴና ሕግ ቀጥሎ አዲስ ሕገ መንግሥት የፈጠረው የአቴና አለቃ ማን ነበር?", "በ628 ዓክልበ. ማን የአቴና ሕግጋትን ጻፈ?", "ከመጀመሪያው ሕግ ቀጥሎ የአቴናው አለቃ ሶሎን አዲሱን ሕገ መንግሥት መች ፈጠረ?", "ድራኮ በ628 ዓክልበ. አቴናን በተመለከተ የጻፈው ምንድን ነው?", "በግብጽ ሀገር አቡል ፋዳዒል እብን አል-አሣል ያዘጋጀው ፍትሐ ነገሥት መች ተጻፈ?", "በግብጽ ሀገር አቡል ፋዳዒል እብን አል-አሣል ያዘጋጀው ፍትሐ ነገሥት በምን ቋንቋ ተጻፈ?", "በ1240 በግብጽ ሀገር በአረብኛ ፍትሐ ነገሥት ያዘጋጀው ማን ነበር?", "ፍትሐ ነገሥት ወደ ግእዝ ተተርጉሞ ኢትዮጵያ የገባው መች ነበር?", "ፍትሐ ነገሥት ወደ ግእዝ ተተርጉሞ ኢትዮጵያ የገባው በማን ዘመን ነበር?", "ፍትሐ ነገሥት ለመጀመሪያ ጊዜ በኢትዮጵያ በሕገ መንግሥትነት ጥቅም ላይ የዋለው መች ነበር?", "ፍትሐ ነገሥት ለመጀመሪያ ጊዜ በኢትዮጵያ በሕገ መንግሥትነት አገለግሎት መስጠት የጀመረው በማን ጊዜ ነበር?", "በኢትዮጵያ ለመጀመረያ ጊዜ ዘመናዊ ሕገ መንግሥት የታወጀው መች ነበር?", "በአጼ ቀዳማዊ ኃይለ ሥላሴ በ1923 ዓ.ም. ታውጆ የነበረው ሕገ መንግሥት እስከ መቼ አገልግሎት ላይ ዋለ?", "በኢትዮጵያ ለመጀመረያ ጊዜ ዘመናዊ ሕገ መንግሥት የታወጀው በማን ነበር?", "በአጼ ቀዳማዊ ኃይለ ሥላሴ በ1923 ዓ.ም. ጀምሮ ሲያገለግል የነበረው ሕገ መንግሥት መች ተሻሻለ?", "በአጼ ቀዳማዊ ኃይለ ሥላሴ ታውጆ እስከ 1948 አ.ም. ሲያገለግል የነበረው ሕገ መንግሥት መች ነበር የታወጀው?", "በአጼ ቀዳማዊ ኃይለ ሥላሴ ዘመነ መንግሥት በ1948 ዓ.ም. የተሻሽለው ሕገ መንግሥት እስከ መቼ አገለገለ?", "ኤርትራ ከቀይ ባህር ጋር የምትዋሰነው በየት አቅጣጫ ነው?", "ኤርትራ ከኢትዮጵያ ጋር የምትዋሰነው በየት አቅጣጫ ነው?", "ኤርትራ ጅቡቲን የምትጎራበተው በየት አቅጣጫ ነው?", "ኤርትራ ከሱዳን ጋር የምትዋሰነው በየት አቅጣጫ ነው?", "ኤርትራ በደቡብ በኩል ከማን ጋር ትዋሰናለች?", "ኤርትራ በየት የምትገኝ ሀገር ናት?", "ኤርትራን በደቡብ-ምሥራቅ የምትጎራበታት ሀገር ማናት?", "ኤርትራ የት አህጉር ትገኛለች?", "ኤርትራ በሰሜን-ምሥራቅ የምትዋሰነው ከየትኛው ባህር ጋር ነው?", "ኤርትራ በሰሜን-ምዕራብ በኩል ከማን ጋር ትዋሰናለች?", "የእንግሊዝ ጦር በኤርትራ ያለውን የጣልያን ጦር አሸንፎ ሀገርቷን የተቆጣጠረው መች ነበር?", "በ1905 የኤርትራ ሕዝብ ብዛት ስንት ነበር?", "በ1935 በኤርትራ የትግረኛ ቋንቋ ተናጋሪዎች ምን ያህል ነበሩ?", "በ1935 የኤርትራ ሕዝብ ብዛት ስንት ነበር?", "ኮምፒዩተር ላይ የሚታዩ ነገሮችን ለማሳየት የሚጠቅመው ክፍል ምን ይባላል?", "ኮምፒዩተር ውስጥ ያሉ የትኛውም አካላዊ ክፍሎች የሚሰኩበት ክፍል ምን ይባላል?", "ማንኛውም በኮምፒዩተር ፕሮሰስ የሚያደረጉ ነገሮችን የሚከውን የኮምፒዩተሩ ክፍል ወይም አንጎል ምን ይባላል?", "ማንኛውም በኮምፒዩተር ፕሮሰስ የሚያደረጉ ነገሮችን በጊዜያዊነት የሚያጠራቅም የኮምፒዩተሩ ክፍል ምን ይባላል?", "በኮምፒዩተር ውስጥ መረጃን በቋሚነት ለማጠራቀም የሚጠቅም የኮምፒዩተሩ ክፍል ምን ይባላል?", "መረጃን ፕሮሰስ ለማድረግ የምንጠቀምበት ኤሌክትሮኒክ መሳሪያ ምን ይባላል?", "የደቡብ አፍሪካ ትልቁ ከተማ ማነው?", "በደቡብ አፍሪካ ፓርላሜንቱ የሚገኘው የት ከተማ ነው?", "በደቡብ አፍሪካ ታዋቂ የሆኑት ሂው ማሴኬላ እና ሌዲስሚስ ብላክ ማምባዞ ሙያቸው ምንድን ነው?", "የደቡብ አፍሪካ ሙዚቀኞች የራሳቸው ዘመናዊ ሙዚቃ ምን ይባላል?", "በደቡብ አፍሪካ ተወዳጅ ስፖርቶች ምን ምን ናቸው?", "በደቡብ አፍሪካ ካሉ ቋንቋዎች ከፍተኛ ተናጋሪዎች ያለው የቱ ነው?", "በደቡብ አፍሪካ በስፋት ከሚነገሩ ቋንቋዎች በተናጋሪ ብዛት ሁለተኛ ደረጃ ያለው የቱ ነው?", "በደቡብ አፍሪካ የቆሣ ቋንቋ በተናጋሪ ብዛት ስንተኛው ነው?", "በደቡብ አፍሪካ የአፍሪካንስ ቋንቋ በተናጋሪ ብዛት ስንተኛው ነው?", "በደቡብ አፍሪካ በተናጋሪ ብዛት ሦስተኛው ቋንቋ የቱ ነው?", "በደቡብ አፍሪካ የእንግሊዝኛ ቋንቋ በተናጋሪ ብዛት ስንተኛው ነው?", "በደቡብ አፍሪካ የንዴቤሌም ቋንቋ በተናጋሪ ብዛት ስንተኛው ነው?", "በደቡብ አፍሪካ በተናጋሪ ብዛት የመጨረሻውን ደረጃ የያዘው ቋንቋ የቱ ነው?", "በደቡብ አፍሪካ ቤተመንግሥቱ የሚገኘው የት ከተማ ነው?", "በደቡብ አፍሪካ በተናጋሪ ብዛት 10ኛውን ደረጃ የያዘው ቋንቋ የቱ ነው?", "በደቡብ አፍሪካ የቬንዳ ቋንቋ በተናጋሪ ብዛት ስንተኛው ነው?", "በደቡብ አፍሪካ ስንት ቋንቋዎች በሕገ መንግሥቱ እኩል ተቀባይነት እንዳላቸው ተደንግጓል?", "በአፍሪካ የመጀመሪያው የቴሌቪዥን ስርጭት  የተደረገው መች ነው?", "በአፍሪካ የመጀመሪያው የቴሌቪዥን ስርጭት የተደረገው የት ነው?", "የመጀመሪያው የቀለም ቴሌቪዥን ስርጭት ሙከራ የተደረገው መች ነው?", "ጁላይ 3, 1928 እ.ኤ.አ. የመጀመሪያውን የቀለም ቴሌቪዥን ሙከራ ስርጭት ያደረገው ማነው?", "ቤርድ ጁላይ 3, 1928 እ.ኤ.አ. ምን ያደረገበት ቀን ነው?", "በኢትዮጵያ የቀለም ቴሌቭዥን ስርጭት የተጀመረው ከመቼ ጀምሮ ነው?", "በጃፓን የቀለም ቴሌቭዥን ስርጭት የተጀመረው ከመቼ ጀምሮ ነው?", "በኮትዲቯር የቀለም ቴሌቭዥን ስርጭት የተጀመረው መቼ ነው?", "በአውስትራሊያ የቀለም ቴሌቭዥን ስርጭት የተጀመረው መቼ ነው?", "በዓለም የመጨረሻው ወደ ቀለም ቴሌቭዥን ስርጭት የገባው ሀገር ማነው?", "በሶቭየት ኅብረት የቀለም ቴሌቭዥን ስርጭት የተጀመረው መቼ ነው?", "በኢትዮጵያ የቴሌቪዥን ስርጭት የተጀመረው መቼ ነው?", "NBC የተባለው የአሜሪካ የቴሌቭዥን ስርጭት ድርጅት ከመች ጀምሮ በከፊል የቀለም ስርጭት ጀመረ?", "ሩማንያ የቀለም የቴሌቭዥን ስርጭት የተጀመረው መቼ ነው?", "መቼ የተካሄደው የኦሎምፒክ ውድድር ነው ለመጀመሪያ ጊዜ በቴሌቭዥን የተሰራጨው?", "በየት ሀገር የተካሄደው የኦሎምፒክ ውድድር ነው በቴሌቭዥን ለመጀመሪያ ጊዜ የተሰራጨው?", "የሞሪታንያ ዋና ከተማ ማን ይባላል?", "በሞሪታንያ ከ5ኛው እስከ 7ኛው ክፍለ ዘመን የነበሩ ሕዝቦች ማን ይባላሉ?", "በሞሪታንያ ከ5ኛው እስከ 7ኛው ክፍለ ዘመን የነበሩ ሕዝቦች በማን ፍልሰት ምክንያት ነው የተፈናቀሉት?", "ሞሪታንያ ከሴኔጋል ጋር በየት አቅጣጫ ትዋሰናለች?", "ሞሪታንያ በደቡብ-ምእራብ አቅጣጫ የምትዋሰነው ከማን ጋር ነው?", "ሞሪታንያ ከአልጄሪያ ጋር በየት አቅጣጫ ትዋሰናለች?", "ሞሪታንያ በሰሜን-ምሥራቅ አቅጣጫ የምትዋሰነው ከማን ጋር ነው?", "ሞሪታንያ የምትገኘው የት አህጉር ነው?", "ሞሪታንያ በምእራብ አቅጣጫ የምትዋሰነው ከማን ጋር ነው?", "ሞሪታንያ ከአትላንቲክ ውቅያኖስ ጋር በየት አቅጣጫ ትዋሰናለች?", "ሞሪታንያ በአፍሪካ በየት አቅጣጫ ትገኛለች?", "ኤስፔራንቶ የተሰኘውን ሰው ሰራሽ ቋንቋ ለህዝብ ያስተዋወቀው ማን ነው?", "ሉድዊክ ሌይዛር ዛመንሆፍ ኤስፔራንቶ የተሰኘውን ዓለም አቀፋዊ ቋንቋ ያስተዋወቀው መቼ ነበር?", "ኤስፔራንቶ የተሰኘውን ዓለም አቀፋዊ ቋንቋ ያስተዋወቀው ሉድዊክ ሌይዛር ዛመንሆፍ የተወለደው የት ነው?", "ኤስፔራንቶ የተሰኘውን ዓለም አቀፋዊ ቋንቋ ያስተዋወቀው ሉድዊክ ሌይዛር ዛመንሆፍ የተወለደው መቼ ነው?", "ኤስፔራንቶ የተሰኘውን ዓለም አቀፋዊ ቋንቋ በዓለም ምን ያህል ተናጋሪዎች አሉት?", "ኤስፔራንቶ የተሰኘውን ዓለም አቀፋዊ ቋንቋ ያስተዋወቀው ሉድዊክ ሌይዛር ዛመንሆፍ ሙያው ምን ነበር?", "ሴኔጋል በሰሜን በኩል በማን ትዋሰናለች?", "ሴኔጋል በምስራቅ አቅጣጫ በማን ትዋሰናለች?", "ሴኔጋል ከማሊ ጋር ከየት አቅጣጫ ትዋሰናለች?", "ጊኒና ጊኒ-ቢሳው ሴኔጋልን ከየት አቅጣጫ ያዋስኑዋታል?", "ሴኔጋል የቆዳ ስፋቷ ምን ያህል ነው?", "የሴኔጋል ዋና መዲና ማን ነው?", "ሴኔጋል በአፍሪካ በየትኛው አቅጣጫ የምትገኘው ሀገር ናት?", "ሴኔጋል በየትኛው አህጉር ውስጥ የምትገኘው ሀገር ናት?", "የሴኔጋል ዋና ከተማ ዳካር በሀገሪቱ በየት አቅጣጫ ይገኛል?", "የሴኔጋል ዋና ከተማ ዳካር የሚገኝበት ልሳነ ምድር ምን ተብሎ ይጠራል?", "የኬፕ ቨርድ ደሴቶች በየትኛው ውቅያኖስ ይገኛሉ?", "በሴኔጋል ዋናው ሃይማኖት ምንድን ነው?", "የእስልምና ሃይማኖት በሴኔጋል የተዋወቀው መቼ ነው?", "የሴኔጋል ቅኝ ገዢ የነበረችው ሀገር ማን ነበረች?", "የሴኔጋል ቅኝ ገዢ የነበረችው ፈረንሳይ በመላው ሀገሪቱ ግዛቷን ያስፋፋችው መቼ ነበር?", "እንግሊዝ ፣ ኔዘርላንድስ እና ፖርቱጋል በሴኔጋል ለመነገድ ይፎካከሩ የነበረው መቼ ነበር?", "ሴኔጋል ከሞሪታንያ ጋር የምትዋሰነው በየት አቅጣጫ ነው?", "ዳካር የሴኔጋል ምንድን ነው?", "የአዶልፍ ሂትለር መንግሥት የፊንላንድ ሕዝቦች መቼ ነበር እንደ አርያኖች ዘር የቆጠረው?", "አዶልፍ ሂትለር ምን ያህል አይሁዶችን አስገደለ?", "አዶልፍ ሂትለር አይሁድ ያልሆኑ ስንት የተለያዩ ሀገራት ዜጎችን አስገደለ?", "የአዶልፍ ሂትለር መንግሥት የሀንጋሪ ሕዝቦችን መቼ ነበር እንደ አርያኖች ዘር የቆጠረው?", "በአዶልፍ ሂትለር መንግሥት በ1926 ዓም የማን ሕዝቦች ናቸው የአርያኖች ዘር የተደረጉት?", "የአዶልፍ ሂትለር መንግሥት የጃፓን ሕዝቦችን መቼ ነበር እንደ አርያኖች ዘር የቆጠረው?", "በአዶልፍ ሂትለር መንግሥት በ1928 ዓም የማን ሕዝቦች ናቸው የአርያኖች ዘር የተደረጉት?", "በአዶልፍ ሂትለር መንግሥት በ1934 ዓም የማን ሕዝቦች ናቸው የአርያኖች ዘር የተደረጉት?", "አዶልፍ ሂትለር ከመቼ ጀምሮ የጀርመን ቻንስለር ሆነ?", "አዶልፍ ሂትለር መቼ ተወለደ?", "የአዶልፍ ሂትለር የትውልድ ቦታ የት ነው?", "አዶልፍ ሂትለር ሕይወቱን ያጠፋው መች ነበር?", "አዶልፍ ሂትለር የመጨረሻ ባለቤቱ ማን ትባላለች?", "አዶልፍ ሂትለር የራሱንና የመጨረሻ ባለቤቱን ሕይወት ያጠፋው የት ከተማ ነበር?", "በሴኒጋል ፕሬዝዳንት ሊዎፖልድ ሴንግሆር በማማዱ ዲያ መፈንቅለ-መንግሥት ሙከራ የተደረገባቸው መቼ ነበር?", "በ1981 እ.ኤ.ኣ. የተመረጠው የሴኔጋል ፕሬዝዳንት አብዱ ዲዮፍ በስልጣን ከመቼ እስከ መቼ ቆየ?", "በሴኒጋል ፕሬዝዳንት ሊዎፖልድ ሴንግሆር በስልጣን ሳሉ በዲሴምበር 1962 እ.ኤ.አ. መፈንቅለ-መንግሥት ሙከራ ያደረገባቸው ማን ነበር?", "ሴኔጋል የፕሬዘንዳቶች ምርጫ ከ2001 ዓ.ም. በፊት በየስንት ዓመቱ ታደርግ ነበር?", "በሴኔጋል ፕሬዝዳንት ሊዎፖልድ ሴንግሆር በገዛ ፈቃዳቸው ሥልጣን የለቀቁት መች ነበር?", "ሴኔጋል የፕሬዘንዳቶች ምርጫ ከ2001 ዓ.ም. በኋላ በየስንት ዓመቱ ማድረግ ጀመረች?", "ሴኔጋልና ጋምቢያ በፌብሩዋሪ 1፣ 1982 እ.ኤ.አ. ባደረጉት ስምምነት የፈጠሩት ምን ነበር?", "በፌብሩዋሪ 1፣ 1982 እ.ኤ.አ. ሴኔጋል ከማን ጋር ነው ኮንፌደሬሽን የመሰረተችው?", "በሴኔጋል ከቅኝ ግዛት ነጻነት በኋላ የመጀመሪያ ፕሬዘዳንት የሆነው ማን ነው?", "በሴኔጋል ከቅኝ ግዛት ነጻነት በኋላ የመጀመሪያ ፕሬዘዳንት የሆነው ሊዎፖልድ ሴንግሆርም ስልጣን የያዘው መቼ ነበር?", "የሴኔጋል ፕሬዝዳንት አብዱ ዲዮፍ በምርጫ ስንት ዙር አሸነፈ?", "የሴኔጋል ፕሬዝዳንት አብዱ ዲዮፍ መቼ በተደረገው ምርጫ ነበረ የተሸነፈው?", "በሴኔጋል በዲሴምበር 1962 እ.ኤ.አ. ማማዱ ዲያ መፈንቅለ-መንግሥት ሙከራ ያደረገው በማን ላይ ነበር?", "የሴኔጋል ፕሬዝዳንት አብዱ ዲዮፍ በምርጫ ተሸንፎ ስልጣኑን ያስረከበው ለማን ነበር?", "በሴኔጋል ከሊዎፖልድ ሴንግሆር ቀጥሎ ፕሬዝዳንት የሆነው ማነው?", "አብዱላይ ዋዲ ለመጀመሪያ ጊዜ የሴኔጋል ፕሬዝዳንት የሆነው መቼ በተደረገው ምርጫ አሸንፎ ነው?", "በ1980 እ.ኤ.ኣ. ስልጣናቸውን በገዛ ፈቃዳቸው የለቀቁት የሴኔጋል ፕሬዝዳንት ሊዎፖልድ ሴንግሆር እርሳቸውን እንዲተኳቸው የመረጡት ማንን ነበር?", "በሴኔጋል ፕሬዝዳንት አብዱላይ ዋዲ በምርጫ አሸንፎ ስልጣን የተረከበው ከማን ነበር?", "ከ1981 እ.ኤ.ኣ. ለሃያ ዓመት የሴኔጋል ፕሬዝዳንት የነበሩትት አብዱ ዲዮፍ መጀመሪያ ወደ ስልጣን የመጡት በማን አማካኝነት ነበር?", "በሴኔጋል አብዱ ዲዮፍ ከመቼ ጀምሮ ነው ወደ ፕሬዝዳንትነት ስልጣን የመጡት?", "ሴኔጋል ከጋምቢያ ጋር ተዋሕዳ ኮንፌደሬሽን የመሰረተችው መች ነበር?", "በደቡባዊ ሴኔጋል በካሳማንክ አካባቢ የሚገኙ አማጺዎች ከሴኔጋል መንግሥት ጋር ከመቼ ጊዜ አንስቶ ነበር ሲጋጩ የነበሩት?", "ሴኔጋል ከጋምቢያ ጋር ተዋሕዳ ፈጥራው የነበረው ኮንፌደሬሽን ከስንት ዓመት በኋላ ፈረሰ?", "አብዱ ዲዮፍ ከመቼ እስከ መቼ የሴኔጋል ፕሬዝዳንት ነበሩ?", "ሴኔጋል ከጋምቢያ ጋር ተዋሕዳ ፈጥራው የነበረው ኮንፌደሬሽን ስምምንት መቼ ፈረሰ?", "በሴኔጋል የፕሬዝደንትነት ምርጫ ውድድር በየሰባት ዓመት የነበረው በየአምስት ዓመቱ እንዲሆን የተደረገው ከመቼ ጀምሮ ነው?", "በሴኒጋል ፕሬዝዳንት ሊዎፖልድ ሴንግሆር ስልጣን ላይ ሳሉ ጠቅላይ ሚንስትሩ ማን ነበር?", "በፌብሩዋሪ 1፣ 1982 እ.ኤ.አ. ጋምቢያና ማን ናቸው በኮንፌደሬሽን የተዋሐዱት?", "በዓለም ከሚገኙ ሰው ሰራሽ ሐይቆች ትልቁ የት ሀገር ይገኛል?", "በጋና የሚገኘው ትልቁ ሰው ሰራሽ ሐይቅ ምን ይባላል?", "በጋና ብሔራዊ ቋንቋ ባይሆንም በስፋት የሚነገረው ምንድን ነው?", "በጋና ምን ያህል ሕዝብ ይኖራል?", "በአፍሪካ ካሉ ሀገራት ጋና በየትኛው ውቅያኖስ ጠረፍ ላይ ይገኛል?", "ቮልታ ሐይቅ የት ይገኛል?", "ጋና በየት አህጉር የሚገኝ ሀገር ነው?", "በዓለም ከሚገኙ ሰው ሰራሽ ሐይቆች ትልቁ የቱ ነው?", "ቮልታ ሐይቅ ምን ዓይነት ሐይቅ ነው?", "በጋና የአሻንቲ መንግሥት የቆየው ከመቼ እስከ መቼ ነበር?", "በጋና ከ1662 እስከ 1949 ዓም የቆየው መንግሥት ምን ተብሎ ይጠራ ነበር?", "በጋና የክርስቲያኖች ብዛት በመቶኛ ምን ያህል ነው?", "በጋና የሙስሊሞች ብዛት በመቶኛ ምን ያህል ነው?", "የጋና ዋና ምርቶች ምንድን ናቸው?", "የጋናውያን ብሔራዊ ቋንቋ ምንድን ነው?", "ቮልታ ሐይቅ በዓለም ካሉ ከሰው ሠራሽ ሐይቆች ሲነጻጸር መጠኑ እንዴት ነው?", "የማሊ ፌደሬሽን ማሊን ከሴኔጋል ጋር በማድረግ የተፈጠረው መች ነበር?", "የማሊ ሪፐብሊክ መሪ የነበረው ማውሳ ትራዎሬ ከስልጣን የወረደው መቼ ነበር?", "ማውሳ ትራዎሬ ወደ ማሊ ሪፐብሊክ መሪነት የመጣው መቼ ነበር?", "በማሊ በ1992 እ.ኤ.አ. የተደረገውን ዲሞክራሲያዊ ምርጫ በማሸነፍ ወደ ስልጣን የመጡት መሪ ማን ይባለሉ?", "በማሊ በተደረገው ዲሞክራሲያዊ ምርጫ በማሸነፍ አልፋ ዑመር ኮናሬ ወደ ስልጣን የመጡት መቼ ነበር?", "ማሊ ከምዕራብ አፍሪካ ሀገሮች በቆዳ ስፋቷ ስንተኛ ናት?", "ከምዕራብ አፍሪካ ሀገሮች በቆዳ ስፋቷ ሁለተኛ የሆነችው ሀገር ማናት?", "ማሊ በ1880 እ.ኤ.አ. በማን ቅኝ ተገዛች?", "ፈረንሳያዊ ሱዳን በመባል የምትታወቀው አፍሪካዊ ሀገር ማናት?", "ማሊ ከፈረንሳይ ነጻነቷን ያገኘችው መቼ ነበር?", "የማሊ ሪፐብሊክ መሪ የነበረው ሞዲባ ኪየታ በመፈንለ-መንግሥት ከስልጣኑ የወረደው መቼ ነበር?", "በማሊ በእርሻና በዓሣ ማጥመድ የሚተዳደረው በመቶኛ ምን ያህል ሕዝብ ይሆናል?", "በመጋቢት 26 1951 ዓ.ም. የማሊ ፌደሬሽን የተፈጠረው ማሊን ከማን ጋር በማድረግ ነበር?", "ማሊ ከፈረንሳይ በመስከረም 12 ቀን 1953 ዓ.ም. ነጻነቷን ስታገኝ የሀገሪቱ መሪ ማን ነበር?", "የማሊ ሪፐብሊክ 1968 እ.ኤ.ኣ. እስከ 1991 እ.ኤ.አ. የተመራች በማን ነበር?", "በማሊ ሸክላ የሚሰሩበት መንገድ ምን ጥቅም አስገኝቶላቸዋል?", "በማሊ አብዛኛው የሀገሪቱ ክፍል በምን በረሃ ውስጥ ይገኛል?", "በማሊ ፓርላማ ውስጥ ስንት የሕዝብ ተወካዮች አሉ?", "በማሊ በመቶኛ ምን ያህሉ መሬት በረሃማ ነው?", "በማሊ አብላጫው የኢኮኖሚ እንቅስቃሴ የሚደረገው የት አካባቢ ነው?", "ማሊ በአፍሪካ በየትኛው አቅጣጫ ትገኛለች?", "በማሊ ከሚኖረው ሕዝብ በመቶኛ ምን ያህሉ ነው ከቦታ ቦታ እየተንቀሳቀሰ የሚኖረው?", "ማሊ የምትገኘው የት አህጉር ውስጥ ነው?", "በመጋቢት 26 1951 ዓ.ም. ማሊን ከሴኔጋል ጋር በማድረግ የተፈጠረው ፌደሬሽን ምን ይባል ነበር?", "የስዋሂሊ ቋንቋ የአፍ መፍቻቸው የሆኑ ምን ያህል ሕዝቦች አሉ?", "ስዋሂሊ ሁለተኛ ቋንቋቸው የሆኑ ምን ያህል ሕዝቦች አሉ?", "ስዋሂሊ የሚለው ቃል ምንጩ ከምን ቋንቋ ነው? ", "ስዋሂሊ በየት አካባቢ የሚነገር ቋንቋ ነው?", "ስዋሂሊ የምን ቋንቋ ቤተሰብ ነው?", "ቦትስዋና በደቡብና ደቡብ ምሥራቅ የምትዋሰነው ከማን ጋር ነው?", "ቦትስዋና ከናሚቢያ ጋር በየት አቅጣጫ ትዋሰናለች?", "ቦትስዋና በምዕራብና ሰሜን ምሥራቅ የምትዋሰነው ከማን ጋር ነው?", "ቦትስዋና ከዚምባብዌ ጋር በየት አቅጣጫ ትዋሰናለች?", "ቦትስዋና ሰባ በመቶ ያህል የተሸፈነችው በየትኛው በረሃ ነው?", "ቦትስዋናን ካለሃሪ በርሃ ምን ያህል ሸፍኗታል?", "ቦትስዋና በሰሜን ምሥራቅ የምትዋሰነው ከማን ጋር ነው? ", "ቦትስዋና በአፍሪካ በየትኛው ክፍል ትገኛለች?", "ቦትስዋና የት አህጉር የምትገኝ ሀገር ነች?", "ቦትስዋና በፊት የማን ቅኝ ግዛት ነበረች?", "ቦትስዋና ከቅኝ ግዛት ነጻነቷን ያገኘችው መቼ ነው?", "ቦትስዋና በጣም ትንሽ በሆነ ርቀት ማለትም በመቶ ሜትሮች በሚቆጠር የምትዋሰነው ከማን ጋር ነው?", "ቦትስዋና ከደቡብ አፍሪካ ጋር በየት አቅጣጫ ትዋሰናለች?", "ብሪታኒያዊው ሴሲል ሮድስ ከንዴቤሌ ንጉሥ ሎቤንጉላ የማዕደን ማውጣት ፈቃድ ያገኘው መቼ ነበር?", "የሮዴዢያን ግዛት ከኢያን ስሚዝ መንግሥት ነጻነቷን ያገኘችው መቼ ነበር?", "በዚምባብዌ በስሚዝ አመራር ወቅት ሮበርት ሙጋቤ የሚመሩት ፓርቲ ምን ይባላል?", "በ1981 ዓ.ም. ንጉሥ ሌቤንጉላ የማዕድን ማውጣት ፈቃድ የሰጠው ለማን ነበር?", "የዚምባቡዌ ሀገር ቀድሞ ምን ተብሎ ይታወቅ ነበር?", "ዚምባቡዌያውያን ከሙስሊም ነጋዴዎች ጋር በኢንዲያን ባህር ንግድ የጀመሩት መቼ ነበር?", "በ1881 ዓ.ም. ለብሪታኒያዊው ሴሲል ሮድስ የማዕድን ማውጣት ፈቃድ የሰጠው ንጉሥ ማን ነበር?", "በ1981 ዓ.ም. ንጉሥ ሌቤንጉላ ዜግነቱ ምናዊ ለሆነ ሰው ነበር የማዕድን ማውጣት ፈቃድ የሰጠው?", "በ1945 ዓ.ም. ብሪታንያ ደቡብና ሰሜን ሮዴዢያዎች ከኒያሳላንድ ጋር አንድ ላይ በማድረግ የፈጠረችው ፌዴሬሽን ምን ይባል ነበር?", "ሁሉም የዚምባቡዌ ፓርቲዎች በለንደን ተገናኝተው የእርስ-በርስ ጦርነቱን ለማቆም የላንካስተር ቤት ስምምነትን የተፈራረሙት መቼ ነበር?", "በዚምባብዌ በስሚዝ አመራር ወቅት የዚምባብዌ አፍሪካዊ ብሔራዊ ሕብረት በማን ይመራ ነበር?", "በዚምባቡዌ በብረት ዘመን የነበሩ የባንቱ ቋንቋ የሚናገሩ ሰዎች ወደ አካባቢው ከስንት ዓመታት በፊት ፍልሰት ጀመሩ?", "በ1981 ዓ.ም. ንጉሥ ሌቤንጉላ የማዕድን ማውጣት ፈቃድ ለሴሲል ሮድስ መስጠቱ ቦታው በማን ቅኝ እንዲገዛ አደረገ?", "በ1979 እ.ኤ.አ. ሁሉም የዚምባቡዌ ፓርቲዎች በለንደን ተገናኝተው የእርስ-በርስ ጦርነቱን ለማቆም የተፈራረሙት ስምምነት ምን ይባላል?", "በዚምባብዌ በስሚዝ አመራር ወቅት በጆሱዋ ንኮሞ የሚመራው ፓርቲ ምን ይባል ነበር?", "በ1828 ዓ.ም. በደቡባዊ ዚምባብዌ የነበሩ የሾና ሰዎች በማን ተወረሩ?", "ደቡባዊ ሮዴዢያ ራሱን የሚያስተዳድር የእንግሊዝ ግዛት የሆነው መቼ ነው?", "ደቡባዊ ሮዴዢያ የሮዴዢያ ሪፐብሊክ የተባለችው መቼ ነበር?", "የኢያን ስሚዝ መንግሥት በዚምባቡዌ ከሦስት መሪዎች ጋር የነጭ ዜጎች ደህንነት እንዲጠበቅ የተፈራረመው ስምምነት መቼ ነበር?", "የኢያን ስሚዝ መንግሥት በዚምባቡዌ ከሦስት መሪዎች ጋር በማርች 1978 እ.ኤ.አ. የተፈራረመው ስምምነት ላይ የነበሩት ጳጳስ ማናቸው?", "የዚምባቡዌ ሀገር በአፍሪካ በየትኛው ክልል ይገኛል?", "ከሁለት ሺህ ዓመታት በፊት የባንቱ ቋንቋ የሚናገሩ ሰዎች በየትኛው ዘመን ወደ አካባቢው መጡ?", "ንጉሥ ሎቤንጉላ ለብሪታኒያዊው ሴሲል ሮድስ የሰጠው ፈቃድ የምን ነበር?", "በ1887 ዓ.ም. የብሪታንያ ደቡብ አፍሪካ ድርጅት የዛምቤዚያን ስም ምን ብሎ ቀየረው?", "በዚምባብዌ በስሚዝ አመራር ወቅት የዚምባብዌ አፍሪካዊ ሕዝብ ሕብረት በማን ይመራ ነበር?", "ዚምባቡዌ የትኛው አህጉር ይገኛል?", "ወደ ዚምባቡዌ ከሁለት ሺህ ዓመታት በፊት በብረት ዘመን የፈለሱት ሰዎች የምን ቋንቋ ተናጋሪዎች ነበሩ?", "በ1887 ዓ.ም. የዛምቤዚያን ስም ሮዴዢያ (ለሴሲል ሮድስ) ብሎ የቀየረው ማነው?", "ብሪታንያ በ1945 ዓ.ም. የትኞቹን አካበቢዎች አንድ ላይ በማድረግ ነው የሮዴዢና ኒያሳላንድ ፌዴሬሽን የፈጠረችው?", "በ1979 እ.ኤ.አ. ሁሉም የዚምባቡዌ ፓርቲዎች የላንካስተር ቤት ስምምነትን የተፈራረሙት በየት ከተማ ነበር?", "በማርች 1978 እ.ኤ.አ. የኢያን ስሚዝ አመራር በዚምባቡዌ ከስንት መሪዎች ጋር ነበር የነጭ ዜጎች ደህንነት እንዲጠበቅ ስምምነት የተፈራረመው?", "በዚምባቡዌ አራት አምስተኛ የሚሆኑት ሰዎች የምን ሰዎች ናቸው?", "የብሪታንያ ደቡብ አፍሪካ ድርጅት የዛምቤዚያን ስም ሮዴዢያ (ለሴሲል ሮድስ) ብሎ ቀየረው መቼ ነበር?", "የኢያን ስሚዝ አመራር የሮዴዢያን ሪፕብሊክ መሆኑን ያስታወቀው መች ነበር?", "በማርች 1978 እ.ኤ.አ. የኢያን ስሚዝ አመራር የነጭ ዜጎች ደህንነት እንዲጠበቅ ስምምነት ሲፈራረም ዚምባቡያውያን በማን እየተመሩ ነበር?", "የድንጋይ ዘመን አዳኞች በዚምባቡዌ ከስንት ዓመት በፊት ይኖሩ ነበር?", "የኢያን ስሚዝ አመራር የሮዴዢያን ሪፕብሊክ በ1970 እ.ኤ.አ. ሲያውጅ እውቅና የሰጠው ብቸኛ ሀገር ማን ነበር?", "በዚምባቡዌ የሚገኙ ፍርስራሾች በመካከለኛው ዘመናት የምን ስልጣኔ እንደ ነበር ያሳያሉ?", "አሁን በዚምባቡዌ የሾና ሰዎች ስንት ስንተኛ ይሆናሉ?", "የብሪታንያው ድርጅት ደቡባዊ ሮዴዢያ ብሎ ይጠራው የነበረው የዛምቤዚያን አካባቢ አሁን ምን ተብሎ ይታወቃል?", "ብሪታንያ የፈጠረችው የሮዴዢና ኒያሳላንድ ፌዴሬሽን መቼ ተበተነ?", "የኢያን ስሚዝ መንግሥት በዚምባቡዌ ከሦስት መሪዎች ጋር በማርች 1978 እ.ኤ.አ. የተፈራረመው ስምምነት ስለምን ነበር?", "በ10ኛው ክፍለ ዘመን የነበሩ ዚምባቡዌያውያን ከሙስሊም ነጋዴዎች ጋር በየት ነበር ንግድ የጀመሩት?", "ዚምባቡዌያውያን ከሙስሊም ነጋዴዎች ጋር በኢንዲያን ባህር ንግድ መጀመራቸው ያደረገው አስተዋጽዖ ውጤቱ የታየው በስንተኛው ክፍለ ዘምን ነበር?", "የብሪታንያው ድርጅት ሰሜናዊ ሮዴዢያ ብሎ ይጠራው የነበረው የዛምቤዚያን አካባቢ አሁን ምን ተብሎ ይታወቃል?", "በ1945 ዓ.ም. ደቡብና ሰሜን ሮዴዢያዎች ከኒያሳላንድ ጋር አንድ ላይ በማድረግ የሮዴዢና ኒያሳላንድ ፌዴሬሽንን ማን ፈጠረው?", "በደቡባዊ ዚምባብዌ የነበሩ የሾና ሰዎች በንዴቤሌ ብሔር የተወረሩት መቼ ነበር?", "ብሪታንያ ደቡብና ሰሜን ሮዴዢያዎች ከኒያሳላንድ ጋር አንድ ላይ በማድረግ የሮዴዢና ኒያሳላንድ ፌዴሬሽን የፈጠረችው መቼ ነበር?", "የሮዴዢያን ግዛት ከብሪታንያ ነጻነቷን ያገኘችው መቼ ነበር?", "የቱርክምኒስታን ብሔራዊ ቋንቋ ምንድን ነው?", "ቱርክመንኛ የየት ሀገር የሥራ ቋንቋ ነው?", "በቱርክምኒስታን ምን ያህል የቱርክመንኛ ቋንቋ ተናጋሪ አለ?", "በኢራን ምን ያህል የቱርክመንኛ ቋንቋ ተናጋሪ አለ?", "በአፍጋኒስታን ምን ያህል የቱርክመንኛ ቋንቋ ተናጋሪ አለ?", "ቱርክመንኛ በላቲን ፊደላት እንዲጻፉ ያወጀው ሳፓርሙራት ኒያዞቭ ኃላፊነቱ ምን ነበር?", "በቱርክ ምን ያህል የቱርክመንኛ ቋንቋ ተናጋሪ አለ?", "ቱርክመንኛ በየትኛው የቋንቋ መደብ ውስጥ ይገኛል?", "ቱርክመንኛ በፊት በየትኞቹ ቋንቋዎች ፊደላት ነበር የሚጻፈው?", "አሁን ቱርክመንኛ የሚጻፈው በምን ፊደላት ነው?", "ቱርክመንኛ በላቲን ፊደላት እንዲጻፉ ያወጀው የቱርክመኒስታን መሪ ማን ነው?", "የቁሶችን አሰራር እና ጸባይ የሚያጠና ዘርፍ ምን ይባላል?", "ውክፔዲያ ምንድን ነው?", "የአማርኛ ውክፔዲያ መቼ መስራት ጀመረ?", "የኃይሌ ገብረሥላሴ የልደት ቀኑ መቼ ነው?", "ኃይሌ ገብረሥላሴ የተወለደው የት ሀገር ነው?", "ሯጭ ኃይሌ የአሥር ሺህ ሜትር ርቀት ሩጫ የወርቅ ሜዳልያ ያገኘው የት በተካሄደው ኦሎምፒክ ነበር?", "ኃይሌ ገብረሥላሴ የተወለደው መቼ ነው?", "ኃይሌ ገብረሥላሴ  ዜግነቱ ምናዊ ነው?", "ኃይሌ ገብረሥላሴ የተወለደው የት ነው?", "ኃይሌ ገብረሥላሴ ዜግነቱ ምንድን ነው?", "አትሌት ኃይሌ ገብረሥላሴ የምን ሀገር ሰው ነው?", "አትሌት ኃይሌ ገብረሥላሴ በምን በምን ውድድሮች ክብረ ወሰን አሻሻለ?", "አትሌት ኃይሌ ስንት ጊዜ የኦሎምፒክ ወርቅ ሜዳልያ አግኝቷል?", "ኃይሌ ገብረሥላሴ በሲድኒና በአትላንታ ኦሎምፒኮች በአሥር ሺህ ሜትር ሩጫ ያገኘው ውጤት ምን ነበር?", "ሯጭ ኃይሌ ገብረሥላሴ የሩጫ ሕይወቱን በተመለከተ የተሰራው ፊልም ርእሱ ምን ይባላል?", "አትሌት ኃይሌ ገብረሥላሴ በስንት ዓመቱ የማራቶን የዓለም ክብረ ወሰን አሻሻለ?", "ኃይሌ ገብረሥላሴ በሲድኒና በአትላንታ ኦሎምፒኮች የወርቅ ሜዳልያ ያገኘው በምን የሩጫ ዓይነት ነው?", "ሯጭ ኃይሌ በሩጫ ሕይወቱ ዙሪያ የሚያጠነጥነው ፊልም መቼ ተሰራ?", "አትሌት ኃይሌ ገብረሥላሴ የማራቶን የዓለም ክብረ ወሰን ያሻሻለው ውድድሩን በምን ያህል ሰዓት በመሮጥ ነው?", "አትሌት ኃይሌ ገብረሥላሴ የማራቶን የዓለም ክብረ ወሰን ሲያሻሻል እድሜው ምን ያህል ነበር?", "አትሌት ኃይሌ ገብረሥላሴ ስንት ክብረ ወሰኖችን ሰበረ?", "ኃይሌ ገብረሥላሴ የተወለደበት ቦታ ቀድሞ በየት ክፍለ ሃገር ነበር?", "የኃይሌ ገብረሥላሴ የትውልድ ሥፍራ የት ነው?", "በዓለም ሁለተኛ ትልቅ አህጉር ማን ነች?", "በአፍሪካ ምን ያህል ሕዝብ ይኖራል?", "በአፍሪካ ውስጥ ስንት ሀገሮች አሉ?", "በአፍሪካ በሕዝብ ብዛት አንደኛ ሀገር ማን ነች?", "በመልክአ ምድር አቀማመጥ አፍሪካንና አውሮፓን የሚለያቸው ባህር ምንድን ነው?", "በመልክአ ምድር አቀማመጥ አፍሪካ ከአሜሪካ የሚለያት ባህር ምንድን ነው?", "አፍሪካን ከእስያ የሚለያት ባህር ምንድን ነው?", "በአፍሪካና በእስያ አሕጉር መካከል ያለው መተላለፊያ ምን ይባላል?", "በአፍሪካና በእስያ አሕጉር መካከል ያለው መተላለፊያ ሱዝ ካናልን ያሰራው ማነው?", "ሙሴ ሌስፖስ ሱዝ ካናልን ለምን አሰራው?", "ንጉሠ ነገሥት አጼ ኃይለሥላሴ ከመቼ ጀምሮ በመሪነት ኢትዮጵያን መሩ?", "ቀዳማዊ ኃይለሥላሴ መቼ ተወለዱ?", "ንጉሠ ነገሥት አጼ ኃይለሥላሴ በስንት ዓመት ምሕረት ተወለዱ?", "ራስ ተፈሪ መኮንንና ልጅ እያሱ ያደረጉት ስምምነት ምን ነበር?", "ንጉሠ ነገሥት አጼ ኃይለሥላሴ ወደዚህ ዓለም የመጡበት ዕለት መቼ ነው?", "የአጼ ኃይለሥላሴ ወላጅ እናት ማን ይባላሉ?", "ቀዳማዊ ኃይለሥላሴ በኢትዮጵያ ከመቼ እስከ መቼ በንጉሥነት ቆዩ?", "ንጉሥ ተፈሪ መኮንን የትውልድ ስፍራቸው የት ነው?", "የተፈሪ መኮንን ወላጅ አባታቸው ማን ይባላሉ?", "መስከረም ፳፯ ቀን ፲፱፻፳፩ ዓ.ም. ራስ ተፈሪ መኮንን ከእንደራሴነት ስልጣን በተጨማሪ ያገኙት ኃላፊነት ምን ነበር?", "ራስ ተፈሪ መኮንን መጀመሪያ የየት አውራጃ አስተዳዳሪ ነበሩ?", "ራስ ተፈሪ መኮንን የሐረርጌ አውራጃ አስተዳዳሪ የሆኑት መቼ ነበር?", "በልጅ ኢያሱና በራስ ተፈሪ መካከል ተደርጎ የነበረው ስምምነት የተሻረው በምን ምክንያት ነው?", "የአጼ ኃይለ ሥላሴ ባለቤት ማን ይባሉ ነበር?", "አጼ ኃይለ ሥላሴ የንጉሠ ነገስትነት ማዕረግ ያገኙት ከማን ቀጥለው ነበር?", "የቀዳማዊ ኃይለ ሥላሴ የትዳር አጋር ማን ናቸው?", "በ፲፱፻፱ ንግስና ለእቴጌ ዘውዲቱ ሲሰጥ እንደራሴ ሆነው የተሾሙት ማን ነበሩ?", "ራስ ተፈሪ መኮንን በማን ዘመነ መንግሥት የእንደራሴነት ስልጣን ያዙ?", "ራስ ተፈሪ መኮንን የእንደራሴነት ስልንጣን የያዙት በስንት ዓመተ ምሕረት ነበር?", "ንጉሥ ኃይለ ሥላሴ የንጉሠ ነገስትነት ማዕረግ ያገኙት መቼ ነበር?", "ንግሥተ ነገስታት ዘውዲቱ መቼ ሞቱ?", "ንግሥተ ነገሥታት እቴጌ ዘውዲቱ ሲሞቱ የተኳቸው ማን ናቸው?", "የብርቱካን ዛፍ ቁመቱ ስንት ሜትር ይሆናል?", "የብርቱካን ፍሬ ለመጀመሪያ ጊዜ የተገኘው የት ነው?", "የብርቱካን ዛፍ ቅጠሎች ምን ያህል ስፋት አላቸው?", "የአቡጊዳ ሥረ መሰረቱ ከየት ነው?", "ኢትዮጵያን ለረጅም ዘመን ያስተዳድር የነበረው የሰለሞን ስርወ መንግስት መቀመጫው በየት ነበር?", "ግራኝ መሃመድ በኢትዮጵያ ወረራ ሲያካሄድ ንጉሱ ማን ነበሩ?", "በግራኝ መሃመድ ወረራ ምክንያት ኢትዮጵያ ከየትኛው የአውሮፓ ሀገር ጋር ግንኙነት ፈጠረች?", "በግራኝ መሃመድ ወረራ ወቅት ኢትዮጵያ ከማን ጋር ግንኙነት ፈጠረች?", "በኢትዮጵያ ዘመነ መሳፍንት ያበቃበት ዓመተ ምሕረት መቼ ነበር?", "ኢትዮጵያ ማእከላዊ አስተዳደር ሳይኖራት የቆየችበት ጊዜ ምን ይባላል?", "በኢትዮጵያ ዘመነ መሳፍንት ያስቆሙት ንጉሥ ማናቸው?", "በኢትዮጵያ ዘመነ መሳፍንት ለምን ያህል ጊዜ ቆየ?", "ዳግማዊ ሚኒሊክ ኢትዮጵያን ያስተዳደሩት ከመቼ እስከ መቼ ነበር?", "ኢትዮጵያን ከ1881 እስከ 1905 ያስተዳደሩት ንጉሥ ማን ነበሩ?", "ዳግማዊ ሚኒሊክ ኢትዮጵያን በሚያስተዳድሩበት ወቅት ከሰሩት አንዱ ተግባር ምን ነበር?", "ዳግማዊ ሚኒሊክ በአድዋ ጦርነት በጣልያን ላይ የተጎናጸፉት ድል ለሌሎች ፋይዳው ምን ነበር?", "በ1980 ኢትዮጵያ ጣልያንን ያሸነፈችበት ጦርነት ምን ይባላል?", "ኢትዮጵያ ጣልያንን ያሸነፈችበት የአድዋ ጦርነት የተካሄደው መቼ ነበር?", "ኢትዮጵያ በአድዋ ጦርነት ያሸነፈችው ማንን ነበር?", "በንጉሥ ዳግማዊ ሚኒሊክ ዘመን ለኢትዮጵያ አስጊ የነበረችው የኤርትራ ገዢ ሀገር ማን ነበረች?", "የነጭ ወራሪ ጦርን በማሸነፍ ታሪክ የሰራችው ብቸኛ አፍሪካዊት ሀገር ማን ናት?", "ኢትዮጵያ በአድዋ ጦርነት ጣልያንን ስታሸንፍ ንጉሡ ማን ነበሩ?", "የዳግማዊ ሚኒሊክ ልጅ ማን ይባላሉ?", "የዳግማዊ ሚኒሊክ ልጅ መቼ ሥልጣን ያዙ?", "የእቴጌ ዘውዲቱ አባት ማናቸው?", "እቴጌ ዘውዲቱ የአባታቸውን መንበር መቼ ያዙ?", "በኢትዮጵያ ታሪክ ከአክሱም መንግሥት ቀጥሎ ስልጣን ላይ የወጣው መንግስት ማን ነበር?", "በሰሜን ኢትዮጵያና ኤርትራ በ800 ዓመተ-ዓለም የተቋቋመው መንግስት ምን ይባል ነበር?", "የደአማት መንግሥት ከስልጣን የወደቀበት ዘመን መቼ ነበር?", "የአክሱም መንግስት ወደ ስልጣን የመጣው መቼ ነው?", "የአክሱም ግዛት የመንን ያካትት የነበረበት ጊዜ መቼ ነው?", "በስድስተኛው ዓመተ ዓለም የአክሱም መንግሥት ከኢትዮጵያ በተጨማሪ ማንን ያካተተ ነበር?", "በሰሜን ኢትዮጵያና ኤርትራ ደአማት የሚባል መንግስት የተቋቋመው መቼ ነው?", "ደአማት የተባለው መንግስት የተቋቋመው በየት አካባቢ ነበር?", "የደአማት መንግስት መናገሻ ከተማ ማን ነበረች?", "በደአማት መንግስት ላይ ተጽእኖ የነበራቸው እነማን ናቸው?", "የደአማት መናገሻ ከተማ በኢትዮጵያ በየትኛው ክፍል ትገኝ ነበር?", "ከደአማት መንግሥት ቀጥሎ ስልጣን ላይ የወጣው መንግስት ማን ነበር?", "የአክሱም መንግስት በዘመኑ ከየትኞቹ ጠንካራ መንግሥታት ጋር የሚነጻጸር ነበር?", "የአክሱም መንግስት የክርስትና ሃይማኖትን የተቀበለው መቼ ነበር?", "የሰለሞናዊ መንግስትን የመለሱት የመጀመሪያው ንጉስ ማናቸው?", "ይኵኖ አምላክ ወደ ስልጣን የወጡት መቼ ነበር?", "በኢትዮጵያ ስንት ቋንቋዎች ይነገራሉ?", "በኢትዮጵያ ስንት ብሔረሰቦች ይገኛሉ?", "በኢትዮጵያ ምን ምን ሃይማኖቶች በስፋት ይገኛሉ?", "የኢትዮጵያ የስራ ቋንቋ ምንድን ነው?", "ኩሻዊ የቋንቋ መደብ ውስጥ የሚጠቃለሉ የኢትዮጵያ ቋንቋዎችን ዘርዝር?", "አማርኛ የስራ ቋንቋ የሆነባት ሀገር ማን ናት?", "በኢትዮጵያ የሚነገሩ ቋንቋዎች በስንት ይከፈላሉ?", "በኢትዮጵያ የሚነገሩ ቋንቋዎች በምን በምን መደብ ይከፈላሉ?", "ኩሻዊ ቋንቋ በምን መደብ ይካተታል?", "የአፍሮ-ኤስያዊ ቋንቋ ቤተሰብ ንዑስ መደቦች እነማን ናቸው?", "ኦሮሚኛና ሱማሊኛ ቋንቋ በምን መደብ ይካተታሉ?", "አማርኛና ትግሪኛ ቋንቋ በምን መደብ ይካተታሉ?", "ከአባይ-ሰሃራዊ የቋንቋ መደብ የሚካተቱ ቋንቋዎች ምሳሌ ስጥ?", "ከአባይ-ሰሃራዊ የቋንቋ መደብ የሚካተቱ ቋንቋዎች እነማን ናቸው?", "ኦሮሚኛ፣ ሶማልኛ፣ አፋርኛ፣ ሲዳምኛ፣ ሃዲያኛ እና ከምባትኛ የምን ቋንቋ ወገን ናቸው?", "ሱዳን በአፍሪካ በቆዳ ስፋት ስንተኛ ናት?", "ሱዳን በአፍሪካ በየትኛው አቅጣጫ ትገኛለች?", "የሱዳን ዋና መዲና ማናት?", "ካርቱም የየትኛው ሀገር ዋና ከተማ ናት?", "ደቡብ ሱዳን ነጻ ሀገር የሆነች መቼ ነው?", "ደቡብ ሱዳን ነጻ ሀገር ለመሆን ሕዝበ ውሳኔ የተሰጠው መቼ ነበር?", "ከሱዳን ተገንጥላ ራሷን የቻለችው ሀገር ማን ትባባላለች?", "ደቡብ ሱዳን ተገንጥላ ሉዓላዊ ሀገረ ከመሆኗ በፊት የማን አካል ነበረች?", "አክሱም በኢትዮጵያ በየትኛው ክልል ትገኛለች?", "የአክሱም ስርወ መንግስት ቅሪት አካሎች በመያዟ በዩኔስኮ የቅርስ ቦታ ተብላ የተመዘገበችው መቼ ነው?", "የአክሱም ስርወ መንግስት መቀመጫ የነበረችው የኢትዮጵያ ከተማ ማናት?", "አክሱም በኢትዮጵያ በየት አቅጣጫ ትገኛለች?", "የናይጄሪያ ብሔራዊ ምክር ቤት አካሎች እነማን ናቸው?", "በናይጄሪያ የህዝብ ተወካዮች ምክር ቤት ስንት መቀመጫ አለ?", "ናይጄሪያ ነጻነቷን ያገኘችው መቼ ነው?", "ናይጄሪያ ነዳጅ በማምረት የኦፔክ አባል ሀገር የሆነችው ከመቼ ጀምሮ ነው?", "የናይጄሪያ ሴኔት ስንት መቀመጫዎች አሉት?", "የምእራብ አፍሪካ የትብብር ድርጅት ምን ይባላል?", "አንጎላ በአፍሪካ በየትኛው አቅጣጫ ትገኛለች?", "አንጎላ የማን ሀገር ቅኝ ተገዢ ነበረች?", "አንጎላ ከአትላንቲክ ውቅያኖስ ጋር የምትዋሰነው በየት አቅጣጫ ነው?", "አንጎላ በምዕራብ በኩል ከየትኛው ውቅያኖስ ጋር ነው የምትዋሰነው?", "በአንጎላ መጀመሪያ የመጡት ነዋሪዎች እነማን ነበሩ?", "የቢል ክሊንተን አባት በምን ምክንያት ሞቱ?", "ቢል ክሊንተን ወደዚህ ምድር ከመምጣታቸው ከስንት ጊዜ በፊት ነው አባታቸው የሞቱት?", "የቢል ክሊንተን አባት ስም ማነው?", "የቢል ክሊንተን እናት ስም ማነው?", "የቢል ክሊንተን ሚስት ማናት?", "ቢል ክሊንተን ትዳር መቼ ያዙ?", "ቢል ክሊንተን በአርካንሳው ዩኒቨርሲቲ የሠሩበት ሙያ ምን ነበር?", "ቢል ክሊንተን በሕግ ፕሮፌሰርነት የሠሩት የት ነበር?", "ቢል ክሊንተን የአርካንሳው አስተዳዳሪ ኃላፊነትን ለመጀመሪያ ጊዜ የያዙት መቼ ነበር?", "ቢል ክሊንተን እ.ኤ.ኣ. በ1978 የያዙት ኃላፊነት ምን ነበር?", "የቢል ክሊንተን የእድገታቸው ስፍራ የት ነበር?", "ቢል ክሊንተን ለአርካንሳው አስተዳዳሪነት ተወዳድረው የተሸነፉት መቼ ነበር?", "ቢል ክሊንተን ለአርካንሳው አስተዳዳሪነት ተወዳድረው የተሸነፉት በማን ነበር?", "ቢል ክሊንተን ለአርካንሳው አስተዳዳሪነት በ1982 እ.ኤ.አ. ድጋሚ ካሸነፉ በኋላ በአስተዳዳሪነት እስከ መቼ ቆዩ?", "ቢል ክሊንተን መች ነበር የአርካንሳው አስተዳዳሪነት ስልጣንን ከ2 ዓመት ወደ 4 ዓመት ያሳደጉት?", "ቢል ክሊንተን ለአሜሪካ ፕሬዝደንትነት ለመጀመሪያ ጊዜ የተወዳደሩት መች ነበር?", "ቢል ክሊንተን ለሁለተኛ ጊዜ የአሜሪካ ፕሬዝደንት ሆነው ያሸነፉት መች ነበር?", "ናይጄሪያ የምትገኘው በየት አህጉር ውስጥ ነው?", "ናይጄሪያ በህዝብ ብዛት ከአፍሪቃ ስንተኛ ናት?", "ናይጄሪያ ስያሜዋ የተወሰደው ከምንድን ነው?", "ናይጄሪያ በህዝብ ብዛት ከዓለም ስንተኛ ናት?", "ናይጄሪያ ምን ያህል ብሔሮች አሏት?", "በናይጄሪያ ምን ያህል የታወቁ ቋንቋዎች አሉ?", "በናይጄሪያ ተናጋሪ ያላቸው ስንት ቋንቋዎች አሉ?", "በኢትዮጵያ ዘመን አቆጣጠር የመጀመሪያው ቀን መች ይጀምራል?", "በኢትዮጵያ አዲስ ዓመት በዓል ወይም እንቁጣጣሽ መች ይከበራል?", "በኢትዮጵያ መስከረም ፩ የሚከበረው በዓል ምን ይባላል?", "ሰዎች ወደ ሰማይ ለመውጣት የሰሩት ግንብ ምን ይባላል?", "ሰዎች ወደ ሰማይ ለመውጣት የሰሩት ግንብ ትታሪክ በመጽሐፍ ቅዱስ የት ይገኛል?"]